{"metadata": {"Author": ["Haruyuki Minamitani", "Norihiro Hagita"], "Content-Type": "application/pdf", "Creation-Date": "2007-07-05T06:38:59Z", "IEEE Article ID": "4308725", "IEEE Issue ID": "4308721", "IEEE Publication ID": "21", "Last-Modified": "2022-07-12T17:27:38Z", "Last-Save-Date": "2022-07-12T17:27:38Z", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.pdf.PDFParser"], "X-TIKA:content_handler": "ToTextContentHandler", "X-TIKA:embedded_depth": "0", "X-TIKA:parse_time_millis": "132", "access_permission:assemble_document": "true", "access_permission:can_modify": "true", "access_permission:can_print": "true", "access_permission:can_print_degraded": "true", "access_permission:extract_content": "true", "access_permission:extract_for_accessibility": "true", "access_permission:fill_in_form": "true", "access_permission:modify_annotations": "true", "cp:subject": "IEEE Transactions on Systems, Man, and Cybernetics;1981;11;7;10.1109/TSMC.1981.4308725", "created": "2007-07-05T06:38:59Z", "creator": ["Haruyuki Minamitani", "Norihiro Hagita"], "date": "2022-07-12T17:27:38Z", "dc:creator": ["Haruyuki Minamitani", "Norihiro Hagita"], "dc:description": "IEEE Transactions on Systems, Man, and Cybernetics;1981;11;7;10.1109/TSMC.1981.4308725", "dc:format": "application/pdf; version=1.3", "dc:title": "A Neural Network Model of Pain Mechanisms: Computer Simulation of the Central Neural Activities Essential for the Pain and Touch Sensations", "dcterms:created": "2007-07-05T06:38:59Z", "dcterms:modified": "2022-07-12T17:27:38Z", "description": "IEEE Transactions on Systems, Man, and Cybernetics;1981;11;7;10.1109/TSMC.1981.4308725", "meta:author": ["Haruyuki Minamitani", "Norihiro Hagita"], "meta:creation-date": "2007-07-05T06:38:59Z", "meta:save-date": "2022-07-12T17:27:38Z", "modified": "2022-07-12T17:27:38Z", "pdf:PDFVersion": "1.3", "pdf:charsPerPage": ["5052", "4562", "3048", "5201", "5250", "5531", "3066", "3834", "4569", "4044", "5761", "5203", "6265"], "pdf:docinfo:created": "2007-07-05T06:38:59Z", "pdf:docinfo:creator": "Haruyuki Minamitani;Norihiro Hagita", "pdf:docinfo:custom:IEEE Article ID": "4308725", "pdf:docinfo:custom:IEEE Issue ID": "4308721", "pdf:docinfo:custom:IEEE Publication ID": "21", "pdf:docinfo:modified": "2022-07-12T17:27:38Z", "pdf:docinfo:producer": "Apex PDFWriter; modified using iText® 7.1.16 ©2000-2021 iText Group NV (AGPL-version)", "pdf:docinfo:subject": "IEEE Transactions on Systems, Man, and Cybernetics;1981;11;7;10.1109/TSMC.1981.4308725", "pdf:docinfo:title": "A Neural Network Model of Pain Mechanisms: Computer Simulation of the Central Neural Activities Essential for the Pain and Touch Sensations", "pdf:encrypted": "false", "pdf:hasMarkedContent": "false", "pdf:hasXFA": "false", "pdf:hasXMP": "true", "pdf:unmappedUnicodeCharsPerPage": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "producer": "Apex PDFWriter; modified using iText® 7.1.16 ©2000-2021 iText Group NV (AGPL-version)", "resourceName": "b'14.pdf'", "subject": "IEEE Transactions on Systems, Man, and Cybernetics;1981;11;7;10.1109/TSMC.1981.4308725", "title": "A Neural Network Model of Pain Mechanisms: Computer Simulation of the Central Neural Activities Essential for the Pain and Touch Sensations", "xmpTPg:NPages": "13"}, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nA Neural Network Model of Pain Mechanisms: Computer Simulation of the Central Neural Activities Essential for the Pain and Touch Sensations\n\n\nIEEE TRANSACTIONS ON SYSTEMS, MAN, AND CYBERNETICS, VOL. SMC-lI, NO. 7, JULY 1981\n\nA Neural Network Model of Pain Mechanisms:\nComputer Simulation of the Central Neural\n\nActivities Essential for the Pain\nand Touch Sensations\n\nHARUYUKI MINAMITANI AND NORIHIRO HAGITA\n\nAbstract-A neural network model is proposed to obtain a numerical\ndescription of pain mechanisms. The modeling presented here is based on\nthe various assumptions made by the results of physiological and anatomi-\ncal studies reported in the literature and by ourselves. Those studies,\nespecially on the neural connections between the neural units concerned in\nthe pain mechanisms do not give conclusive evidence, and some of the\nresults are claimed by other investigators. The assumptions used are\nunverified for this reason. The quantitative model presented is only a\nsimplified one and simulates only one directional ascending and descending\npathway for the pain sensation in which peripheral receptors, afferent A,\nA 5, and C fibers, and the receptive cells of spinal cord, brain stem,\nthalamus, and the cerebral cortex are involved. No interactions from the\nlateral adjacent fields such as lateral inhibition and facilitation have been\nproposed, and no analytical elucidation of spatial information processing\nmechanisms has been made. Only the firing characteristics of the neural\ncells related to pain generation are investigated and compared with the\nphysiological results. Adaptation effect and conduction velocity of neural\nfibers are considered in the model, however the fibers in each neural unit\nare assumed to have constant conduction velocity and firing threshold.\nModel simulation has been carried out for the single square-wave pulse and\nthe periodic repetitive pulse stimulation applied on peripheral receptors.\nThe activities of the neural cells of periphery and the upper brain are\nrepresented by Wilson- Cowan's nonlinear differential equation, which\nconsiders the ongoing activity of neurons. Pain sensibility is mainly esti-\nmated by the firing activities of the thalamic posterior nuclei group (PO)\nand centromedian parafascicular complex (CM-Pf) cells, while the touch\nsensibility is estimated by the firing activities of thalamic ventral post-\nerolateral nuclei (VPL) cells and the first somatic sensory area (SI) cells in\nthe cerebral cortex. Fast stinging pain and slow burning pain can be\nsimulated quite well, and the modality of the graded touch sensation can\nalso be simulated with this model. The results of the simulation are in good\nagreement with some of the physiological studies notwithstanding the\nsimplified model with some unverified assumptions. It suggests that the\nproposed neural network model would be appropriate and available to\nobtain many different sensory modalities concerned with not only the pain\nbut also the tactile mechanisms.\n\nI. INTRODUCTION\n\nA LL of those who have normal sensibility would often\nmeet with an unpleasant sensory modality, that is\n\npain. For human beings, pain is important information\n\nManuscript received October 14, 1980; revised May 5, 1981.\nH. Minamitani is with the Department of Electrical Engineering, Keio\n\nUniversity, Hiyoshi 3-14-1, Kohoku-ku, Yokohama 223, Japan.\nN. Hagita is with the Musashino Electronic Communication Labora-\n\ntory, Nippon Telegraph and Telephone Public Corporation, Musashino,\nTokyo.\n\nwhich induces imperative protective reflex and rapid reflex\nwithdrawal movements. The lack of pain sensibility may\nexpose them to dangerous events.\nUp to now, a large number of physiological and patho-\n\nlogical studies on pain mechanisms have been attempted,\nand electrocutaneous stimulation has been recently devel-\noped for the release of chronic and acute pain of cancer\ndisease [1]-[7]. Physiologically, pain is classified into three\ntypes: 1) first pain, or fast pain, is a sharp stinging pain\nmediated by small myelinated As fibers, 2) second pain, or\nslow pain, is a durable burning pain mediated by un-\nmyelinated C fibers, and 3) aching pain is continuous dull\npain induced from the viscera and somatic deep tissues.\nConcerning the pain mechanisms, there are two opposing\ntheories: 1) specificity theory proposed by von Frey [8],\nwhich implies the existence of receptors which respond\nonly to noxious stimulation and projects to its own pain\ncenter in the brain, and 2) pattern theory proposed by\nSinclair and Weddell [9], [10], which holds the spatio-\ntemporal nerve impulse pattern for pain produced by in-\ntense stimulation of nonspecific receptors. This means there\nare no specific fibers and no specific endings for pain\nsensation. Both theories, however, do not sufficiently agree\nwith the physiological aspects on pain modality. In 1965 an\nattempt to harmonize these theories was made by Melzack\nand Wall [11]. A new theory proposed by them, the gate\ncontrol theory, suggests that spatio-temporal impulse pat-\nterns transmitted from large and small peripheral afferent\nfibers are modulated in the spinal cord system, and the\nmodulated afferent patterns determine pain modality in\nthe transmission cells in the dorsal horn, from which the\npain sensation is projected towards the brain.\n\nFurther observations have been made concerning the\nphysiology of pain; however, the pain mechanisms have\nnot yet been elucidated, and the quantitative analysis of\npain conduction has never been done. In the present study,\nwe propose a neural network model of pain mechanisms\nand try to obtain the numerical description of pain modal-\nity including the touch sensation by the computer simula-\ntion. The model is designed mainly for the ascending\npathways facilitated by the cutaneous stimulation. Visceral\nand deep somatic pain-conducting pathways are consid-\n\n0018-9472/81/0700-0481$00.75 ( 1981 IEEE\n\n481\n\nAuthorized licensed use limited to: California Polytechnic State University San Luis Obispo. Downloaded on July 12,2022 at 17:27:38 UTC from IEEE Xplore.  Restrictions apply. \n\n\n\nIEEE TRANSACTIONS ON SYSTEMS, MAN, AND CYBERNETICS, VOL. SMC- II, NO. 7, JULY 1981\n\nered to be identical with those of cutaneous somatic affer-\nent system.\n\nII. MODEL\n\nINPUT A n(x,t)\nIn\n\nA. Model of Peripheral Nerves\n\nPain receptors are free nerve endings which generate the\ndischarges associated with pain sensation. They are\nconducted by myelinated As and unmyelinated C fibers in\nthe peripheral afferent nerve systems and are transmitted\non the lateral spinothalamic tract of spinal cord and\nthalamus. According to the gate control theory [ 1], it\ncould be assumed that AP fibers, which respond to touch,\npressure, or tension, also participate in the pain mecha-\nnisms. In fact pain sensation can be reduced by applying\nlight pressure or vibration. The receptors for such sensation\nare Pacini's corpuscles, Merkel's corpuscles, or Meissner's\ncorpuscles. Excessive input of such mechanical or thermal\nstimuli, or so-called nociceptive stimuli, induces the firing\nof pain receptors. In cases where the electrical stimulus is\napplied, almost all receptors are excited. Hillman and Wall\nsuggested that some of Rexed's lamina V spinal cord cells\nin dorsal horn responded to mechanical and electrical\nstimulations [12]. In addition, electrical stimulation on the\nafferent pathways results indicated that lamina V cells\nmight be fired polysynaptically by large myelinated fibers\n(A.) and monosynaptically by small myelinated fibers\n(As ).\n\nReceptor population, which innervates only one neural\nfiber, is called the receptive field. On the contrary, stimula-\ntion on a receptive field does not always activate a single\nspecified fiber. It means that the superposition of neu-\nrarchy exists in the peripheral tissue. Since it could be\npostulated that the peripheral nerves would homoge-\nneously distribute in the specified cutaneous tissues, they\nmight be represented as a \"neural unit\" which activates\nwith the large-scale activity suggested by Wilson and Cowan\n[13]. According to Johnson [14], the effective stimulus\nintensity I(r) on quickly adapting afferent fibers is esti-\nmated by the relationship,\n\n1(r) {(2/r)l9.I,\n\nr . 2 mm\nr > 2 mm\n\nwhere I is the vibratory amplitude at the center of tactile\nstimulation probe with a 2-mm diameter tip, and r is a\ndistance from the center of probe. His estimation suggests\nthat the peripheral receptors might be spatially distributed\nin the tissue from the corresponding single neural fiber,\nand the input stimulus would be spatially dispersed in the\ntissue. However, the effective stimulus intensity involved\nthe totally integrated skin mechanisms which were depen-\ndent on the distribution of receptor population, stimulus\nattenuation, stress distribution in the skin as well as the\nsuccessive recruitment of fibers. As he mentioned, direct\nobservations on neural populations are rarely possible, and\nthe lack of an effective description of skin mechanics\nprevents predicting the basic relationships determining the\n\nPERIPHERAL RECEPTORS\n\nt(x)\nFig. 1. Model of peripheral receptive field: One dimensional spatial\n\nGaussian distributions of peripheral receptors and stimulus input.\n\nafferent response to the more complex tactile stimulation.\nThe problem of reconstructing the activity in a population\nof neural elements from the characteristics of individual\nelements is not unlike the problem of reconstructing the\nbehavior of a gas from the laws governing the behavior of\nindividual molecules that is the original problem of statisti-\ncal mechanics. It is a very common case to postulate a\nGaussian distribution for the neural population as pro-\nposed on the visual receptor distribution [15]. Williams also\nmentioned that Gaussian distributions are common in biol-\nogy and several continuous distributions can be fitted by\nGaussian functions [16]. Regarding the Johnson's distribu-\ntion, the response characteristic beneath the probe showed\ninconstant and not so definite as represented by the above\nequation. Distribution profile of the neural response versus\ndistance from the center probe showed a great variability\nand it could be also represented by the Gaussian distribu-\ntion. On the other hand, stress distribution in the cuta-\nneous tissue varies with the degree of mechanical deforma-\ntion and it resembles a Gaussian distribution when an\nintensive force is applied [17]. Noncontact stimulation such\nas thermal radiation or contact electrical stimulation de-\nlivers different characteristics of the stimulus intensity from\nthose of Johnson's distribution into the cutaneous pain\nreceptors and the effective stimulus intensity will be more\nwidely spread. Brennen reported that an approximately\nexponential current-distance relationship was assumed for\nthe transcutaneous stimulating strip electrode but that the\ndependence of skin-electrode impedance on current density\ndistorts the exponential characteristic [18].\n\nIn our model, therefore, we postulate the distribution of\nperipheral receptors as the following Gaussian distribution\n(Fig. 1) though it is not certainly substantiated:\n\n(1)\n\nInput stimulus intensity is also assumed by the following\nequation:\n\nAin(X, t) f(t) exp -\nl2W (in\n\nx- x 0d\n2in /J\n\n(2)\n\n482\n\nI x\nOX) exp.2 7TU F2a\n\nAuthorized licensed use limited to: California Polytechnic State University San Luis Obispo. Downloaded on July 12,2022 at 17:27:38 UTC from IEEE Xplore.  Restrictions apply. \n\n\n\nMINAMITANI AND HAGITA: COMPUTER SIMULATION OF CENTRAL NEURAL ACTIVITIES\n\nQI~~~~~~~~~~~~~~~~~~~~~~~~~~~~ Lt\n\nFig 2 Sinothlaicandcotialneualnewor mde, nvovig erphealaferNt1 neresSeV etfoPeiitoso\nabbrviatons\n\nHence, the effective spatio-temporal stimulus intensity into\nthe neural fibers at any given point xm will be provided by\nthe convolution integral of the receptor distribution and\ninput intensity\n\nS(Xm, t) =j AJX(x, t)-(xm -X) dX. (3)\n00\n\nAfter receiving the stimulus intensity S(xm, t), each pe-\nripheral neural unit corresponding to A, A,,, or C afferent\nactivates itself. In this study, the Wilson-Cowan's neural\nequation was applied to represent the activities of the\nneural units [13], considering the ongoing activity [12] as\nfollows:\n\ndFi\n)' dt -FJ\n\n+ (1- rJF)\n+ exp{t-v1(S, oi))\n\n(4)\nIn the larger diameter fiber it shows the higher conduction\nvelocity, the lower threshold and the more adaptation.\nWillis et al. observed that the low threshold spinothalamic\ntract neuron adapted to the mechanical stimuli [19]. It\ncould be inferred from the physiological aspect [20] that\nthe adaptation would have occurred through the accumu-\nlation of sodium ions (Na+) inside the nerve cells and in\nconsequence by the elevation of firing threshold of them.\nHence the adaptation phenomenon of neural unit could be\nrepresented by the following equation, modified from the\nStein's equation [21],\n\nOji = Oi +ki(xil -Xi2)\ndxi - F\ndt\n\ndxi2 = Fi - iXi2' (5)\ndt\n\nIn (4) and (5), i = 1, 2, and 3 which correspond to AP, A6,\nand C fibers.\n\nIn the model, conduction velocity of each fiber is also\nconsidered only within the peripheral afferents towards the\nspinal cord area. According to Georgopoulos [22], conduc-\ntion velocities of afferent A3, A , , and C fibers were mea-\nsured as v = 25 - 80 m/s, v, = 3 - 40 m/s, and v, =\n0.08 - 1 m/s, respectively. Pomeranz et al. also observed\nthat v = 50 - 77 m/s, v, = 8.5 - 12 m/s, and v, = 1.1\n- 1.4 m/s [23]. Ganong represented in his publication that\nv=30-70 m/s, v, =12-30 m/s, and v=0.5 -2\nm/s [24]. Although the conduction velocities of peripheral\nafferent fibers are widely distributed, we assume the veloci-\nties to be constant as v, = 70 m/s, v, = 7 in/s and\nVC = 1.4 m/s for the simplification of the model and that\nthe distance between the periphery and spinal cord cells is\n0.35 m.\n\nB. Model of Spinal Cord Cells and the Upper Brain\n\nModel construction of the central neural system of pain\nconduction is based on the physiological investigations\nmentioned below, involving some assumptions. Central\nneural units associated with pain sensation are classified\ninto four major segments; spinal cord, brain stem, thala-\nmus, and cerebral cortex. We simplify the description of\nthe neural pathways from peripheral receptive fields to-\nwards the upper brain, as shown in Fig. 2, that may be\nappropriate and useful for the analysis of pain mecha-\nnisms. In the figure, symbol =- represents the excitatory\ninteraction and -' the inhibitory interaction as well.\n\nSpinal Cord Cells: Melzack and Wall suggested that\nstimulation of peripheral tissues evoked nerve impulses\nwhich were transmitted to three spinal cord systems; (1)\ncells of substantia gelatinosa (SG) in the dorsal horn, (2)\ndorsal column fibers that projected towards the brain, and\n(3) first transmission cells in the dorsal horn [11]. Accord-\ning to Hillman et al. [12], low threshold afferent A. fibers\nmay end first on Rexed's lamina IV cells in dorsal horn\n\n483\n\nAuthorized licensed use limited to: California Polytechnic State University San Luis Obispo. Downloaded on July 12,2022 at 17:27:38 UTC from IEEE Xplore.  Restrictions apply. \n\n\n\nIEEE TRANSACTIONS ON SYSTEMS, MAN, AND CYBERNETICS, VOL. SMC-I 1, NO. 7, JULY 1981\n\nwhich in turn excite lamina V cells, and there are some\ninterneurons in lamina II and III cells which postsynapti-\ncally and in part presynaptically inhibit lamina V cells.\nSubstantia gelatinosa and transmission (T) cells may be\nequivalent to lamina II/III and V cells respectively so that\nT and IV cells are presumably inhibited by SG cells. It was\nanatomically observed that there were axo-dendritic syn-\napses between SG cells and IV cells [25], and it was\nphysiologically observed that inhibitory postsynaptic\npotential evoked in lamina IV and V cells [26], [27]. In\naddition, the existence of other inhibitory interneurons was\nobserved in the dorsal horn, which gave rise to the inhibi-\ntion effect on IV and V cells, in which inhibitory postsyn-\naptic potentials were evoked by the electrical stimulation of\nlow threshold afferent myelinated fibers [1], [26]. It sug-\ngests that the inhibitory interneurons (15) bring the double\npostsynaptic inhibition on T cells. Hence\n\nA# IV= T,A= SG -* IV, SG -T,\nA#=:> I5-* IV, andIs5- T.\n\nOn the other hand the windup phenomenon which is\nrepresented by Price et al. [1], occurred through the C\nfibers' stimulation may be due to the postsynaptic facilita-\ntion of lamina V cells. It means that there are some\nexcitatory interneurons in dorsal horn (E) which bring the\nprogressive increase in number and frequency of spikes of\nthe lamina V transmission (T) cells evoked by the stimula-\ntion of high threshold fibers. There also exists a large\nnumber of lamina V cells which directly respond to the\nstimulation of both myelinated and unmyelinated nocicep-\ntive afferent fibers [12], [23]. In contrast, the activities of\nthe SG cells are inhibited by the stimulation of small\ndiameter fibers, however it is not clear whether the inhibi-\ntion is caused by the inhibitory postsynaptic interneurons\n(14) or by the inhibitory presynaptic interactions of the\nafferent fibers [28], [29]. In our model, we assume that A8\nand C fibers terminate to SG cells via the postsynaptic 14\ninterneurons as suggested by Yokota [30]. Hence,\n\nA8=E,C=*E= T,A86 =T,\nCo T,A8==I4,and C=I4-* SG.\n\nAscending Pathway of the Central Neural System above\nSpinal Cord: Based on the detailed consideration of various\nphysiological references, we conclude and assume that the\nreceptive neural cells may be dorsal column nuclei (DCN),\nmesencephalic reticular formation (MRF) and bulbar retic-\nular gigantocellular nucleus (BRF-GC) in the brain stem,\nventral posterolateral nuclei (VPL), posterior nuclei (PO),\nand centromedian parafascicular complex (CM-Pf) in the\nthalamus, and SI, second somatic sensory area (SII) and\nthe cortical associated area with SI and SII in the cerebral\ncortex (H).\nThe lemniscal system responds to mechanical stimuli\n\nsuch as touch, pressure, and vibration, which is rapidly\ntransmitted by large myelinated fibers. DCN in this path-\nway receives the peripheral large afferent (A.) fibers and\nproject on the centrolateral ventrobasal nuclear complex\n\n(VB) of the thalamus. The axons of VPL of VB terminate\nin the somatic sensory area SI and SII of the cerebral\ncortex. VPL responds to the cutaneous mechanical stimuli\nand kinetic stress in deep tissues but not to pain or noxious\nstimuli [31], [32]. Thus,\n\nA# DCN =X VPL * SI, VPL SII.\nBRF-GC receive the synaptic connection from lamina V\n\n(T) cells and they are regarded as a kind of translator\ntowards the centromedian cells (CM) in the thalamus.\nSpinothalamic afferents from the spinal cord region reach\nthe MRF through the adjacent fields of bulbar reticular\nformation and transmit the afferent information towards\nthe thalamus. The spinothalamic pathway may terminate\non PO through MRF and projects on the cortical area,\nprobably on SII and partly on SI. PO cells located in the\nhind region of VB are activated by mechanical and noxious\nstimuli. Scientists researching the physiological and\nanatomical aspects mentioned [32]-[36] hold that PO cells\nserve for the conduction and perception of pain and partly\nfor tactile mechanisms. Poggio and Mountcastle especially\nhave stated; \".. whereas the cells of VB are responsive to\nhighly specific mechanical stimuli delivered to the skin,\nthose of PO are in the majority sensitive to noxious stimuli.\nWhile VB neurons are modality specific, those of PO may\nbe responsive to very diverse types of stimuli, and fre-\nquently the same cell may respond to light mechanical\nstimulation of one part of its respective field, to noxious\nstimulation of another part of the field.\" [36]. Hence, we\nassume in our model\n\nT => BRF-GC, T==> MRF == PO => SII and PO SI.\nOn the other hand, afferent input from BRF-GC pro-\n\njects on the thalamic intralaminar nuclei including CM-Pf\nwhich then evokes pain sensation [32], [33]. It may be\nconsidered that the burning pain (slow pain) is served by\nthis pathway. Facilitation of CM-Pf may be brought about\ndirectly and indirectly through projection on the associated\narea with SI and SII in the H. Stimulation of the thalamic\nintralaminar nuclei CM-Pf facilitates VPL and SI. Recipro-\ncally stimulation of VPL and SI results in the inhibition of\nthe thalamic intralaminar nuclei [35], [37]. Thus it may be\npostulated that VPL intervenes between CM-Pf and H as\nwell as SI as follows,\n\nBRF-GC = CM-Pf = H, CM-Pf =: VPL =* H,\n\nand VPL = SI -* CM-Pf.\nDescending Pathway: Descending systems also par-\n\nticipate in the control of pain conduction. Pain sensation\ndepends not only on the ascending inputs but also on the\nfeedback information from the upper brain towards the\ndorsal horn. Electrical stimulation on MRF induces inhibi-\ntion of the activity of lamina V cells that results in a\npowerful analgesia [38]. Similarly the presence of tonic or\nevoked inhibitory effects on dorsal horn interneurons has\nbeen reported to derive from the somatosensory and orbital\ncortex [39], [40], the pyramidal tract [41], and the brain\nstem [42]-[44]. In higher mammals many cells of the\n\n484\n\nAuthorized licensed use limited to: California Polytechnic State University San Luis Obispo. Downloaded on July 12,2022 at 17:27:38 UTC from IEEE Xplore.  Restrictions apply. \n\n\n\nMINAMITANI AND HAGITA: COMPUTER SIMULATION OF CENTRAL NEURAL ACTIVITIES\n\ncerebral cortex can directly influence spinal cord cells via\nthe pyramidal tract [38] the origin of which exists in the\nsomatosensory cortex SI, SII, and the motor cortex [45]. In\nthe cat spinal cord, the pyramidal tract (PT) terminates\npredominantly in the dorsal horn and most of the PT fibers\nterminate in laminae IV and VI. PT stimulation was found\nto inhibit most of the lamina IV cells and to excite most of\nthe lamina VI cells; it exerted more evenly mixed effects in\nlamina V [41], [43]. Cortical stimulation was also shown to\nevoke a depolarization in certain afferent fibers and thereby\nto inhibit sensory input presynaptically [39], [46]. This\ndepolarization was measured as a negative dorsal root\npotential, however intracellular recording was clearly nec-\nessary to test for postsynaptic inhibition in these cells.\nLundberg has stated \".. it is possible that the proportion\nof interneurons in the spinal cord that receive IPSP's from\nthe sensorimotor cortex is larger than found in our first\ninvestigation [47].\" Further search for inhibitory postsyn-\naptic effects evoked by pyramidal tract stimulation in\nlamina IV cells seems desirable before the relative impor-\ntance of pre- and postsynaptic inhibition can be assessed.\nKusama et al. anatomically investigated the projections of\ncerebral cortices and reported that the first motor (MI) and\nSI and SII projected markedly to the central part of the\nposterior horn in the lower spinal cord which was the area\nbetween the substantia gelatinosa and the lamina IV [45].\nRethelyi and Szentagothai also found anatomically the\nsynaptic complexes of the dorsal horn cells with the pyra-\nmidal tract fibers. They reported that descending spinal\npathways would have excellent opportunity to get into\nsynaptic contact with the dendritic branches of the pyra-\nmidal cells and with the substantia gelatinosa. Their\nanatomical diagram also showed that forward conduction\nfrom the SG was secured by large neurons of lamina IV the\ndendrites of which were embedded into the neuropil of the\nSG [48].\nAs mentioned above, lamina IV and V cells are inhibited\n\nby the pyramidal tract feedback loop, thus we assume a\ndescending system connected between the associated area\nof SI and SII (H) and T cells through the interneurons SG\nand inhibitory interneurons in the dorsal horn (15) as in\nthe following,\n\nMRF= I5- T,H=SG-* T, andH=I5- T.\n\nOn the other hand, conditional stimulation of SII evokes\nthe facilitation of MRF, and the electrical repetitive stimu-\nlation of the motor cortex which is projected from the\nsomatic sensory area results in the excitation of the bulbar\nreticular formation [49], [50]. In contrast, dissection of SI\nresults in the prolongation of discharges of VPL for the\nperipheral gentle mechanical stimuli. In the lemniscal sys-\ntem, DCN is also indirectly projected back from the somatic\nsensory area SI [32]. Kusama et al. studied, using the\nNauta-Gyrax or its modified method, on the projections of\nthe somatosensory areas in the lateral surfaces of the cortex\nof a cat: medial and lateral parts of cronal gyri (SI) project\nmostly to the VPL cells and the posterior part of the SI\nalso projects fibers to the cuneate nucleus of DCN [45].\n\nAndersen et al. recorded extracellularly the spike responses\nof cuneate neurons in DCN of the anesthetized cats to the\nelectrical stimulation of a sensorimotor cortex. They ob-\nserved that the responses evoked in the cuneate neurons of\nDCN were depressed by descending volleys from the\nsensorimotor cortex [39]. Jones and Powell showed\nanatomically, using the Nauta technique that corticotha-\nlamic fibers returning from SI and SII are distributed in an\norganized manner to the VB cells of a cat. Heavy terminal\ndegeneration fills both the lateral VPL and the medial\nnucleus ventralis posteromedialis (VPM) subdivisions of\nthe nucleus ventralis posterior [51]. Iwama and Yamamoto\nphysiologically studied the evoked responses of the thalamic\nsomatosensory relay nucleus in VB, which corresponded to\nthe cells in VPL and VPM, to electrical stimulation applied\nto the somatosensory cortex. They observed that the corti-\ncally induced action was inhibitory upon the thalamic-\nevoked potentials [52]. These anatomical and physiological\nfindings suggest that the lemniscal negative feedbacks from\nSI serve the regulation of spike discharges in DCN and\nVPL cells as in the following,\nSII ==* MRF, SII =* BRF-GC, SI -- DCN, and SI -* VPL.\nPain and touch sensations are served by these neural\n\ncells, each of which may participate as a \"neural unit\" with\nthe large scale activity in the sensation. In our model\nanalysis large-scale activities of the neural units are repre-\nsented by the Wilson-Cowan's differential equation, in-\nvolving the ongoing activity of neurons as follows,\n\ndFi _ __+ (I -rF)1 e {i\ndt - J±(1- IJ~ + exp {-vPj(C1® rj; - o1)}\n\n(6)\n\nwhere i = j = 1 - 18, which correspond to Al, A,, and C\nfibers, SG, 14, 15, IV, T, E, BRF-GC, MRF, CM-Pf, DCN,\nP0, H, VPL, SI and SII cells, respectively. By defining\n(1)- (6) now, our neural network model is completely\nspecified.\n\nIII. METHOD OF COMPUTER SIMULATION AND\nPARAMETER DETERMINATION\n\nComputer simulation of the overall model for pain and\ntactile mechanisms has been made on a HITAC 8800/8700\ndigital computer (Hitachi Manufacturing Company), using\nthe fourth-order Runge-Kutta method to solve the nonlin-\near differential neural equations. The simulation program\nwas written in Fortran.\n\nParameter determination has been carried out on a trial\nand error basis by using the iterative method of model\nsimulation. The values of various parameters except the\nconduction velocity, refractory period, and membrane time\nconstant are not based on the counterpart physiological\ndata. They are merely substituted to produce an optimal\nfitting of the empirical data to the model behavior. The\ncoupling coefficients iCj especially, have been roughly de-\ntermined to represent the degree of inhibition and excita-\n\n485\n\nCI O Fj = 2,CJ-Fj\n\nAuthorized licensed use limited to: California Polytechnic State University San Luis Obispo. Downloaded on July 12,2022 at 17:27:38 UTC from IEEE Xplore.  Restrictions apply. \n\n\n\nIEEE TRANSACTIONS ON SYSTEMS, MAN, AND CYBERNETICS, VOL. SMC-I 1, NO. 7, JULY 1981\n\ntion since they have not been experimentally verified in\ncurrent physiological and anatomical investigations.\nThe precise procedure of parameter determination is as\n\nfollows. 1) The firing threshold (0i) and the coupling\ncoefficient (jCj) are important parameters to dominate the\nfiring modalities of the whole neural units. Since the other\nparameters exert less influence on model behavior, the\nvalues of a, ain,I1, vi have been arbitrarily determined.\nInput stimulus intensity and stimulus frequency have been\nchosen at Ao = 30 - 200 and f(t) = 10 - 500 pps for the\niterative examination of model parameters. Refractory\nperiod ri and membrane time constant yi are about 1 ms\nand 5 ms, respectively, which are physiologically substanti-\nated [13], [24].\n\n2) Adaptation phenomenon of peripheral afferent fibers\ncan be simulated by applying the set of first-order differen-\ntial equations (4) and (5) in which the stability of the\nsteady-state solution depends on the values of ai, /Pi, ij,\nand ki. According to the Routh-Hurwitz criterion the\nstable solution is given under the following condition for\nki > 0 [21],\n\nk((ai + Pi ) [aipi + (aXi + Pi + l/HIil=iK_ 7)\nki ((Xi- Pi)Fi*(l -Fi*)IAi =K\n\nwhere ai < fPi and Fj* = firing rates at the steady state.\nIf ki< Ki, overdamped decreases and damped oscilla-\n\ntory changes in firing rate are observed to step changes in\nthe input. Adaptation of firing activity regarded as the\noverdamped increase of firing threshold and decrease of\nfiring rates can be simulated fitfully when this condition\nand the following empirically derived relationships [53] are\nfulfilled: 1) Ki > ki, 2) ai, Pi « ki, 3) the differences be-\ntween fPi and ai, (Pif- ai) should be a few, and 4) the\nproduct of a, and /3i, (ai. fi) should be fairly large.\n\n3) Determination of the firing thresholds 0i is based on\nthe following criteria. a) Firing thresholds of the neural\nunits representing the peripheral afferent A., A., and C\nfibers conform to the physiological relation that the larger\ndiameter fiber shows the lower threshold, thus 0, < 02 < 03.\nb) Neural units concerning the tactile mechanism should\nhave lower thresholds than those for pain sensation since\nthey respond to low stimulus intensity. c) Firing thresholds\nof the neural units constituting the excitatory interaction\nshould rather be lower than those for inhibition because no\nresponse to an unexpected dangerous input would be\ntransmitted to the central nervous system if inhibition\nexceeds in the excitation.\n\n4) After the parameter determination mentioned above\nthe coupling coefficents iCj have been decided in conform-\nity with the following criteria and procedures. a) Neural\nunits on the lemniscal system respond to nonnoxious low\nstimuli and transmit the tactile information to cortical\ncells. The coupling coefficients on this pathway 13CI, 13CI7,\n15CI6, 16CI3, 16CI7, 17CI6, 18C16, have been determined so as\nto simulate that the firing modalities of DCN, VPL, and SI\n\nrates of these units should gradually increase with the\ngraded elevation of low input intensity. On the determina-\ntion of these coefficients the others must be all zero in\norder to investigate only the conduction of tactile informa-\ntion. b) Some dominant factors producing analgesia have\nbeen known [54]. The most simple case is caused by the\ndeficiency or injury of small nociceptive, primary afferent\nfibers, which can be simulated by setting the coupling\ncoefficients 5C2, 5C3, 8C2, 8C3, 9C2, and 9C3 as zero. Under\nthis condition the other coupling coefficients 4C, 6C1, 7C1,\n7C4, 7C6, 8C4, 8C6 and 8C7 representing the degree of\nexcitatory and inhibitory connections between A#, SG, IV,\nI5 and T cells are determined so as to simulate analgesia.\nThat is, the firing rates of T cells must be very few or\nhardly occurred even if continuous high stimuli supramax-\nimal for C fibers are applied. c) In contrast, the deficiency\nor damage of large nonnociceptive primary afferent fibers\nwould be one of the cause-producing hyperalgesia which\ncan be simulated by setting the coupling coefficients 4C,,\n6CI, and 7C, as zero. It results in no transmission of the\ninput on A. fibers and no inhibition from SG and I5 on T\ncells. In consequense, firing rates of T cells are extremely\nincreased by As and C fibers' facilitation even if low\nintensity input supraliminal for A. fibers is applied. Under\nthis condition the coupling coefficients between small\nprimary afferent A., C fibers, and spinal cord cells, 8C2,\n8C3, 8C9, 9C2, and 9C3 are determined so as to simulate\nhyperalgesia. d) By using the coefficients given above,\nanother group of coupling coefficients 4C5,5 C2, and 5C3\nwhich represent the inhibitory connections between periph-\neral nociceptive afferents and SG cells, are determined.\nMeanwhile the firing activity of T cells is iteratively checked\nwhether it shows the desirable response modality regarding\ntouch and pain sensation for the graded increasement of\nstimulus intensity. e) The coupling coefficients on the\nspinothalamic and cortical pathway I C8, l C18, 14C11, 17CI4,\nand 18C,4 are determined so as to simulate the first pain\nmodality in MRF, PO, and SII cells which should show\nhigh firing rates when high stimulus intensity supraliminal\nfor A. fibers but subliminal for C fibers is applied. Simi-\nlarly the coupling coefficients I0C85 ,0C185 12C105 12C179\n15C12, and 16C12 interacted between BRF-GC, CM-Pf, and\ncortical cells are also determined in order that these cells\nmay show the firing modality of second pain when very\nhigh stimulus intensity supramaximal for C fibers is ap-\nplied. f) The coupling coefficients of the feedback system\nfrom the upper brain to the spinal cord cells 4C15, 6C11,\nand 6C15 are determined by changing the values of these\ncoefficients and 7CI so as to simulate that the excitatory\nand inhibitory inputs to IV cells should optimally facilitate\nT cells for the low stimulus intensity. g) After the initial set\nup of all coupling coefficients, the response characteristics\nof each neural unit are examined by applying various pulse\nstimulation. Furthermore, the coupling coefficients are ad-\njusted to produce an optimal fitting of the empirical data\nto the model behavior regarding tactile and pain sensation\n\nunits show the tactile modalities. It means that the firing\n\n486\n\non a trial and error basis.\n\nAuthorized licensed use limited to: California Polytechnic State University San Luis Obispo. Downloaded on July 12,2022 at 17:27:38 UTC from IEEE Xplore.  Restrictions apply. \n\n\n\nMINAMITANI AND HAGITA: COMPUTER SIMULATION OF CENTRAL NEURAL ACTIVITIES\n\nFrom the results of preliminary iterative examination,\nparameters of the model have been decided as\n\na = ain=4,7 = 1,Xo=Xm= 5,\n\nal= 40,131= 60,k= 3000, a2= 20,132= 25, k2= 500,\nri = Ims, ij = 5 ms, vi = I (i = 1 - 18),\n01 = 07 08 = 09= 6 11 = 014= 4, 02= 7, 03\n= 12,04 = 05=\n\n06 =10 = 5, 012 = 6, 013 015 = 016 = 017 = 018 =3,\n4CI= 5,4C5= -30,4CI = 5,5C2= 30,5C3\n\n= 80, 6CI = 10,\n6CII =5, 6CI5 = 9, 7CI = 40, 7C4 =-19 7C6\n\n--2,8C2= 10,\n8C3 =60, 8C4 =-10, 8C6 =-5, 8C7=10, 8C9\n\n- 10, 9C2= 10,\n\n9C3= 80, 10C8= 5, I0C18= 2, 1C8= 8, lIC18\n2, 12CIO= 17,\n\n12C17 =-5, 13CI = 30, 13C17 = -5, 14CI = 6, 15CI2= 4,\n= 2, 16CI2 = 5, 16C13 = 8, 16CI7 - -5, 17CI4 = 2,\n\n17CI6 = 4, 18CI4 = 3, and 18CI6 = 3.\nFor simplifying the model we postulate that the same\n\nspatial variance a is applied for each of A., A,, and C\nfibers. The temporal mode of input stimulus is given by\n\noQ2\n\n0H\n\n0.4\n\n0.2\n\n_/ .'--.\n(b)\n\n(c)\n\n- T cells\n-- VPLcells\n- POcells\n\n- CM-Pf cells\n\nI.I\n\n100 200 300\nTime (msec)\n\n(d)\n\nFig. 3. Temporal pattern of firing activities of T, VPL, PO, and CM-Pf\ncells responding to single square-wave pulse stimulus of I ms pulse-\nwidth. Stimulus is applied at t = 0. (a) Ao = 60. (b) Ao = 100. (c)\nAo = 140. (d) Ao = 180.\n\n(8)\n\nwhere tp is stimulus pulse width and T is stimulus pulse\nfrequency.\n\nIV. RESULTS OF THE MODEL SIMULATION OF PAIN\nMECHANISMS\n\nIn the model we regard the excessive increasement of\nneural activities (firing rates) of T, PO, and CM-Pf cells as\nthe occurrence of the pain sensation in these cells. PO cells\nrespond to not only the pain but also the mechanical\nstimulation. However it may be postulated that the so-called\nfast stinging pain is perceived in the PO cells and projected\nto the somatic sensory area of the cerebral cortex SII. The\nsubsequent slow burning pain is mainly perceived in the\nCM-Pf cells and projected to the cortical associated area H\nwhen high stimulus intensity is applied. On the other hand,\nsensations such as touch, tension, or vibration are evoked\nin VPL cells and projected to the somatic sensory area SI.\nThe results of model simulation have been obtained for\n\nthe single square-wave pulse and the periodic pulse se-\nquence stimulations applied on peripheral tissues. Single\npulse stimulation used to be carried out for the physiologi-\n\ncal investigations of neural activities participating in the\nsensory mechanisms.\n\nA. Response of Neural Units to Single Pulse Stimulation\n\nFig. 3(a)-(d) show the temporal patterns of the firing\nrate of the neural units when the peripheral tissues are\nstimulated with a single square-wave pulse of 1 ms width at\nt = 0. Amplitudes of the stimulation are Ao = 60, 100,\n140, and 180, respectively. Maximum firing rate of each\nneural unit given by (4) and (6) becomes 1.0. In each figure\nit can be seen that there is an absence of firing activity of T\ncells just after the stimulation. The brief latency period to\nthe initial burst is about 5 ms which is equivalent to the A\nfibers' conduction time from periphery to the spinal cord T\ncells. The duration and the amount of firing rate of the\ninitial burst of T cells are increasing with the elevation of\nstimulus intensity and this approaches the maximum when\nhigh intensity is applied. Maximum duration time of the\ninitial burst is about 27 ms as shown in Fig. 4. For the low\nstimulus intensity, firing activity of the thalamic PO cells\ndoes not appear so much, and particularly the activity of\nCM-Pf cells hardly occurs because of no facilitation of C\n\nf(t) =\n\nand\n\n0 < t . tp\ntp< t < T\n\n487\n\nf(t) =f(t + T)\n\nAuthorized licensed use limited to: California Polytechnic State University San Luis Obispo. Downloaded on July 12,2022 at 17:27:38 UTC from IEEE Xplore.  Restrictions apply. \n\n\n\nIEEE TRANSACTIONS ON SYSTEMS, MAN, AND CYBERNETICS, VOL. SMC-lI, NO. 7, JULY 1981\n\n- 31\nv)\nE\n\n2\n\n:3\nD 11\n\nVI\nU1)\n\naU\n\n0\n\nU)\n\nE\nz\n\n100 200\nStimulus intensity Ao\n\n(a)\n\nu\n\nE\nc\n0\n\n0\n\n100 200\nStimulus intensity Ao\n\n(b)\n\nFig. 4. Relationships between stimulus intensity. (a) Maximum firing\nrate. (b) Duration of initial burst of T cells for single pulse stimulation\n(results from model simulation).\n\nfibers and the negative feedback from the upper brain. The\ninhibitory period of about 20-30 ms after the stimulation\nsubsequent to the initial burst is caused by the inhibition\neffects of SG and 15 cells on T cells as well as the\nadaptation ofA fibers.\nIn the case where the stimulus intensity is increased\n\nabove A, threshold, a secondary low burst of T cells\nappears at about 50 ms, which is equivalent to the conduc-\ntion time of A, afferents from the periphery towards the\nspinal cord system. The activity of PO cells slightly in-\ncreases but is not enough for the pain sensation as can be\nseen in Fig. 3(b). The stimulus intensities used for the\nstimulation given in Fig 3(a)-(c) are not sufficiently high\nenough to activate C fibers so that the firing of CM-Pf cells\nhardly occurs. When high stimulus intensity above C fiber-\nthreshold is applied (Fig. 3(d)), large firing activities of T\nand PO cells and slight increasing of the activity of CM-Pf\ncells appear at about 250 ms after the stimulation, of which\nperiod is equivalent to the conduction time of C fibers\nbetween the periphery and the spinal cord cells. In con-\ntrast, the firing of VPL cells appears soon after the stimu-\nlation with the same temporal modality as the initial burst\nof T cells. It may be supposed that the mechano-perception\nhas occurred at the moment of stimulation with a short\nlatency.\nFrom the results mentioned, relationships between the\n\napplied stimulus intensity and the duration as well as the\nmaximum firing rate of the initial burst of T cells are\nshown in Fig. 4 where the duration time corresponds to the\nperiod in which the firing rate of T cells is maintained\nabove 0.04. The lowest peripheral stimulus intensity needed\nfor the firing of 0.04 of T cells is assumed to be about\nAo 30 from Fig. 4(a). The duration and the maximum\n\n3or\n\n20~\n\n1 0~\n\n0-\n\n0- sural nerve\n( *-- plantar nerve\n\nI I L\n\n20 40\nStimulus intensity (xe)\n\n(a)\n\n60\n\n30r\n\n20.\n\n1 ,\n\no[ I\n0\n\n-o---sural nerve\nstimulation\n\n20 40\nStimulus intensity (xe)\n\n(b)\n\n60\n\nFig. 5. Relationships between stimulus intensity. (a) number of firing\nspikes. (b) Duration of initial burst of Rexed's lamina IV-V cells for\nsingle pulse stimulation (modified from the physiological results of\nForeman et al. [36]).\n\nfiring rate of the initial burst increase with the elevation of\nstimulus intensity over the low range of it and approach a\nplateau in the high range of it. Maximum firing rate and\nmaximum duration of the initial burst are 27 ms and 0.41,\nrespectively.\nOn the other hand, Fig. 5 shows the relationships be-\n\ntween the stimulus intensity of a single electrical pulse and\nthe number of firing spikes as well as the duration of the\ninitial burst of spinothalamic tract cells which correspond\nto Rexed's lamina IV-V cells (IV or T cells in our model).\nThe stimulation was applied to the peripheral sural and\nplantar nerves of hindlimb of macca luta. These relation-\nships are inferred from the results reported by Foreman et\nal. [55], which are rewritten for the comparison of those\nwith our model experiment. In the figure, 0 = 1 on the\nhorizontal line represents the nerve threshold which in turn\ncorresponds to the lowest stimulus intensity needed for\nexcitation of those cells. The number of spike discharges\nincreases with the increasing of stimulus intensity and\napproaches a plateau when the strong stimuli over 25 X 0\non sural nerve as well as 10 X 0 on plantar nerve are\napplied. Physiological results concerned with the duration\nof spike discharges have been obtained only for sural nerve\nstimulation. The characteristic is quite similar to the rela-\ntionship shown in Fig. 4(b), that is, the duration of the\ninitial burst increases with the increasing of stimulus inten-\nsity and approaches a plateau (27 ms) when the stimulus\nabove 20 X 0 is applied. Comparison of the physiological\nresults and the data of model simulation represented in\nFigs. 4 and 5 provide a good similarity for the relationships\nbetween stimulus intensity and the firing activity as well as\nthe duration of the initial burst of T cells.\n\n(n)w\n\n488\n\nAuthorized licensed use limited to: California Polytechnic State University San Luis Obispo. Downloaded on July 12,2022 at 17:27:38 UTC from IEEE Xplore.  Restrictions apply. \n\n\n\nMINAMITANI AND HAGITA: COMPUTER SIMULATION OF CENTRAL NEURAL ACTIVITIES\n\nB. Responses of Neural Units to Periodic Repetitive Pulse\nStimulation\n\nAs shown in Fig. 3, a sudden application of noxious\nstimuli to the peripheral tissues will result in the occurrence\nof a sharp and fast stinging pain (first pain) followed by a\nsecond burning pain of about few hundred milliseconds\nlater. First pain has epicritic characteristics in that it is\nbrief and it may be mainly affected by the fast conducting\nlarge fibers, A. fibers. On the other hand, second pain is\ncharacterized as protopathic sensibility in that it is diffuse\nor poorly localized and often long lasting with longer\nlatency. Second pain may be related to the impulses travel-\ning in C fibers. Such modality becomes still more remark-\nable when the repetitive pulse stimulation is carried out.\n\nFig. 6 shows the typical firing patterns of neural cells\nwith respect to pain sensation, which is obtained on condi-\ntion that stimulus intensity Ao = 120, stimulus frequency\nf = 300 pps, and the pulsewidth is 1 ms. It can be seen that\nfast elevation of the initial firing bursts of T, VPL, and PO\ncells occurs soon after the beginning of stimulation. The\ninitial firing of each cell is caused by the transmitted\nimpulses of A,B fibers, of which modality represents that the\nmechanical perception such as touch or vibration may be\ninduced in the cells and projected to the upper brain.\nParticularly, a very high rate of firing of VPL cells associ-\nated with touch sensation can be observed at the initial\nphase of the temporal pattern. A high rate of the initial\nfiring bursts of T and VPL cells, however, drastically\ndecreases because of the adaptation of A. fibers, inhibition\nfrom the adjacent cells, and the negative feedback from the\nupper brain. At about 50 ms after the stimulation, the\nactivities of T and PO cells are again increased by the\nconduction of A. fibers' excitation. In particular, the firing\nrate of PO cells comes up to a peak at 120 ms. It suggests\nthat fast pain may be evoked in PO cells and projected on\nthe cerebral cortex. After a while or 250 ms later from the\nbeginning of stimulation, these cells are facilitated by the\nconduction of C fibers-excitation. It must be noticed here\nthat CM-Pf cells are abruptly activated though they have\nnot provoked so high a rate of firings till then. At this time\nsensation of slow burning pain appears in CM-Pf cells as\nwell as in PO cells and is projected mainly on H and SII\ncells.\nAs mentioned, the SI in the cerebral cortex receives the\n\nprojection from VPL and PO cells and perceives mainly the\ninformation of mechanical stimuli and partially that of\nsharp stinging pain. This aspect can be seen in the initial\nphase of Fig. 6(b) between 10 and 80 ms. On the other\nhand SIT receives the projection from PO cells more strongly\nthan from the others and increases the firing rate after 250\nms in the same manner that the associated area H of the\ncerebral cortex is facilitated by the projection from CM-Pf\ncells. In consequence slow burning pain is certainly per-\nceived on these cortical cells. From the results of Fig. 6, it\nis easily supposed that pain sensation is evoked by apply-\ning a certain grade of stimulus intensity and high frequency.\nIncreasing of stimulus intensity results in the facilitation of\n\n200\nTime (msec)\n\n(a)\n\nTime (msec)\n\n(b)\nFig. 6. Temporal pattern of the firing activities. (a) T, VPL, PO, and\nCM-Pf cells. (b) SI, SII, and H cells responding to the periodic\nrepetitive pulse stimulation. Stimulus intensity Ao = 120, stimulus\nfrequency f = 300 pps and I ms pulsewidth, which is applied at t = 0.\n\nC fibers that leads to the occurrence of secondary burning\npain.\n\nFig. 7(a) and (b) show the temporal patterns of firing\nrates of the neural cells for Ao = 140, f= 200 pps and\npw 1 Ims. Particular points of the characteristics differ\ncompared with the former results in that more elevation of\nfiring rates than those of Fig. 6 can be found in CM-Pf and\nH cells, evoked through the increasing of C fibers' activity\nbecause of the higher input intensity. As fibers are also\nintensely facilitated so that the firing rates of PO and SII\ncells increase between 50 and 80 ms. This suggests that the\nfast stinging pain and the slow burning pain would be\nperceived more intensely in the cerebral cortex. In contrast\nthe initial firing bursts of VPL and SI cells are rather\nreduced at 10 - 20 ms because of the lower frequency\nstimulation in that the firing burst of AA fibers does not so\nmuch accumulate and exerts less affect on VPL cells.\n\nFig. 8 shows the results of model simulation examined\nfor the different stimulus frequencies f = 50 pps and 100\npps as compared with the results of Fig. 7 for f = 200 pps.\nFirst, the interesting firing modality of T cells can be seen\nas follows: the transmission of impulses from A fibers\ndirectly facilitate the lamina IV cells and indirectly facili-\ntate T cells through IV cells. At the same time, SG and 15\ncells inhibit IV and T cells, and in addition, adaptation of\nA. fibers and the indirect negative feedback of the descend-\ning system reduces the activity of T cells. Thus, the firing\nburst of T cells is decreased between 10 and 45 ms as\nshown in the figures. Adaptation effect of A,- fibers can be\nrecognized by observing the firing pattern of VPL cells\n\n489\n\nAuthorized licensed use limited to: California Polytechnic State University San Luis Obispo. Downloaded on July 12,2022 at 17:27:38 UTC from IEEE Xplore.  Restrictions apply. \n\n\n\nIEEE TRANSACTIONS ON SYSTEMS, MAN, AND CYBERNETICS, VOL. SMC-l 1, NO. 7, JULY 1981\n\n1or\n\n.I-\n\nc Q.\nIL\n\n100 200\nTime (msec)\n(a)\n\n300 400\n\nDI6 (a).' 0.6 -a\nVPL T\n\n0.4- fNWW\n\n0.2 --'\n---PO /______ACMPA\n\n-0 100 200\nTime (msec)\n\n(b)\n\n200\nTime (msec)\n\n(b)\n\nFig. 7. Similar temporal pattern of the firing activities of the neural cells\nresponding to Ao = 140, f = 200 pps, and I ms pulsewidth.\n\nwhich receive the intense projection from A. fibers. The\nsucceeding impulses transmitted on Ad fibers enhance the\nactivity of T cells at 45 ms and at the same time SG cells\nare inhibited by 14 cells that results in the relief of inhibi-\ntion of SG cells to T cells. After 100 ms, periodic change of\nfiring rate syncronized with the stimulus interval occurs in\nT cells and it lasts until 250 ms. At 250 ms, the succeeding\nvery few impulses transmitted on C fibers affect on T cells\nand facilitate their activities.\nThe firing pattern of VPL cells seems almost similar to\n\nthose of A fibers when low stimulus frequency is applied.\nIn contrast, PO cells are affected by the firing burst of A.\nfibers at 60 ms and by C fibers at 260 ms. It must be\nnoticed here that fort = 50 pps, the firing rate of PO cells\nchanges with a slight fluctuation of the same periodicity as\nthe stimulus interval Fig. 8. However, for f = 100 pps the\nfiring rate of PO cells shows a frequency fluctuation lower\nthan stimulus frequency. That is, the frequency demultipli-\ncation phenomenon occurs at 40 115 ms and after 250\nms. In the figures, the firing patterns of cortical cells are\nnot represented but their activities are enhanced by in-\ncreasing of the stimulus frequency.\nFrom the results mentioned above we can recognize that\n\nin the case of low stimulus frequency despite relatively high\nintensity, firing rates of PO and CM-Pf cells are very few\nand secondary burning pain may not be perceived, but the\nweak stinging pain or the graded intensity of touch sensa-\ntion from the different low stimulus frequency may be\nperceived. As a matter of course, the stimulation by grad-\ning stimulus intensity gives about the same modality as\npain and touch sensation.\n\nFig. 8. Temporal pattern of firing activities of T, VPL, PO, and CM-Pf\ncells responding to the different stimulus frequencies. (a) f = 50 pps,\nAo = 140. (b) 100 pps, Ao = 140, comparing with the result of Fig. 7\nforf = 200 pps, Ao = 140, 1 ms pulsewidth.\n\nV. DISCUSSION\n\nThis paper presents a neural network model which\nsimulates the conduction mechanism of pain sensation. As\nshown in Fig. 3 and Figs. 6-8, each temporal firing patter\nmimics the modalities of pain and touch sensations. Similar\nmodalities of firing discharges to those of the model simu-\nlation can be found in the physiological literatures: Price et\nal., studied the intracellular responses of dorsal horn cells\n(Rexed's lamina IV-VI cells) of cat to cutaneous and sural\nnerve A and C fiber stimuli [1]. Short latency (5 -10Ims),\npostsynaptic potential, and spike responses were evoked by\nlow-intensity nerve stimulation of single electrical shock.\nIncreasing stimulus intensity to excite both A and C nerve\nfibers elicited both short latency and long latency (> 200\nms) postsynaptic potential sequences and prolonged dis-\ncharges in the dorsal horn cells. Increase in the cell dis-\ncharge rate with repetitive stimulation supramaximal for A\nfibers was observed. Progressive depolarizations and\nsuccessive increases in spike discharges were evoked by the\nrepetitive stimulation maximal for C fibers. Menetrey et al.\nalso studied extracellular recordings for response proper-\nties of dorsal horn cells (lamina I-IV) of rat to nonnoxious\nand noxious stimuli [3]. A large number of cells responded\nwith short latency and short duration bursts of activity to\nlow intensities of transcutaneous single electrical stimula-\ntion. A high percentage of the cells showed an additional\nlate response when the intensity and the duration of the\nperipheral electrical stimulation were increased. In the\nmajority of cases the late response presented two clear\ncomponents with respective latencies of maximal discharge\nof approximately 200 and 300 ms. Supramaximal stimula-\ntion induced a progressive increase in the latencies of the\nlate components of responses which were due to C fiber\ninput. Post-stimulus histograms of the spike discharges\n(firing rates) were very similar to those obtained by Price et\nal. [1], Hillman et al. [12], Willis et al. [19], Foreman et al.\n[55] as were the results of our model simulation. LeBlanc\nand Gatipon extracellularly recorded the response char-\nacteristics of single neurons in the gigantocellular nucleus\n\n1 lEl/\\! \\ -VPL A. = 140\n/200p\n\n0\n\n300 400\n\nl -jAL\n\n490\n\nAuthorized licensed use limited to: California Polytechnic State University San Luis Obispo. Downloaded on July 12,2022 at 17:27:38 UTC from IEEE Xplore.  Restrictions apply. \n\n\n\nMINAMITANI AND HAGITA: COMPUTER SIMULATION OF CENTRAL NEURAL ACTIVITIES\n\nof medial bulboreticular formation (BRF-GC) of a cat to\nelectrical stimulation. This consisted of a supramaximal\npulse train at a frequency of 80 Hz which was sufficient to\nactivate small fiber activity in the sural nerve [2]. With the\nrepetitive electrical stimulation some neurons showed a\nwindup phenomenon characterized by a progressive in-\ncrease in firing rate and duration of their response. A serial\ntachogram of interspike intervals recorded from some neu-\nrons showed a decrease in the interspike intervals (increase\nin firing rates) and the succeeding periodic fluctuation of\nfiring rates during the application of successive pulse train\nstimulation. Poggio and Mountcastle studied the functional\nproperties of ventrobasal thalamic neurons in unanesthe-\ntized monkeys and observed extracellular responses of VPL\ncells to repetitive electrical stimuli applied on the periph-\neral receptive field [31]. Responses of VPL cells followed\nthe stimuli to rates of 100 - 200 Hz with great fidelity. At\nor above these rates, the cells failed to respond to every\nstimulus. However with further increases in the frequency\nof stimulation there is no further increase in the frequency\nof nerve cell response. The functional relation between the\nfrequency of neuronal discharges and the frequency of\nstimulation showed a power function the exponent of\nwhich was less than one.\nThe model however represents the actual neural path-\n\nways very simply and therefore has some limitations in\nshowing the whole mechanisms of complex pain genera-\ntion. Some of the points that give rise to discussion include\nthe following. First, the model parameters used are de-\ntermined to simulate analgesia, hyperalgesia, and the other\npain modality after the iterative examination of the param-\neter values. Analgesia can be simulated by the deficiency\nand the excessive decreasing of coupling coefficients or by\nthe excessive elevation of firing thresholds of A6 and C\nfibers. Hyperalgesia can also be simulated by the same\nabnormality of A,3 fibers [56]. The parameters such as the\nfiring threshold and coupling coefficient are not unitarily\ndefined as so-called parameters but are one of them. The\ndecided parameters are relatively appropriate to simulate\nthe pain mechanism but are unphysiological for the strict\nrepresentation of the neural properties. In our model the\nconduction velocity and firing threshold of each neural\nfiber have been assumed to be constant. The distribution of\nthe different diameters have been physiologically observed\nin each class of afferent fiber which in turn correlates\nclosely to the conduction velocity and the firing threshold.\nIt could be supposed that a difference of conduction\nvelocities would result in the distribution of central delays\nof evoked responses, and that the prolonged discharges of\nspinal cord cells would occur through the successive firing\nconduction with different velocities through the multisyn-\naptic connection. Physiological experiments [12], [55]\nshowed that lamina IV and V cells responding to single\nstimulus evoked an initial high frequency burst of impulses\nlasting 25 - 30 ms with short latency (5 - 6 ms) followed\nby low frequency discharges with a little longer latency of\n30 - 40 ms. Furthermore a prolonged low frequency dis-\ncharge lasted several hundred milliseconds following a\n\nsilent period of 100 - 250 ms. When the stimulus intensity\nwas raised to a level to excite C fibers, the cells in lamina\nIV and V responded with long latency (200 - 475 ms)\ndischarges. These discharges often consisted of two or three\nhigh frequency bursts of spikes separated by silent periods.\nLow frequency prolonged discharges lasting several\nhundred milliseconds could also be observed in some neu-\nrons responding to C fiber stimulation. According to Price\n[57], stimulus to A fibers evoked a brief latency burst of\nspikes, about a 50 ms pause and then a low frequency\ndischarge. When C fibers were additionally stimulated,\nhigh frequency prolonged discharges occurred at latencies\ngreater than 200 ms. Our model experiment however could\nnot simulate the prolonged discharges lasting a few hundred\nmilliseconds but only those of about 50 ms. The latency\nperiod and the duration of initial burst evoked by AA fiber\nstimulation and those of the secondary burst evoked by As\nfibers are simulated in good agreement compared with the\nphysiological results as shown in Fig. 3. The model realiza-\ntion of the prolonged discharge evoked by C fibers is\nconsidered to include the distributions of the conduction\nvelocity and the firing threshold of these fibers in the\nmodel.\n\nIn addition there are few reports in the research litera-\nture giving specific evidence on the pathway that small\nfibers (A,, C) ascend in the marginal cells of the dorsal\nhorn (lamina I) and terminate through the medulla in\nseveral thalamic regions [58], [59]. The pain pathway via\nlamina I responding only to noxious stimuli is omitted in\nour model.\nThe results of model simulation showed the firing char-\n\nacteristics of the central neural cells projected from the\nspecified location x = xm of peripheral receptors. As can\nbe seen in Fig. 2, the proposed neural network model\nrepresents only one directional ascending and descending\npathway. No interactions of the lateral adjacent fields such\nas lateral inhibition and facilitation in the higher regions\nthan spinal cord have been proposed. In spite of the\nsimplified model of the vertically arranged networks, the\ncharacteristic of two point discrimination (TPDT) can be\nsufficiently but not relatively well simulated, which will be\npresented in a succeeding study. For the more precise\nsimulation of TPDT, or of the well-localized sharp stinging\nfirst pain and the diffuse localized second burning pain,\nthe model must be reformed by introducing lateral inhibi-\ntions and facilitations into the network. Laterally an\narranged feedback system must also be considered in the\nmodel in order to mimic the descending control from the\nupper brain, which mainly serves the important inhibitory\ninteractions. Lateral inhibitions have been observed on the\nafferent pathways: 1) from the dorsal horn of the spinal\ncord toward the dorsal column nuclei (DCN), 2) from\nDCN toward the ventrobasal nuclear complex and 3) in\nthe somatic sensory area SI and SII. There would be some\ncomplicated synaptic relays in the central system. However\nit is even now unknown what interactions are formed on\nthe ascending and descending pathways and how those are\nformed. Physiological and anatomical investigations are\n\n491\n\nAuthorized licensed use limited to: California Polytechnic State University San Luis Obispo. Downloaded on July 12,2022 at 17:27:38 UTC from IEEE Xplore.  Restrictions apply. \n\n\n\nIEEE TRANSACTIONS ON SYSTEMS, MAN, AND CYBERNETICS, VOL. SMC- 1, NO. 7, JULY 1981\n\nunderway for the analytical elucidation of the spatial infor-\nmation processing mechanism of somatic sensations such\nas TPDT, phantom sensation, and phantom limb pain.\n\nPain impulse is evoked by any given noxious stimulation\nand transmitted through the complex afferent pathways\ninto the upper brain. Some chemical substances are involved\nin the pain sensation generation process. One type of\nchemical substance is pain inducing such as Bradykinin or\nHistamine through chemical response to noxious stimula-\ntion. Pain control substances such as Enkephalin or En-\ndorphin suppress the transmission of pain information on\nthe synapses of afferent pathways. These chemical reac-\ntions are very important in the pain mechanisms especially\nthose related to inflammation, however the model realiza-\ntion of that chemical process has not been carried out in\nthis paper. A control model of the chemical reactions will\nalso be required for the precise representation of pain\nmodality.\nFrom the results of computer simulation it could be\n\nconcluded that the proposed neural network model would\nbe appropriate and useful for the quantitative analysis of\npain mechanisms. The model mimics the pain modality\nquite well, and the results are in good agreement with some\nof physiological results. Further discussions concerned with\nthe response characteristics of the neural cells which can be\ndescribed by Steven's power law and with the so-called\npain threshold characteristic will be given in a succeeding\npaper.\n\nNOMENCLATURE\n\n((x) Spatial Gaussian distribution of peripheral recep-\ntors.\n\na Spatial variance of the receptor distribution.\nain Spatial variance of the spread decrease in the input\n\nstimulus.\nA1n Input stimulus intensity.\nAo Amplitude of stimulus.\nf(t) Temporal mode of stimulus.\nx, X Distance from an arbitrary point in the receptive\n\nfield to the corresponding peripheral afferent fiber.\nx0 Center position of stimulation probe.\nS, Si Effective spatio-temporal stimulus intensity.\n'0 Attenuation of input intensity through the periph-\n\neral tissue.\nyi Neuronal membrane time constant.\nFi Neural unit activity.\nri Absolute refractory period.\nvi Sensitivity coefficient of neural response to the\n\ninput.\n9* Threshold of neural unit which varies with adapta-\n\ntion effect.\nOi Constant threshold of the neural unit.\nki Factor determining the extent of the adaptation.\nxii State variable representing the variation of excit-\n\nability due to the outward Na+ current from the\nneural cell.\n\na',\nv\n\nva\nve\ni i\n\nState variable representing the variation of excit-\nability due to the inward Na+ current from the\noutside of neural cell.\n\n,8i The rate constants of the Na+ pump transitions.\nConduction velocity of A., fiber.\nConduction velocity of A. fiber.\nConduction velocity of C fiber.\nCoupling coefficient from j to i neural unit.\n\nACKNOWLEDGMENT\n\nThe authors wish to express their gratitude to Prof. T.\nSuzuki of Keio University, Japan and to Prof. H. Nakahama\nof Tohoku University, Japan for the valuable suggestions\nand encouragement of the study.\n\nREFERENCES\n\n[1] D. D. Price, C. D. Hull, and N. A. Buchwald, \"Intracellular\nresponses of dorsal horn cells to cutaneous and sural nerves A and\nC fibre stimuli,\" Exp. Neurol., vol. 33, pp. 291-309, 1971.\n\n[2] H. J. LeBlanc and G. B. Gatipon, \"Medial bulboreticular response\nto peripherally applied noxious stimuli,\" Exp. Neurol., vol. 42, pp.\n264-273, 1977.\n\n[3] D. Menetrey, G. J. Geisler, and J. M. Besson, \"An analysis of\nresponse properties of spinal cord dorsal horn neurons to nonnoxi-\nous and noxious stimuli in the spinal rat,\" Exp. Brain Res., vol. 27,\npp. 15-33, 1977.\n\n[4] F. Cervero, A. Iggo, and V. Molony, \"Responses of spinocervical\ntract neurons to noxious stimulation of the skin,\" J. Physiol., vol.\n267, pp. 537- 558, 1977.\n\n[5] C. Burton and D. D. Maurer, \"Pain suppression by transcutaneous\nelectronic stimulation,\" IEEE Trans. Biomed. Eng., vol 21, pp.\n81-88, 1974.\n\n[6] M. Linzer and D. M. Long, \"Transcutaneous neural stimulation for\nrelief of pain,\" IEEE Trans. Biomed. Eng., vol. 23, pp. 341-345,\n1976.\n\n[7] T. Hockfelt, A. Ljungdahl, L. Terenius, R. Elde, and G. Nilsson,\n\"Immunohistochemical analysis of peptide pathways possibly re-\nlated to pain and analgesia: Enkephalin and substance P,\" Proc.\nNatl. Acad. Sci., U.S., vol. 74, pp. 3081-3085, 1977.\n\n[8] M. von Frey, \"Britrage zur Physiologie des Schmerzsinns,\" Ber. Kgl.\nSachs. Ges. Wiss., vol. 46, pp. 186-203, 1894.\n\n[9] D. C. Sinclair, \"Cutaneous sensation and the doctrine of specific\nenergy,\" Brain, vol. 78, pp. 584-614, 1955.\n\n[10] G. Weddell and S. Miller, \"Cutaneous sensibility,\" Ann. Rev.\nPhysiol., vol. 24, pp. 199-222, 1962.\n\n[I1] R. Melzack and P. D. Wall, \"Pain mechanisms, a new theory,\"\nScience, vol. 150, pp. 971 -979, 1965.\n\n[12] P. Hillman and P. D. Wall, \"Inhibitory and excitatory factors\ninfluencing the receptive fields of lamina 5 spinal cord cell,\" Exp.\nBrain Res., vol. 9, pp. 284-306, 1969.\n\n[13] H. R. Wilson and J. D. Cowan, \"A mathematical theory of the\nfunctional dynamics of cortical and thalamic nervous tissue,\"\nKybernetik, vol. 13, pp. 55- 80, 1973.\n\n[14] K. 0. Johnson, \"Reconstruction of population response to a vibra-\ntory stimuli in quickly adapting mechanoreceptive afferent fiber\npopulation innervating glabrous skin of the monkey,\" J. Neurophys-\niol., vol. 37, pp. 48- 72, 1974.\n\n[15] J. C. Bliss and W. B. Macurdy, \"Linear models for contrast phe-\nnomenon,\" J. Opt. Soc. Amer., vol. 53, pp. 1373- 1379, 1961.\n\n[16] W. J. Williams, \"Transfer characteristics of dispersive nerve bun-\ndles,\" IEEE Trans. Syst., Man, Cybern., vol. SMC-2, pp. 72-85,\n1972.\n\n[17] G. Kinoshita and M. Mori, \"An elastic model of the skin and some\nproperties on the variable threshold processing of an artificial tactile\nsense,\" Jap. J. Instrum. Control Eng., vol. 8, pp. 398-405, 1972 (in\nJapanese).\n\n[18] K. R. Brennen, \"The characterization of transcutaneous stimulating\n\n492\n\nAuthorized licensed use limited to: California Polytechnic State University San Luis Obispo. Downloaded on July 12,2022 at 17:27:38 UTC from IEEE Xplore.  Restrictions apply. \n\n\n\nMINAMITANI AND HAGITA: COMPUTER SIMULATION OF CENTRAL NEURAL ACTIVITIES\n\nelectrodes,\" IEEE Trans. Biomed. Eng., vol. BME-23, pp. 337-340,\n1976.\n\n[19] W. D. Willis, R. A. Maunz, R. D. Foreman, and J. D. Coulter,\n\"Static and dynamic responses of spinothalamic tract neurons to\nmechanical stimuli,\" J. Neurophysiol., vol. 38, pp. 587-599, 1975.\n\n[20] R. C. Thomas, \"Membrane current and intracellular sodium changes\nin a snail neuron during extrusion of injected sodium,\" J. Physiol.,\nvol. 201, pp. 495-514, 1969.\n\n[21] R. B. Stein, K. V. Leung, D. Mangeron, and M. N. Oguztoreli,\n\"Improved neuronal models for studying neural networks,\"\nKybernetik, vol. 15, pp. 1-9, 1974.\n\n[22] A. P. Georgopoulos, \"Functional properties of primary afferent\nunits probably related to pain mechanisms in primate glabrous\nskin,\" J. Neurophysiol., vol. 39, pp. 71-83, 1976.\n\n[23] B. Pomeranz, P. D. Wall, and W. V. Weber, \"Cord cells responding\nto fine myelinated afferents from viscera, muscle, and skin,\" J.\nPhysiol., vol. 199, pp. 511-532, 1968.\n\n[24] W. F. Ganong, \"Nerve fiber types and function,\" in Review of\nMedical Physiology. Los Altos, CA: Lange Medical Publications,\n1973, pp. 29-31.\n\n[25] H. J. Ralston, \"The organization of the substantia gelatinosa Rolandi\nin the cat lumbosacral spinal cord,\" Z. Zellforsch. Mikrosk. A nat.,\nvol. 67, pp. 1-18, 1965.\n\n[26] T. Hongo, E. Jankowska, and A. Lundberg, \"Post-synaptic excita-\ntion and inhibition from primary afferents in neurons of the spino-\nceruicial tract,\" J. Physiol., vol. 199, pp. 569-592, 1968.\n\n[27] D. D. Price and I. H. Wagman, \"Relationships between pre- and\npostsynaptic effects of A and C fiber inputs to dorsal horn of M.\nMulatta,\" Exp. Neurol., vol. 40, pp. 90-103, 1973.\n\n[28] L. M. Mendell and P. D. Wall, \"Presynaptic hyperpolarization: A\nrole for fine afferent fibers,\" J. Physiol., vol. 172, pp. 274-294,\n1964.\n\n[29] P. D. Wall, \"The gate control theory of pain mechanism, a re-\nexamination and re-statement,\" Brain, vol. 101, pp. I- 18, 1978.\n\n[30] T. Yokota, \"Central pain mechanism,\" The Saishin Igaku (Current\nMedicine), vol. 29, pp. 1521- 1529, 1974 (in Japanese).\n\n[31] G. F. Poggio and V. B. Mountcastle, \"The functional properties of\nventrobasal thalamic neurons studied in unanesthetized monkeys,\"\nJ. Neurophysiol., vol. 26, pp. 775-806, 1963.\n\n[32] H. Nakahama, \"Pain mechanisms in the central nervous system,\"\nNeurophysiol. Basis Anesthes., vol. 13, pp. 109-148, 1975.\n\n[33] D. Bowsher, A. Mallart, D. Petit, and D. Albe-Fessard, \"A bulbar\nrelay to the centre median,\" J. Neurophysiol., vol. 31, pp. 288- 300,\n1968.\n\n[34] H. L. Fields, G. M. Wagner, and S. D. Anderson, \"Some properties\nof spinal neurons projecting to the medial brain-stem reticular\nformation,\" Exp. Neurol., vol. 47, pp. 118-134, 1975.\n\n[35] D. Bowsher, \"The anatomophysiological basis of somatosensory\ndiscrimination,\" Int. Rev. Neurobiol., vol. 8, pp. 35-75, 1965.\n\n[36] G. F. Poggio and V. B. Mountcastle, \"A study of the functional\ncontributions of the lemniscal and spinothalamic systems to somatic\nsensibility,\" Bull. Johns Hopks. Hosp., vol. 106, pp. 266-316, 1960.\n\n[37] B. Ishijima, \"Central mechanism of pain,\" Shinkei Shinpo, vol. 11,\npp. 57- 86, 1967 (in Japanese).\n\n[38] J. L. Oliveras, J. M. Besson, G. Guilbaud, and J. C. Liebeskind,\n\"Behavioral and electrophysiological evidence of pain inhibition\nfrom midbrain stimulation in the cat,\" Exp. Brain Res., vol. 20, pp.\n32-44, 1974.\n\n[39] P. Andersen, J. C. Eccles, and T. A. Sears, \"Cortically evoked\ndepolarization of primary afferent fibers in spinal cord,\" J. Neuro-\nphysiol., vol. 27, pp. 63-77, 1964.\n\n[40] M. C. Wyon-Maillard, C. Conseiller, and J. M. Besson, \"Effects of\n\norbital cortex stimulation on dorsal horn interneurons in the cat\nspinal cord,\" Brain Res., vol. 46, pp. 71-83, 1972.\n\n[41] E. E. Fetz, \"Pyramidal tract effects on interneurons in the cat\nlumbar dorsal horn,\" J. Neurophysiol., vol. 31, pp. 69- 80, 1968.\n\n[42] A. Taub, \"Local, segmental and supraspinal interaction with a\ndorsolateral spinal cutaneous afferent system,\" Exp. Neurol., vol.\n10, pp. 357-374, 1964.\n\n[43] P. D. Wall, \"The laminar organization of dorsal horn and effects of\ndescending impulses,\" J. Physiol., vol. 188, pp. 403-423, 1967.\n\n[44] A. G. Brown, \"Effects of descending impulses on transmission\nthrough the spinocervical tract,\" J. Physiol., vol. 219, pp. 103- 125,\n1971.\n\n[45] T. Kusama, K. Otani, and E. Kawana, \"Projections of the motor,\nsomatic sensory, auditory and visual corticies in cats,\" in Prog. in\nBrain Res., vol. 21A, T. Tokizane and J. P. Schade, Eds. Amster-\ndam, The Netherlands: Elsevier, 1966, pp. 292-322.\n\n[46] D. Carpenter, I. Engberg, and A. Lundberg, \"Primary afferent\ndepolarization evoked from the brain stem and the cerebellum,\"\nArch. Ital. Biol., vol. 104, pp. 73-85, 1966.\n\n[47] A. Lundberg, \"Integration in the reflex pathways,\" in Nobel Sym-\nposium I: Muscular Afferents and Motor Control, R. Granit, Ed.\nNew York: Wiley, 1966, pp. 273- 305.\n\n[48] M. Rethelyi and J. Szentagothai, \"The large synaptic complexes of\nthe substantia gelatinosa,\" Exp. Brain Res., vol. 7, pp. 258-274,\n1969.\n\n[49] M. Scheibel, A. Scheibel, A. Mollica, and G. Moruzzi, \"Con-\nvergence and interaction of afferent impulses on single units of\nreticular formation,\" J. Neurophysiol., vol. 18, pp. 309-331, 1955.\n\n[50] K. Amano and K. Sano, \"Single unit analysis on reticular neurons\nof the midbrain near the central gray-Cerebral modulation on\nsomatosensory evoked midbrain reticular response,\" Jap. J. Neuro-\nsurg., vol. 1, pp. 319-327, 1973 (in Japanese).\n\n[51] E. G. Jones and T. P. S. Powell, \"The projection of the somatic\nsensory cortex upon the thalamus in the cat,\" Brain Res., vol. 10,\npp. 369- 391, 1968.\n\n[52] K. Iwama and C. Yamamoto, \"Impulse transmission of thalamic\nsomatosensory relay nuclei as modified by electrical stimulation of\nthe cerebral cortex,\" Jap. J. Physiol., vol. 11, pp. 169- 182, 1961.\n\n[53] H. Minamitani and N. Hagita, \"Adaptation effect on sensory\nnerves,\" Res. Papers Inst. Elect. Comm. Eng. Japan, vol. MBE78-72,\npp. 41-48, 1979.\n\n[54] J. C. Liebeskind, G. Guilbaud, J. M. Besson, and J. L. Oliveras,\n\"Analgesia from electrical stimulation of the periaqueductal gray\nmatter in the cat: Behavioral observations and inhibitory effects on\nspinal cord interneurons,\" Brain Res., vol. 50, pp. 441-446, 1973.\n\n[55] R. D. Foreman, A. E. Appelbaum, J. E. Beall, D. L. Trevino, and\nW. D. Willis, \"Responses to primate spinothalamic tract neurons to\nelectrical stimulation of hindlimb peripheral nerves,\" J. Neurophys-\niol., vol. 38, pp. 132-145, 1975.\n\n[56] H. Minamitani, N. Hagita, and T. Suzuki, \"A neural network model\nof pain mechanisms,\" Trans. Inst. Elect. Comm. Eng. Japan, vol.\n61-A, pp. 612-614, 1978 (in Japanese).\n\n[57] D. D. Price, \"Characteristics of second pain and flexion reflexes\nindicative of prolonged central summation,\" Exp. Neurol., vol. 37,\npp. 371-387, 1972.\n\n[58] W. D. Willis, D. L. Trevino, J. D. Coulter, and R. A. Maunz,\n\"Responses of primate spinothalamic tract neurons to natural\nstimulation of hindlimb,\" J. Neurophysiol., vol. 37, pp. 358-372,\n1974.\n\n[59] F. Cervero, A. Iggo, and H. Ogawa, \"Nociceptor-driven dorsal horn\nneurons in the lumbar spinal cord of the cat,\" Pain, vol. 2, pp.\n5-24, 1976.\n\n493\n\nAuthorized licensed use limited to: California Polytechnic State University San Luis Obispo. Downloaded on July 12,2022 at 17:27:38 UTC from IEEE Xplore.  Restrictions apply. \n\n\n", "status": 200, "abstract": "A neural network model is proposed to obtain a numericaldescription of pain mechanisms. The modeling presented here is based onthe various assumptions made by the results of physiological and anatomi-cal studies reported in the literature and by ourselves. Those studies,especially on the neural connections between the neural units concerned inthe pain mechanisms do not give conclusive evidence, and some of theresults are claimed by other investigators. The assumptions used areunverified for this reason. The quantitative model presented is only asimplified one and simulates only one directional ascending and descendingpathway for the pain sensation in which peripheral receptors, afferent A,A 5, and C fibers, and the receptive cells of spinal cord, brain stem,thalamus, and the cerebral cortex are involved. No interactions from thelateral adjacent fields such as lateral inhibition and facilitation have beenproposed, and no analytical elucidation of spatial information processingmechanisms has been made. Only the firing characteristics of the neuralcells related to pain generation are investigated and compared with thephysiological results. Adaptation effect and conduction velocity of neuralfibers are considered in the model, however the fibers in each neural unitare assumed to have constant conduction velocity and firing threshold.Model simulation has been carried out for the single square-wave pulse andthe periodic repetitive pulse stimulation applied on peripheral receptors.The activities of the neural cells of periphery and the upper brain arerepresented by Wilson- Cowan's nonlinear differential equation, whichconsiders the ongoing activity of neurons. Pain sensibility is mainly esti-mated by the firing activities of the thalamic posterior nuclei group (PO)and centromedian parafascicular complex (CM-Pf) cells, while the touchsensibility is estimated by the firing activities of thalamic ventral post-erolateral nuclei (VPL) cells and the first somatic sensory area (SI) cells inthe cerebral cortex. Fast stinging pain and slow burning pain can besimulated quite well, and the modality of the graded touch sensation canalso be simulated with this model. The results of the simulation are in goodagreement with some of the physiological studies notwithstanding thesimplified model with some unverified assumptions. It suggests that theproposed neural network model would be appropriate and available toobtain many different sensory modalities concerned with not only the painbut also the tactile mechanisms."}