{"metadata": {"Author": "Administrator", "Content-Type": "application/pdf", "Creation-Date": "2006-06-26T16:08:09Z", "CreationDate--Text": "Mon Jun 26 16:08:09 2006", "Keywords": "", "Last-Modified": "2006-07-08T19:52:31Z", "Last-Save-Date": "2006-07-08T19:52:31Z", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.pdf.PDFParser"], "X-TIKA:content_handler": "ToTextContentHandler", "X-TIKA:embedded_depth": "0", "X-TIKA:parse_time_millis": "73", "access_permission:assemble_document": "true", "access_permission:can_modify": "true", "access_permission:can_print": "true", "access_permission:can_print_degraded": "true", "access_permission:extract_content": "true", "access_permission:extract_for_accessibility": "true", "access_permission:fill_in_form": "true", "access_permission:modify_annotations": "true", "cp:subject": "", "created": "2006-06-26T16:08:09Z", "creator": "Administrator", "date": "2006-07-08T19:52:31Z", "dc:creator": "Administrator", "dc:format": "application/pdf; version=1.3", "dc:subject": "", "dc:title": "91_1.tif", "dcterms:created": "2006-06-26T16:08:09Z", "dcterms:modified": "2006-07-08T19:52:31Z", "meta:author": "Administrator", "meta:creation-date": "2006-06-26T16:08:09Z", "meta:keyword": "", "meta:save-date": "2006-07-08T19:52:31Z", "modified": "2006-07-08T19:52:31Z", "pdf:PDFVersion": "1.3", "pdf:charsPerPage": ["3173", "3389", "3729", "1186", "2965", "1924", "3417", "3344", "3659", "2035", "2850", "1311", "2074", "2184", "533"], "pdf:docinfo:created": "2006-06-26T16:08:09Z", "pdf:docinfo:creator": "Administrator", "pdf:docinfo:creator_tool": "91_1.tif", "pdf:docinfo:custom:CreationDate--Text": "Mon Jun 26 16:08:09 2006", "pdf:docinfo:keywords": "", "pdf:docinfo:modified": "2006-07-08T19:52:31Z", "pdf:docinfo:producer": "PageGenie PDFGenerator", "pdf:docinfo:subject": "", "pdf:docinfo:title": "PII: S0022-5193(89)80151-1", "pdf:encrypted": "false", "pdf:hasMarkedContent": "false", "pdf:hasXFA": "false", "pdf:hasXMP": "true", "pdf:unmappedUnicodeCharsPerPage": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "producer": "PageGenie PDFGenerator", "resourceName": "b'15.pdf'", "subject": "", "title": "91_1.tif", "xmp:CreatorTool": "91_1.tif", "xmpMM:DocumentID": "uuid:6c135c9c-2684-49af-88ab-717565a9e344", "xmpTPg:NPages": "15"}, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n91_1.tif\n\n\nJ. theor. Biol. (1989) 137, 91-105 \n\nA Mathematical Model of the Gate Control Theory of Pain \n\nN. F. BRITTONt AND SUZANNE M. SKEVINGTON:~ \n\nSchool of Mathematical Sciences, t and School of Social Sciences,$ \nUniversity of Bath, Claverton Down, Bath, U.K. \n\n(Received 20 August 1988, and accepted in revised form 18 November 1988) \n\nThe first test which any theory of pain must pass is that it must be able to explain \nthe phenomena observed in acute pain in humans. This criterion is used to test the \nmajor theory of pain at present, the gate control theory of Melzack & Wall (1965, \n1982). The theory is explicit enough to be cast in mathematical terms, and the \nmathematical model is shown to explain the observations considered. It also points \nup a common misconception on the consequences of the theory, and thus demolishes \nan argument which has been used against it. A hypothesis of the origin of rhythmic \npain is then made, and consequent testable predictions given. This is the first time \nthat the gate control theory has been used to explain any quality of pain. It has \nimportant consequences for the treatment of such pain. Finally, the applicability of \nthe gate control theory as an explanation for chronic pain is discussed. \n\n1. Introduction \n\nIn this section we give a short review of  neurophysiological mechanisms which \ncause pain to be experienced and inhibited. We then consider certain observations \nwhich a satisfactory theory of pain must account for, and discuss various theories \nin the light of  these. In section 2 we make a mathematical model for the only theory \nwhich is both explicit enough to be written in mathematical terms and which gives \nreasonable explanations for the observations. We analyse this model in an appendix \nand interpret the results from a biological point of  view in section 3. In the final \nsection of  the paper we discuss the results obtained. \n\nIn the skin, muscles, joints and some viscera are receptors attached to nerve fibres. \nWe shall concentrate on cutaneous sensation for the purposes of this paper. Stimula- \ntion of  the receptors causes nerve impulses to travel along these fibres to three \nsystems in the spinal cord (see, for example, Willis, 1985; Ottoson, 1983). The first \nof  these is the substantia gelatinosa (SG) in the dorsal horns. The nerve cells here \nare small and connect with each other by short fibres and the longer fibres of  \nLissauer's tract, and with other cells deeper in the dorsal horns. Cells deep in the \ndorsal horns are also stimulated directly by nerve impulses from the receptor fibre \nunits of  the skin, and there are cells in this area whose axons form part of  the \nascending spino-thalamic tract, which connects with lower centres in the brain and \nwhich is an integral part of  the action system designed to deal with pain. The third \nsystem in the spinal cord reached by nerve impulses from the skin is in the dorsal \ncolumn, the fibres of  which project to the cortex of the brain. \n\nWe shall be concerned with three kinds of nerve fibres from the skin to the spinal \ncord. First are the C fibres, which are unmyelinated (i.e. without insulation from a \n\n91 \n\n0022-5193/89/050091 + 15 $03.00/0 © 1989 Academic Press Limited \n\n\n\n92 N . F .  B R I T T O N  A N D  S. M.  S K E V I N G T O N  \n\nfatty sheath of myelin), and hence conduct impulses relatively slowly, at around \n0.25-1-25 m/sec. Second are the A-delta fibres, which are thinly myelinated, and \nconduct impulses much more quickly, at around 6-30 m/sec. Third are the A-beta \nfibres, which are heavily myelinated, and conduct more quickly still, at around \n30-100 m/sec. C and A-delta fibres are of small diameter (0.25-1-5 and 1-5 microns \nrespectively), whereas A-beta fibres are large (5-15 microns). The small (C and \nA-delta) fibres connect with the SG and cells deeper in the dorsal horns whereas \nthe large (A-beta) fibres connect with these and with the dorsal column as well. \nEach of these fibres is attached to a receptor in the skin, which may be a Meissner's \ncorpuscle, a Pacinian corpuscle, a Ruffini or Krause end-organ or, for the great \nmajority (around 60-70%), and most important for the study of pain, a free nerve \nending. \n\nAny theory of pain must be able to account for the following observations: \n(i) Increased stimulation of  the small nerve fibres of  the skin usually increases \n\npain (e.g. van Hees & Gybels, 1972; Hallin & Torebj~Srk, 1973). \n(ii) Increased stimulation of  the large nerve fibres may increase pain transitorily, \n\nbut in the longer term may relieve it (e.g. Wall & Sweet, 1967; Chapman et \naL, 1976). (This is the basis for rubbing the skin where it has been injured \nin order to relieve pain.) \n\n(iii) Pain relief may be achieved by electrical stimulation of the grey matter of \nthe midbrain (e.g. Hosobuchi et al., 1977). \n\n(iv) It is sometimes the case that injuries which would normally cause great pain \ncause little or no pain at all, or that the onset of  pain is delayed (e.g. battle \ninjuries (Beecher, 1959) or injuries requiring treatment in an emergency \nclinic (Melzack et aL, 1982). \n\n(v) It is sometimes the case that anticipation of pain is sufficient to raise the \nlevel of  anxiety and thereby the intensity of  perceived pain (e.g. Hall & \nStride, 1954). \n\nIt is reasonable to ask why we have chosen these observations to address rather \nthan any others. We used the following criteria: (a) the observations were on human \nsubjects, and (b) only effects which did not involve long term changes in the nervous \nsystem were considered. The reason for this is that in order to test the theory of \npain we would have to make assumptions about these changes, and we would be \nunable to tell whether any negative results were due to errors in these assumptions \nor in the theory itself. It follows that we have not considered any observations on \nthe development of chronic pain states or on neuropathological conditions. \n\nBefore 1965, there were two main types of theories of pain. For a more complete \nreview see Meizack & Wall (1965, 1982), Nathan (1976) and Willis & Coggeshall \n(1978). The first was specificity theory (von Frey, 1894), which states that pain is \nproduced by stimulating pain receptors thus causing nerve impulses to follow \npain-specific pathways to a pain centre in the brain. The pain receptors are the free \nnerve endings on C and A-delta fibres. Specificity theory in its simplest form thus \nproposes that pain felt is a direct consequence of  the number of pain fibres being \nstimulated, and therefore it is difficult to explain observations (ii), and especially \n(iii) to (v), on this basis. The second theory of  pain was pattern theory (Goldscheider, \n\n\n\nG A T E  C O N T R O L  P A I N  T H E O R Y  93 \n\n1894; Weddell, 1955; Sinclair, 1955), which recognises that the spatio-temporal \npattern of the impulses from the skin are important. The impulses reaching the \nspinal cord are thus a coded message which is decoded by the central nervous \nsystem. In its simplest form this theory fails to take into account the physiological \nspecialisation of the peripheral nerve fibres, but its greatest failing from our point \nof view is that it gives no clue as to how the decoding mechanism works. \n\nOther theories of  pain had elements of both specificity theory and pattern theory. \nHead (1920), followed by Foerster (1927), Lewis (1942), Bishop (1959) and Noor- \ndenbos (1959), proposed that nociceptive impulses are carried in a slowly conducting \nsystem of small fibres and that there is a specific rapidly conducting system of large \nfibres which inhibits synaptic transmission in this system. This goes some way \ntowards accounting for observation (ii) but still proposes a direct relationship \nbetween a stimulus applied at a certain time and the sensation felt at that time, so \nthat there are still difficulties in accounting for observations (iii) to (v). In 1965 \nMelzack & Wall published their gate control theory of pain, which follows on from \nthese so-called sensory interaction theories. The differences between their theory \nand previous ones were (a) they proposed an explicit mechanism for the inhibition \nof the slowly conducting nociceptive system by the fast conducting one, and (b) \nthey proposed that descending controls from the brain could also moderate the \npassage of  nociceptive signals. The explicit mechanism attracted a great deal of \ncriticism on physiological grounds (see, for example, the review by Nathan, 1976), \nsome of which was dealt with in a major revision of the theory by Melzack & Wall \nin 1982. There is no doubt that the theory is a gross over-simplification of  the actual \nmechanism, but nevertheless provides a useful starting point and, so far, has not \nbeen replaced. The inclusion of descending controls makes it possible to account \nfor observations (iii) to (v) by allowing that the brain can consciously or automati- \ncally inhibit or promote transmission of nociceptive impulses up the spinal cord, \nand thus reduce or augment the pain being experienced. The gate control theory of \npain is easiest to explain using a diagram. \n\nIt was stated above that there are in the area of the dorsal horns of the spinal \ncord at deeper levels than the substantia gelantinosa (SG), cells which receive input \nfrom the SG, cells which receive input direct from the skin, and cells which transmit \noutput to the action system. It is proposed in the gate control theory of pain that \nthe cells in this region which transmit to the action system are the same as the cells \nwhich receive input from the skin and the SG, the so-called central transmission \n(T) cells. The gate control system is made up of these cells and the cells of the SG. \nThe output from the system is via the T-cells only, and determines the degree of \npain felt. The inputs to the system come from large and small afferent fibres (from \nthe skin, for example) and from the brain. The small afferent nerve fibres excite the \nT-cells directly (raising their potential towards the threshold where they fire) and \nalso excite cells in the SG which excite the T-cells. This accounts for observation \n(i), that increased stimulation of the small fibres in the skin increases pain. The \nlarge afferent nerve fibres excite the T-cells directly but also excite cells in the SG \nwhich inhibit the T-cells (lowering their potential from their firing threshold). If \nthere is a delay in the second of these effects then stimulation of  large afferent nerve \n\n\n\n94 N .  F.  B R I T T O N  A N D  S. M .  S K E V I N G T O N  \n\nCognitive \ncontrol \n\nDescending \ninhibitory \ncontrol \n\n' x  c T'xa \n\nXI \n\nSG \ninhibitory + \n\nT-cells ~ Aclion system \n\nSG \nexcitatory \n\n+ \n\nIp  i ! \n\nx~ \n\nFIG. 1. T h e  gate control theory of pain (adapted from Melzack & Wall (1982), who do not specify \nthe site of action of the cognitive control). (Plus signs) denote excitation, (minus signs) inhibition. T h e  \ncognitive control may be either excitatory or inhibitory. The impulse frequencies x in the various pathways \nof the system are also shown. \n\nfibres first causes an increase in the rate of  firing of the T-cells (due to the direct \nexcitation) and then a decrease (due to the inhibitive effect from the SG). Thus \npain would increase transitorily and then decrease, in accordance with observation \n(ii). The effect of the input to the gate control system from the brain is inhibitory \nor excitatory, and acts either directly on the T-cells or on the inhibitory SG cells, \nor both, but the physiological evidence seems to favour action via the superficial \nlayers of  the dorsal horn (see, for example, Fields & Basbaum, 1984). For this reason \nwe take the action to be via the SG, but the results would be substantially unaltered \n\n\n\nG A T E  C O N T R O L  P A I N  T H E O R Y  95 \n\nif we took it to be via the T-cells. The input to the brain comes both from the T-cells \nand directly from the large afferent fibres of  the skin via the dorsal column. The \ninput from the T-cells feeds into a centre in the mid-brain which automatically \nactivates a descending inhibitory control, which is assumed to act through the \ninhibitory SG cells. Artificial stimulation of the correct area of  the mid-brain would \nhave a similar effect, and this could explain observation (iii). The input from the \nlarge afferent fibres feeds into a centre in the higher brain which activates a cognitive \ncontrol. We shall assume that this also acts through the inhibitory SG cells. It may \nbe either inhibitory (by exciting these cells) or excitatory (by inhibiting them), \ndepending on psychological factors. This could explain observations (iv) and (v). \n\n2. The Mathematical Model \n\nThe mathematical  model is best explained by referring again to Fig. 1, which \nshows the firing frequencing x in each of the pathways due to a firing frequency xs \nin the small fibres and x~ in the large fibres of  the relevant area of  skin. We shall \nassume that the frequency of the outputs from the cognitive control and the \ndescending inhibitory control are strictly monotone increasing functions of  the \ninputs, that is \n\nx~ = ~ ( x , ) ,  xc = ~ ( x , ) ,  (1 )  \n\nwhere q~ and t~ are increasing functions satisfying ~ ( 0 ) =  0, ~ ( 0 ) =  0. \nWe shall consider the inputs and outputs to one particular T-cell and assume that \n\nneighbouring T-cells are similar. We shall also assume, for simplicity in the exposition \nonly, that each T-cell is stimulated by one large and one small afferent nerve fibre \nfrom the skin and one inhibitory and one excitatory SG cell. Allowing more than \none of any of  these would not change the results. Our modelling is in the spirit of  \nWilson & Cowan (1972). We shall thus work with the slow potentials I/, of  the \nT-cell, V~ of the inhibitory and Ve of the excitatory SG cell. The frequencies x,, x~ \nand xe at which these cells fire are functions of  the slow potentials, \n\nx, = f , ( v , ) ,  x,=f,(v~), Xe = f , ( V ~ ) .  (2 )  \n\nThe exact form of the functions f could be modelled, but all we shall require is \nthat they are of  the form shown in Fig. 3 and are zero for values of  V below a \ncertain threshold and strictly monotone increasing above that threshold. The poten- \ntials V of the cells depend on the frequencies of  impulses arriving at their dendrites \nfrom various sources, and on the dendrites and the synaptic junctions themselves, \nwhose properties we shall assume to be constant over the time scales which we are \nconsidering. The effect of  an input frequency xj to an excitatory or inhibitory synapse \nof  a cell of  potential Vk will be to raise it by qbjk, where \n\n¢Pjk = c~jk f '  hjk(t--r)g[xi( 'r)] dr  (3) \nd -  c~ \n\n(an der Heiden, 1980), where ark = 1 for an excitatory and - 1  for an inhibitory \nsynapse, hjk is a positive monotone decreasing function and gjk is a bounded strictly \n\n\n\n9 6  N . F .  B R I T T O N  A N D  S. M. S K E V I N G T O N  \n\nmonotone increasing function satisfying gjk(O)----O. We shall take the simplest form \nfor h~k, \n\nhj~(t) = - -  exp - (4) \n\nwhich represents a simple RC-network with ~'k the time constant of  the membrane. \nThe total effect of  inputs to cell k gives \n\nV~ = V~o+Y~ %k, (5) \nJ \n\nwhere Vko is the resting potential of  the cell. This assumes that the system is linear \nand is a good approximation at least for small variations in the variables. The \nassumption may be relaxed without qualitatively affecting the results. Differentiating \neqn (5) using eqns (3) and (4) and rearranging \n\n\"rk Vk = --( Vk -- Vko) + E ajkgjk(Xj), \nJ \n\nwhere the sum is over all inputs j to the cell k. For our system we obtain the \nthree equations \n\nr ,~  = - (  V, - V~o ) + gt,(x,) + gd,(Xd) + ac,gc,(Xc), (6) \n\n%Ve = - (  Ve - Veo)+g,,(X~), (7) \n\nr,l?, = - (  V, - V,o) + g,,(xs) + g, (xt) + ge,(x,) - g,,(x,). (8) \n\nwhere aci e [ -1 ,  1] and is positive for an excitatory, negative for an inhibitory and \nzero for no input from the cognitive control. \n\nSubstituting in from eqns (1) and (2) \n\nr i V  i = - ( V  i - Vio)+gl i (x t )+gdi{ t .p[ f , (V , )]}+~ci[d4(x t )]  ] \n\n• r~,', = - ( V , -  V~o)+g.~(x,) I . (9) \n\nr,12, = - (  V, - V,o) + gs,(x,) + g,,(x,) + g,,[f,(  V~)J - g,,[f,( V~)] \n\nThese are three equations for the three unknown potentials V~, V~ and V, in terms \nof  the known inputs x, and xt, and represent our mathematical model of  the gate \ncontrol theory of  pain. \n\n3. Results \n\nThe model is analysed in the Appendix. In this section we shall summarise the \nresults of  that analysis and interpret them from the biological point of  view. \n\nThe first result of  biological interest is lemma 5. This says that if steady pain is \nbeing felt and the stimulation of  small fibres is increased slightly without any other \nchanges occurring, then after a short time the pain felt will still be steady and will \nbe at a higher intensity. This accounts for observation (i) of  the introduction. \n\n\n\nG A T E  C O N T R O L  P A I N  T H E O R Y  97 \n\nSecond, lemma 6 states that if no cognitive control is being exerted, steady pain \nis being felt and the stimulation of large fibres is increased slightly without any \nother changes occurring, then after a short time the pain felt will still be steady but \nmay be at a higher or a lower intensity. In the second case it may increase transitorily \nbefore declining to the lower level. Which of  these occurs depends on the details \nof the model and the levels of stimulation of  large and small fibres being considered. \nThe gate control theory can therefore account for various consequences of  an \nincrease in the stimulation of  the large fibres. The possibility of a resulting transitory \nincrease followed by a decrease in pain is interesting in view of observation (ii) of  \nthe introduction. It is also interesting that Nathan & Rudge (1974) found that \nstimulation of large fibres sometimes does and sometimes does not reduce pain \ncaused by small fibres, and used this as an argument against the gate control theory. \nWe have shown here that the theory can easily cope with such findings, but clearly \nmore work needs to be done on the effects of  large fibre stimulation on pain to \nelucidate the details of  the phenomenon. \n\nThird, lemma 7 says that increasing the input from the midbrain (the descending \ninhibitory control) reduces the steady state value of the T-cell potentials. On the \nassumption that the system is at a steady state this implies that any pain felt is \nreduced, and this could account for observation (iii) of  the introduction. \n\nFourth, lemma 8 says that switching on an inhibitory (or excitatory) cognitive \ncontrol reduces (or increases) the steady state T-cell potentials. Again assuming \nthat the system is at a steady state this implies that any pain felt is reduced (or \nincreased), and this could account for observations (iv) and (v) of the introduction. \n\nThe mathematical analysis raises the intriguing possibility of oscillatory solutions \nof  the equations (see the remark after lemma 4). If such a solution occurs, then the \npotential 11', of  the T-cells oscillates, so that any pain increases and decreases \nrhythmically. Could this be the origin of throbbing and other rhythmic pain? If  so, \nthe model predicts that, assuming there is no change in the descending controls, \nthe transition from steady pain to rhythmic pain can only be made by a sudden \nchange in the firing frequencies in the large or small fibres. It would be interesting \nif this prediction could be tested experimentally. \n\n4. Discussion \n\nThe mathematical model of  the gate control theory of  pain proposed in this paper \n(and hence the gate control theory itself) can account for all the observations on \nacute pain in humans which are presented in the introduction. One of  the purposes \nof setting up a mathematical model was to demonstrate this (if possible). However \nthere are other purposes which are just as, if not more, important. \n\nFirst, a mathematical model may point up misconceptions on the consequences \nof  the gate control theory which have arisen. This seems to be the case on the \nquestion of  the effects of  stimulation of  large fibres when pain is present, where it \nhas been assumed that the gate control theory predicts that pair  will ultimately \nalways be reduced. In fact the theory allows either augmentation or reduction \n(possibly preceded by transient augmentation), depending on the details of  the \n\n\n\n98 N .  F.  B R I T T O N  A N D  S.  M .  S K E V I N G T O N  \n\nmodel and the initial firing frequencies in the large and small fibres. This demolishes \none of the arguments against the theory but of course raises many questions which \nneed to be investigated experimentally. The reason for the equivocal findings is that \nthere are two opposing effects at work. One is the direct stimulation of T-cells by \nlarge afferent fibres, which tends to raise T-cell potential, and hence to increase \npain. The second is stimulation of the inhibitory SG cells, which tends indirectly \nto lower T-cell potential, and hence to decrease pain, and which may be a slower \neffect. The final result depends on the relative magnitudes of these two effects and \nthis may depend on the initial potentials in the various cells of the system. \n\nSecond, the analysis of a mathematical model may suggest explanations for \nphenomena previously unexplained by the gate control theory. Thus we have \nsuggested that rhythmic pain may be the result of an oscillation of potentials in \nT-cells and inhibitory SG cells. The proposed mechanism is as follows: \n\n(a) High T-cell potentials imply a high frequency of signals to the brain, activating \na descending control mechanism. \n\n(b) This increases the potential in the inhibitory SG cells, resulting in an increased \nfiring rate in these cells. \n\n(c) This lowers the T-cell potentials, thus reducing the frequency of signals to \nthe brain and deactivating the descending control. \n\n(d) Finally this allows the inhibitory SG potential to fall and therefore the T-cell \npotential to rise. \n\nThis cycle is then repeated, and results in rhythmic pain as the T-cell potential and \nthus the T-cell firing rate rises and falls. \n\nIt must be emphasised that we are concerned here only with the fact that the \nT-cell potential, and hence the pain, is oscillating periodically. Depending on the \nfrequency of these oscillations and the magnitude of the potentials, such pain could \nbe characterised as flickering, quivering, pulsing, throbbing, beating, or pounding. \nThese words describing temporal qualities of pain are found in the McGill Pain \nQuestionnaire (Melzack, 1975). Other sensory aspects of the pain and its affective \nand evaluative properties are not considered, and indeed it is a shortcoming of the \ngate control theory that it does not seem to be able to explain such differences in \npain. However the ability to explain these temporal qualities of pain is a property \nof the gate control theory which has not been recognised before, and which is \nextremely important in view of the number of patients suffering from clinical pain \nsyndromes who experience such l~ain. In a study by Dubuisson & Melzack (1976), \n35 out of 58 patients suffering from arthritic pain, disc disease pain, toothache, \ncancer pain, phantom limb pain and post-herpetic pain reported rhythmicity, a \nproportion of over 60%. However our model was set up as a model of acute pain \nwhereas most of these patients were suffering from chronic pain. We return to this \npoint below. \n\nThird, a mathematical model may make predictions which can be tested experi- \nmentally. Here we state that, assuming descending controls do not change, rhythmic \npain cannot arise from steady pain by a slow increase in firing frequencies in \nlarge and small fibres; it must occur as a result of sudden changes in the firing \nfrequencies. \n\n\n\nG A T E  C O N T R O L  P A I N  T H E O R Y  99 \n\nThe fourth and most important reason for setting up a mathematical model of \nacute pain is to provide an explanation for or at least a basis for extension to theories \nof neuropathies and chronic pain, which are of course clinically far more important \nthan acute pain. In certain cases chronic pain persists long after the injury producing \nit has healed. There are three possible explanations for this. First, it could be that \nchronic pain is associated with plastic changes in the nervous system. Second, it \ncould be that psychological factors result in the cognitive control being more \nexcitatory (or less inhibitory) than would otherwise be the case. Third, it could be \nthat one input into the control system (i.e. one value for the firing frequencies in \neach of the large and the small fibres) could result in more than one possible output \nfrom the T-cells, depending on the history of the system. Thus an input which before \ninjury had resulted in no pain could after injury result in considerable pain. \nMathematically this corresponds to two solutions of the differential equations, and \nwe have shown that the only way this can happen in our model is if one of the \nsolutions is oscillatory, reminding us of the reverberatory circuits put forward as a \ntheory of chronic pain by Livingston (1943). In this case it can be shown that the \nT-cell potential is sometimes higher and sometimes lower than in the steady state, \nso that if the steady state is a painless state then the oscillatory state must be painless \nat least in part of its cycle, but could result in pain appearing and disappearing \nperiodically. Such pain could be treated by a temporary local anaesthetic. The T-cell \npotential would then be reset from the oscillatory solution to zero, a steady solution \nof  the differential equations, while the anaesthetic was working, and would remain in \na painless steady state rather than the painful oscillatory state when the anaesthetic \nwore off. It is often the case in clinical pain syndromes that temporary anaesthetisa- \ntion produces prolonged relief of  pain, e.g. Livingston (1943) and Bonica (1984). \nA question which arises from our analysis is whether this is more likely to happen \nwhen the pain is rhythmic. If  so, our analysis leading directly from the gate control \ntheory provides a possible explanation for the effectiveness of  the treatment. This \nkind of mechanism has been hinted at before. To quote from Bonica (1984), \"it has \nbeen suggested that to block off sensory input for several hours stops the self- \nsustaining activity of  the neuron pools in the neuraxis which may be responsible \nfor some chronic pain states\". Treatment by temporary local anaesthetic may be \nadvantageous for any rhythmic pain, even when the pain does not appear and \ndisappear periodically. However, in this case we would expect the treatment to \nresult in steady pain more intense than that at the low point of the cycle but less \nintense than at the high point. This may be more bearable than the original pain. \nWe illustrate this diagrammatically in Fig. 2. \n\nHowever, chronic pain is not always rhythmic, and therefore this mechanism \ncannot be the only way it can be produced. It seems certain that both psychological \nfactors and plasticity of the nervous system have a role to play. Psychological factors \nhave been incorporated into our model but plastic changes have not. This would \ninvolve progressive changes in some of the parameters of the system, possibly to \nsimulate the unmasking of  normally ineffective synapses in the spinal cord in the \nevent of damage (Wall, 1984). Clearly more work needs to be done in this important \narea. \n\n\n\n100 N. F. B R I T T O N  A N D  S. M. S K E V I N G T O N  \n\n(a) \n\n(b) \n\nTime \n\nFIG. 2. The results of  a temporary local anaesthetic in the case of rhythmic pain. ( ~ )  indicates the \ntime course of  the T-cell potential (corresponding roughly to pain intensity), when the pain is rhythmic, \nand ( ) the potential after a temporary local anaesthetic has worn off. (- - -)  represent possible levels \nabove which pain is felt. In (a), pain is relieved completely, whereas in (b) its intensity is reduced from \nits maximum previous intensity, possibly making it easier to bear. \n\nLet us therefore summarise our main results. First, the gate control theory can \nexplain many observations on acute pain. It does not imply that increased stimulation \nof the large fibres of  the skin always results in a reduction in pain. It can explain \nrhythmicity in pain, and our analysis suggests a possible experiment to test this \nexplanation. It also suggests that a possible treatment to alleviate or cure rhythmic \npain is a temporary local anaesthetic. Finally, we point out that to obtain a theory \nof  chronic pain the gate control theory will have to be augmented by a theory \ndescribing plastic changes in the nervous system. \n\nREFERENCES \n\nAN DER HEIDEN, U. (1980). Analysis of Neural Networks, Lecture Notes in Biomaths. 35. Berlin: \nSpringer-Verlag. \n\nBEECHER, H. K. (1959). Measurement of subjective responses. New York: Oxford University Press. \nBISHOP, G. H. (1959). 3\". Nero. Ment. Dis. 128, 89-114. \nBONICA, J. J. (1984). In: Textbook of Pain (Wall, P. D. & Melzack, R., eds.) p. 541. Edinburgh: Churchill \n\nLivingstone. \nCHAPMAN, C. R., WILSON, M. E. • GEHRIG, J. D. (1976). Pain 2, 265-283. \nDUBUISSON, D. & MELZACK, R. (1976). Expl. Neurol. 51, 480-487. \nFIELDS, H. L. & BASBAUM, A. I. (1984). In: Textbook of Pain (Wall, P. D. & Melzack, R., eds.) p. 142. \n\nEdinburgh: Churchill Livingstone. \nFOERSTER, O. (1927). Die Leimngsbahnen des Schmerzgefiihls. Vienna: Urban und Schwar-zenburg. \nGOLDSCHEIDER, A. (1894). Uber den Schmerz in Physiologischer und Klinischer Hinsicht. Berlin: \n\nHirschwald. \n\n\n\nGATE C O N T R O L  PAIN T H E O RY  101 \n\nHALL, K. R. L. & STRIDE, E. (1954). Br. Z Med. Psychol. 27, 48-60. \nHALLIN, R. G. & TOREBJ6RK, H. E. (1973). Exp. Brain Res. 16, 309-320. \nHEAD, H. (1920). Studies in Neurology. London: Kegan Paul. \nHOSOBUCHI, Y., ADAMS, J. E. & RUTKIN, B. (1977). Science, N.Y. 197, 183-186. \nLEWIS, T. (1942). Pain. New York: Macmillan. \nLIVINGSTON, W. K. (1943). Pain Mechanisms. New York: Macmillan. \nMELZACK, R. (1975). Pain 1, 277-299. \nMELZACK, R. & WALL, P. D. (1965). Science, N.Y. 150, 971-979. \nMELZACK, R. 8¢ WALL, P. D. (1982). The Challenge of Pain. Harmondsworth, Middlesex: Penguin. \nMELZACK, R., WALL, P. D. & ZY, T. C. (1982). Pain 14, 33-43. \nNATHAN, P. W. (1976). Brain 99, 123-158. \nNATHAN, P. W. & RUDGE, P. (1974). J. Neurol. Neurosurg. Psych. 37, 1366-1372. \nNOORDENBOS, W. (1959). Pain. Amsterdam: Elsevier Press. \nOTTOSON, D. (1983). Physiology of the Nervous System. London; Basingstoke: Macmillan. \nSINCLAIR, D. C. (1955). Brain 78, 584-614. \nVAN HEES, J. & GYt3ELS, J. M. (1972). Brain Res., Amsterdam 48, 397-400. \nVON FREY, M. (1894). Bet. Kgl. Siichs. Ges. Wiss. 46, 185. \nWALL, P. D. (1984). In: Textbook of Pain (Wall, P. D. & Melzack, R., eds.) p. 85. Edinburgh: Churchill \n\nLivingstone. \nWALL, P. D. ~,~ SWEET, W. H. (1967). Science, N.Y. 155, 108-109. \nWEDDELL, G. (1955). A. Rev. Psychol. 6, 119-136. \nWILLIS, W. D. (1985). The Pain System. Basel: Karger. \nWILLIS, W. D. t~ COGGESHALL, R. E. (1978). Sensory Mechanisms of the Spinal Cord. New York; \n\nLondon: Plenum Press. \nWILSON, H. R. & COWAN, J. D. (1972). Biophys. J. 12, 1-24. \n\nAPPENDIX \n\nAnalysis of the Model \n\nWe consider the eqns (9) for the unknown potentials V~, Ve and t/, in terms of  \nthe known inputs xs and x~, namely \n\nr,V,- = - (  V~ - V~0) + gt,(x,) + ga,{~0Ef,( V,)]} + ac,gc,[tb(x,)], \n\n7e('e = - ( v e -  Veo)+ g,e(X~), \n\n7,(', = - ( V ~ -  V,o)+ gs,(xs)+ g,(xt)+ get[fe( V~)]-g,,[f,( V~)], \n\nwhere ac~ c [ - l ,  1 ]. In this appendix we prove or indicate the proof of several results \non this system which are necessary for the discussion of the model in the body of  \nthe paper. We shall always assume the following hypotheses. \n\n(F) The functions f~, fe and f, which we shall take for simplicity to be in CI(R, R ÷) \nare zero for values of  their arguments below a certain threshold and strictly \nmonotone increasing above that threshold. \n\n(G) The functions gjk for any suffices j and k are bounded strictly monotone \nincreasing functions in C~(R +, R ÷) satisfying gjk(O) ---- O. \n\n(H) The functions q~ and 0 are strictly monotone increasing functions in \nCI(R ÷, R ÷) satisfying ~0(0) = 0, tb(0) = 0. \n\nLEMMA 1. Solutions of  system (9) with bounded initial conditions are bounded. \n\nProof. Since the gjk are bounded functions it is immediate that the set \n{(V~, Ve, V , ) ] - ~ <  V~< ~ , - ' ~ e  < Ve< IT\"e,- V, < V <  ~'~} is positively invariant for \nany V~, V~, V, sufficiently large, and the result follows. \n\n\n\n102  N . F .  B R I T T O N  A N D  S. M. S K E V I N G T O N  \n\nLEMMA 2. For given xt. xs and aci the system (9) has a unique steady state \n( VT, V*, V*). \n\nProof. Clearly V* is given uniquely by V* = Veo+g,e(Xs), SO it remains to satisfy \n\nV/-  gd,{q~[f,( Vt)]} = V~o+ gt,(x,) + ac,gc,[O(x,)], (A1) \n\ng,t[f~(V~)]+ E = V,o+g.,(x~)+g,(xt)+ge,{fe[V~o+g~,(xs)]}. (A2) \n\nLet us define G~ by G~(E)  = gd,{q~[ft(E)]}. G2 by G2(E)  = g, ,[f i(E)] ,  c, by \n\nc~(xt; a~,) = V~o+ g~,(xt) + a~gc,[~(xt)], (A3) \n\nand c2 by \n\nc2(xl, x.)= Vto+g.,(Xs)+gtt(Xt)+g.,{f~[Veo+gse(Xs)]}. (A4) \n\nThen the equations become \n\nE - G,(1/,) = c,, (A5) \n\nG2(V~) + I/, = c2. (A6) \n\nUsing the monotonicity, boundedness, and threshold properties in (F), (G) and (H) \nthen G~ and G2 are monotone increasing bounded functions, with thresholds below \nwhich they are zero. Thus for fixed xs and x~ the first of  these equations gives V~ as \nan increasing function V, such that V~ tends to a constant as V,-> co and V~ is \nconstant for V, < V,.,hr, and the second gives V, as a decreasing function of  V~ such \nthat Vt tends to a constant as V~-->co and I/, is constant for V~< V~,,h, (see Fig. 3). \nThis is sufficient for the existence and uniqueness of a steady state solution. \n\n[•ftthr \n\nVi, thr V,. \n\nFIG. 3. The graphs of eqns (A5) and (A6). The intersection represents the unique steady state of the \nmodel. \n\nvt \n\n\n\nG A T E  C O N T R O L  P A I N  T H E O R Y  103 \n\nLEMMA 3. The unique steady state is asymptotically stable. \n\nProof. T h e  eigenvalue equation is given by \n\nwhere prime denotes differentiation and an asterisk denotes evaluation at the steady \nstate. By the monotonicity properties G~*G'2 ~ > 0 so that the eigenvalues all have \nnegative real part  and the steady state is asymptotically stable. \n\nLEMMA 4. Any solution of eqns (9) with bounded initial conditions either is or \ntends to the steady state solution or is or tends to a periodic solution. \n\nProof. The  second of eqns (9) implies that Ve--> V* as t--,oo, so the system \nis essentially two-dimensional.  The results then follows from lemma 1 and the \nPoincar6-Bendixson theorem. \n\nR e m a r k  A limit cycle solution exists if the functions in eqns (9) are chosen \nappropriately.  Then if the system (9) is in a steady state and xt and xs are varied \nslowly, it remains in a steady state, by lemma 3. However if xs or xt are varied \nquickly it is possible that the system may tend to the limit cycle solution. \n\nLEMMA 5. I f  the system (9) is in a steady state with V, = V* and x~ is increased \nslightly from x* to x** while keeping xt and aci fixed, then it tends to a steady state \nwith V, = V**>  V*. \n\nNotation. We shall use an asterisk to denote evaluation at the original steady \nstate, a double asterisk to denote evaluation at the new steady state, 8V* = V** - V* \nand similar expressions for other variables, and a dagger to denote evaluation at \nsome point between the two steady states, so that for example G't t denotes G'~(vt) ,  \nwhere V~ ~ (V*, V**). \n\nProof. The first part of  the statement follows from lemma 3 and the continuity \nproperties of  the system. For the second, from eqns (A5) and (A6) we have \n\nv, - G~(v,*)  = c*,  \n\nG2(v ,* )  + v,* = c*,  \n\nv * *  - G I ( v * * )  = c,**, \n\nG2( V * * ) +  V** = c**. \n\nHence, using the mean value theorem for GI and G2 \n\naV* G't:~\" * ac*, - -  I u V t  = \n\nG~to , 2 o Vi + a V* = ac*, \n\naC *2 -- ot2ttSc *l (A7) \na v * -  \n\n1 + r : t t  r-2Jr \n\nNow G'l* and G~ t are non-negative, and from eqns (A3) and (A4), 8c* = 0  and \nt~c* > 0. It follows that t~V* > 0 as required. \n\n\n\n104 N . F .  B R I T T O N  A N D  S. M .  S K E V I N G T O N  \n\nLEMMA 6. I f  the system (9) with aci = 0 is in a steady state with V, = V* and x, \nis increased slightly from x* to x** while keeping x~ and aci fixed, then it tends to \na new steady state with 1/, = V**, where V** may be greater than or less than V* \ndepending on the properties of  G2 and the parameter  values considered; in fact \n\nsgn 3 V* = sgn [(g** - g*) - G'*(g** - g*)]. (A8) \n\nMoreover,  if 3 V * < O  and r,<< ri, then V, initially increases transitorily before \ndecreasing. \n\nProof. The first part of  the statement follows from lemma 3 and the continuity \nproperties of  the system. For the second, the eqn (A7) still holds, where \n\n6e* = g , ( x ** )  - g, (x*) > 0, \n\n~c* = g , ( x * * )  - g , ( x * )  > O, \n\nso that ~V* = [ ( g * * - g * ) -  G ~ * ( g * * - g * ) ] / ( 1  + G'I*G'2*) and the result follows. \nFinally, if r, << ri, then V, can respond to changes much more quickly than V,, so \nthat V, increases from V* to V*+ 8c* before decreasing to V**. \n\nRemark.  I f  V* and V** are both below the threshold value V~.,hr, then G2(V~) = 0 \nfor all V~e(V*, V**) so that G~*=0. Thus in this case 8 V * > O .  This does not \nnecessarily imply an increase in pain since V* and V** may both be below V,,,h,. \nIf  V* and V** are both above V~,,hr, then G~,*(V~) > 0, and the sign of ~V* may be \npositive or negative. Two limiting cases are of  interest. The first is if g * * - g *  is \nmuch greater than g** - g*, when ~V* > 0, and the other is if g** - g* is much less \nthan g~**-g*,  when 8 V * < 0 .  The behaviour  may be different for different ranges \nof  xl (or of  x~); this depends on the details of  the model. \n\nLEMMA 7. I f  the system (9) has a steady state with V, = V* and the function go \nis replaced by ff satisfying i f ( x ) >  q0(x) for any x ~ R ÷, then the new system has a \nsteady state with V, = V**-< V*. The inequality is strict if V* is above the threshold \nvalue for V,. \n\nProof. Define (~ by (~  = gai ° ~ ° f,, then we have \n\nv*- G~(v*) = c* \n\nG2(v,*) + v,* = c*, \n\nv,** - ~ , ( v * * )  = c** = c*, \n\nG d  v**)  + v**  = c~** = c*, \n\nso that \n\nv**  - G, (V**)  = c* - [ ~ , ( v , * * )  - G,(  V,**)]. \n\nHence, using the mean value theorem for G1 and G2, and solving for 8V* as in \nthe proof  of  lemma 5, \n\na v *  = G ~ * ( G * * -  G**) \nt t  i t  \n\n1 + ( ; 2  Gl \n\nand the result follows. \n\n\n\nG A T E  C O N T R O L  P A I N  T H E O R Y  105 \n\nLEMMA 8. I f  the system (9) has a s teady  state with Vt = V* when c~ci = 0, then it \nhas a s t eady  state with Vt = V * * -  V* when  ac~ = 1, and  with Vt = V** >- V* when  \nac~ = - 1 ,  for  fixed va lues  o f  x~ and  x~. The  inequa l i t i es  are  str ict  if  e i ther  V* or  V** \nis above  the th re sho ld  va lue  for  V~. \n\nProof. From eqn (A3) 6c* = gc~[~(x*)] > 0 in the first case and  ~c* = -gc~[~(x*)]  < \n0 in the second  case, and  f rom eqn (A4) 6c* = 0, so the result  fo l lows f rom eqn \n(A7) and  the m o n o t o n i c i t y  p roper t i e s  o f  G~ and  (32. \n\n\n", "status": 200, "abstract": "The first test which any theory of pain must pass is that it must be able to explain the phenomena observed in acute pain in humans. This criterion is used to test the major theory of pain at present, the gate control theory of Melzack & Wall (1965, 1982). The theory is explicit enough to be cast in mathematical terms, and the mathematical model is shown to explain the observations considered. It also points up a common misconception on the consequences of the theory, and thus demolishes an argument which has been used against it. A hypothesis of the origin of rhythmic pain is then made, and consequent testable predictions given. This is the first time that the gate control theory has been used to explain any quality of pain. It has important consequences for the treatment of such pain. Finally, the applicability of the gate control theory as an explanation for chronic pain is discussed."}