{"metadata": {"Content-Type": "application/pdf", "Creation-Date": "2002-06-05T16:46:40Z", "Last-Modified": "2004-12-10T06:20:43Z", "Last-Save-Date": "2004-12-10T06:20:43Z", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.pdf.PDFParser"], "X-TIKA:content_handler": "ToTextContentHandler", "X-TIKA:embedded_depth": "0", "X-TIKA:parse_time_millis": "64", "access_permission:assemble_document": "true", "access_permission:can_modify": "true", "access_permission:can_print": "true", "access_permission:can_print_degraded": "true", "access_permission:extract_content": "true", "access_permission:extract_for_accessibility": "true", "access_permission:fill_in_form": "true", "access_permission:modify_annotations": "true", "created": "2002-06-05T16:46:40Z", "date": "2004-12-10T06:20:43Z", "dc:format": "application/pdf; version=1.3", "dc:title": "Categorization and Analysis of Pain and Activity in Patients with Low Back Pain Using a Neural Network Technique", "dcterms:created": "2002-06-05T16:46:40Z", "dcterms:modified": "2004-12-10T06:20:43Z", "meta:creation-date": "2002-06-05T16:46:40Z", "meta:save-date": "2004-12-10T06:20:43Z", "modified": "2004-12-10T06:20:43Z", "pdf:PDFVersion": "1.3", "pdf:charsPerPage": ["2217", "3014", "1126", "2641", "644", "3179", "1752", "2133", "3121", "2739", "1567"], "pdf:docinfo:created": "2002-06-05T16:46:40Z", "pdf:docinfo:modified": "2004-12-10T06:20:43Z", "pdf:docinfo:producer": "Acrobat Distiller 3.0 for Power Macintosh", "pdf:docinfo:title": "Categorization and Analysis of Pain and Activity in Patients with Low Back Pain Using a Neural Network Technique", "pdf:encrypted": "false", "pdf:hasMarkedContent": "false", "pdf:hasXFA": "false", "pdf:hasXMP": "false", "pdf:unmappedUnicodeCharsPerPage": ["2", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "producer": "Acrobat Distiller 3.0 for Power Macintosh", "resourceName": "b'46.pdf'", "title": "Categorization and Analysis of Pain and Activity in Patients with Low Back Pain Using a Neural Network Technique", "xmpTPg:NPages": "11"}, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCategorization and Analysis of Pain and Activity in Patients with Low Back Pain Using a Neural Network Technique\n\n\nP1: GDP\n\nJournal of Medical Systems [joms] pp472-joms-372297 June 4, 2002 14:9 Style file version June 5th, 2002\n\nJournal of Medical Systems, Vol. 26, No. 4, August 2002 ( C© 2002)\n\nCategorization and Analysis of Pain and Activity\nin Patients With Low Back Pain Using a Neural\nNetwork Technique\n\nJohn J. Liszka-Hackzell1,3 and David P. Martin2\n\nLow back pain represents a significant medical problem, both in its prevalence and\nits cost to society. Most episodes of acute low back pain resolve without significant\nlong-term functional impact. However, a minority of patients experience extended\nchronic pain and disability. In this paper, we have explored new techniques of patient\nassessment that may prospectively identify this minority of patients at risk of developing\npoor outcomes. We studied 15 patients with acute low back pain and 25 patients with\nchronic low back pain over 4 month’s time. Patients monitored their pain and activity\nlevels continuously over the first 3 weeks. Pain and functional status were assessed\nat baseline and at 3 weeks following enrollment. Follow-up assessment of functional\nstatus and progress were performed at 2 and 4 months. The pain and activity levels\nwere categorized using a self-organizing-map neural network. A back-propagation\nneural network was trained with the categorization and outcome data. There was a\ngood correlation between the true and predicted values for general health (r = 0.96,\np < 0.01) and mental health (r = 0.80, p < 0.01). No significant correlation was found\nif activity and pain data were not entered into the analysis. Our results show that neural\nnetwork techniques can be applied effectively to categorizing patients with acute and\nchronic low back pain. It is our hope that future research will allow these categorizations\nto be tied to prognostic and therapeutic decisions in patients who present with episodes\nof back pain.\n\nKEY WORDS: low back pain; pain diary; artificial intelligence; pain measurement; neural networks.\n\nINTRODUCTION\n\nLow back pain represents a significant medical problem, both in its prevalence\nand its cost to society. Most episodes of back pain respond adequately to conser-\nvative therapy, but some patients will continue to suffer chronic back pain for long\nperiods, incurring significant medical expenses and absence from work.(1–3) Since\n\n1Department of Anesthesiology, Orebro Medical Center Hospital, S-701 85 Orebro, Sweden.\n2Department of Anesthesiology, Mayo Clinic and Mayo Foundation, Rochester, Minnesota 55905.\n3To whom correspondence should be addressed.\n\n337\n\n0148-5598/02/0800-0337/0 C© 2002 Plenum Publishing Corporation\n\n\n\nP1: GDP\n\nJournal of Medical Systems [joms] pp472-joms-372297 June 4, 2002 14:9 Style file version June 5th, 2002\n\n338 Liszka-Hackzell and Martin\n\nmost patients will respond favorably to conservative measures, aggressive steps are\nnot indicated early in an episode of back pain. However, it is speculated that early\naggressive therapy may be beneficial for the minority of patients who do not improve\nwith conservative therapy. This presents a dilemma because it is difficult to predict\nwhich patients are destined not to improve with conservative measures. In this paper,\nwe have explored new techniques of patient assessment that may have prognostic\nvalue in this group of patients.\n\nPain is inherently a subjective experience and therefore cannot be objectively\nmeasured and analyzed. Nevertheless, we may be able to determine more information\nfrom patients by using a new technology in assessing symptoms continuously over\ntime, and by using new mathematical techniques to analyze the data. In this paper,\nwe have used an electronic symptom diary and activity meter to assess patients\ncontinuously. Neural network mathematical techniques have been applied to the\ndata to categorize the history of the pain and activity levels.\n\nVery little has been done on categorization of pain and activity levels in patients\nwith back pain. Categorization of these variables may provide different pain and\nactivity patterns that may contain information related to prognosis or outcome for\nthe individual patient. Pain intensity level data are difficult to process and analyze\nsince the measurements are highly subjective. It may therefore be more reasonable\nto study patterns rather than absolute levels. Also, by using artificial intelligence (AI)\ntechniques, the chances of extracting important information may be facilitated.\n\nNeural networks(4,5) and especially self-organizing map neural networks(6) are\npowerful tools when working with categorization problems. By using neural net-\nworks, a statistical model may be easily developed from experimental data. The\nknowledge in the model is a product of the learning process that the network under-\ngoes while training data is presented to it and the network properties are adjusted.\n\nIn this study, we have used the wavelet transform to process the activity level data\nprior to subjecting it to the neural network categorization process. This is necessary\nsince the characteristics of the two variables are very different. The pain levels are\nsampled on average every 90 min, and have predominantly low frequency content.\nThe activity levels are sampled as counts (pulses) every 1 min. By using a wavelet\nfiltering technique, the activity levels are processed to allow accurate analysis of the\ntwo variables together.\n\nIn addition to the pain and activity level data, we also collected pain status data\nusing the McGill Pain Questionnaire (MPQ),(7) functional status from the SF-36\nquestionnaire(8) and a progress score at various times during the study period. The\npain and activity level category data were then used together with the MPQ data,\nthe SF-36 data and progress scores to train a back-propagation neural network. This\nback-propagation neural network was then used to make predictions about patient’s\nprogress at 2 months and 4 months as well as their functional status at 4 months.\n\nMETHODS\n\nThe protocol was reviewed and approved by the Institutional Review Board.\nWe studied 15 patients with acute low back pain (<6 months) from both the Urgent\nCare Center and Emergency Department. Another 25 patients with chronic low back\n\n\n\nP1: GDP\n\nJournal of Medical Systems [joms] pp472-joms-372297 June 4, 2002 14:9 Style file version June 5th, 2002\n\nPain and Neural Network Technique 339\n\nTable I. Inclusion Criteria\n\nChronic low back pain Acute low back pain\n\nLow back pain >6 months Acute onset low back pain\nAge 18–75 No history of spine surgery\nEnglish speaking No previous episode within the last year\nAble to consent Age 18–75\nAble to use pain diary English speaking\n\nAble to consent\nAble to use pain diary\n\npain (>6 months) were studied from the Spine Center. The patients were between\nthe ages of 18 and 75. The inclusion criteria are listed in Table I.\n\nAll patients were interviewed by a nurse coordinator to confirm eligibility. Dur-\ning the initial meeting the data collection procedure was explained. An initial func-\ntional status was obtained using the SF-36 questionnaire (SF-36-1) as well as a pain\nstatus using the McGill Pain Questionnaire (MPQ1). Each patient was asked to mon-\nitor his or her pain and activity levels continuously during a period of 3 weeks. Pain\nlevels were recorded every 90 min between 8 A.M. and 10 P.M. (0800–2200) using an\nelectronic diary.\n\nThe Electronic Symptom Diary is a pager-sized device developed at Mayo Clinic\nfor collecting symptoms from patients over time (Fig. 1). Patients were instructed to\n\nFig. 1. The Mayo Clinic Electronic Symptom Diary.\n\n\n\nP1: GDP\n\nJournal of Medical Systems [joms] pp472-joms-372297 June 4, 2002 14:9 Style file version June 5th, 2002\n\n340 Liszka-Hackzell and Martin\n\nTable II. Description of the Progress Score (PS) Used in\nThis Studya\n\nProgress score Description\n\n3 Complete improvement\n2 Significant improvement\n1 Some improvement\n0 No change\n−1 Some deterioration\n−2 Significant deterioration\n−3 Complete deterioration\n\naPatients were asked to quantify how their back pain was\ncompared to when they initially enrolled in the study.\n\nquantify their pain using a numerical rating scale, and enter the value by pressing one\nof the buttons labeled from 0 to 10, where 0 is no pain and 10 is the worst possible\npain. Their entry was stored in the device along with the corresponding date and\ntime. Patients were prompted by the diary to enter the scheduled measurements,\nbut could also enter measurements at any time. They were encouraged to enter\nadditional measurements as often as they wanted, emphasizing the importance of\nrecording symptoms at their peak and nadir as well as intermediate values. At the\nend of the session, the data were downloaded for analysis.\n\nActivity levels were monitored using an AW-64 Actiwatch (Mini-Mitter Inc.).\nThe Actiwatch passively measures activity,(9,10) and patients were asked to wear it\ncontinuously on their nondominant arm for the duration of the study. The activity\nwas sampled as accumulated counts every minute. The patients were contacted by\ntelephone on the second and tenth day of the study to provide an opportunity for\nfurther patient information. At the end of the 3-week pain and activity level data\ncollection, the patients were again called over the telephone and asked to return their\nequipment. At that time, they were also asked to provide a progress score (PS1) as\nwell as a second McGill Pain Questionnaire (MPQ2). The progress score was defined\naccording to Table II.\n\nPatients were again contacted at 2 months time when they were asked for a\nsecond progress score (PS2). Finally, patients were asked to complete a second func-\ntional status using the SF-36 (SF-36-2) at 4 months time. At this time the study was\ncompleted. Figure 2 shows the data collection sequence.\n\nThe time series were compared for each 0800–2200 period to assure that both\ntime series were complete. Only the data collected between 0800 and 2200 each\nday were used for further analysis. Any incomplete time series were discarded. If\nthe activity level time series for a certain day was incomplete, the corresponding\npain level time series was also discarded and vice versa. Any patient who had not\ncollected at least 14 complete time series (14 days) was dropped from the study.\nAlso, the MPQ(7) and SF-36(8) questionnaires were processed according to their\naccompanying guidelines. The progress scores were processed according to Table II.\n\nThe activity level time series were sampled every 1 min. The pain level time\nseries were sampled on average every 90 min. In order to further analyze the two\ntime series, they had to be converted so that they would appear as if they had both\nbeen sampled at the same even intervals. The analysis was performed as outlined\n\n\n\nP1: GDP\n\nJournal of Medical Systems [joms] pp472-joms-372297 June 4, 2002 14:9 Style file version June 5th, 2002\n\nPain and Neural Network Technique 341\n\nFig. 2. The sequence of data collection during the study.\n\nin Fig. 3. The two time series show very different frequency content, not only due\nto different sampling rates, but also due to the different processes producing each\ntime series. Further analysis required the activity level time series to be threshold-\nfiltered using the wavelet transform.(11,12) The activity level readings consist of two\ncomponents: a stochastic component reflecting random activities in each patient,\nand a deterministic component corresponding to the general trend of activity in each\n\nFig. 3. Flowchart of the data analysis sequence.\n\n\n\nP1: GDP\n\nJournal of Medical Systems [joms] pp472-joms-372297 June 4, 2002 14:9 Style file version June 5th, 2002\n\n342 Liszka-Hackzell and Martin\n\npatient. The separation of these two components may be done using threshold filter-\ning. A percentage of the maximum wavelet coefficient magnitude was selected in a\nway such that the maximum kurtosis of the deterministic component was obtained.\nThis way, the maximum deviation from a gaussian amplitude distribution was deter-\nmined, which is the characteristic property of the deterministic component. It was\nfound that a 7% threshold gave the best separation for these data. Simultaneously\nwith the threshold filtering, the signal was also low-pass filtered in the frequency\ndomain. This procedure is probably unique in the way that it reproduces the general\ntrend of the activity data without influencing its level.\n\nIn the filtered activity level time series, every 10th measurement was kept and\na new activity level time series was created. This new activity level time series ap-\npeared as if it was sampled every 10 min. The original pain level time series was\ninterpolated using cubic splines,(13) to appear as if it would have been sampled every\n10 min. The new time series now had equal length and sampling interval. Both time\nseries now consisted of 84 measurements each corresponding to each 0800–2200 in-\nterval. We had to make the assumption that an interpolation of the pain level time\nseries would reflect the change in pain levels outside the collected measurements.\nCollection of pain levels requires the patient to manually enter a measurement into\nthe electronic diary when prompted. To prompt the patients more often than every\n90 min over 3 weeks would likely have negatively affected compliance with the study.\nFrom our own clinical knowledge, we feel that an interpolation with cubic splines\nmost accurately reflects this process.\n\nData from 20 randomly selected patients was used to train a self-organizing\nmap neural network. The self-organizing map consisted of 168 processing elements\n(PE) in the input layer, a 14 × 14 PE Kohonen layer and a 2 PE output layer. The\nneural network software that was used in this study was NWORKS Professional 2\n(NeuralWare Inc.). Recall was then done with the whole group of 40 patients. The\noutput from the self-organizing map showed separation of patients into different\npatterns (Fig. 4). The self-organizing map output from 30 randomly selected patients\ntogether with their corresponding SF-36-1, MPQ1 and MPQ2 as well as PS1 was then\nused as input values for training a back-propagation neural network. The desired out-\nput values during the training sequence were PS2 and PS3 as well as the SF-36-2.\nFinally, recall was done with the trained back-propagation neural network using the\nremaining 10 patients. The back-propagation neural network consisted of 17 PE in\nthe input layer, 27 PE in the hidden layer and 10 PE in the output layer. Correlations\nbetween the true and predicted outputs were calculated. Another back propagation\nneural network was trained using the above data, but without the input from the\nself-organizing map. This was done to investigate the predictive properties of the ac-\ntivity and pain information analyzed in the self-organizing map neural network. This\ninformation was used to compare the complete back-propagation neural network\nmodel with a back-propagation neural network model without the self-organizing\nmap output.\n\nTo ensure that the group of patients selected for training and the group of\npatients selected for recall would accurately reflect the statistical properties of the\nentire group, a test was performed by comparing 10 different randomly selected\ngroups. These 10 groups showed similar statistical properties and distributions and\n\n\n\nP1: GDP\n\nJournal of Medical Systems [joms] pp472-joms-372297 June 4, 2002 14:9 Style file version June 5th, 2002\n\nPain and Neural Network Technique 343\n\nFig. 4. Output from the self-organizing map Kohonen layer. The X and\nY axes show the Kohonen coordinates as presented by the output layer.\nThis example shows measurements of five different patients that map into\ntwo distinct parts of the Kohonen layer.\n\nit was concluded that using one of these groups for recall and the remaining patients\nfor training would be appropriate.\n\nRESULTS\n\nThe average age of the patients that completed the study was 48.4 years. There\nwere 24 males and 16 females. Of the 62 patients that were initially enrolled, 40 pa-\ntients completed the study (15 patients with acute back pain and 25 patients with\nchronic back pain). The number of complete time series (activity and pain) of those\nwho completed the study was on average 17 of 21. The main reason why patients\ndid not complete the study was that it caused inconvenience by requiring too much\ntime and patient effort. The output from the self-organizing map neural network\nshowed separation of different patients into different areas of the Kohonen layer,\nwith some patients showing a larger change during the 3-week activity and pain level\nmeasurements (Fig. 4).\n\nThe output from the back-propagation neural network in the 10-patient test\ngroup during recall showed significant correlations between the true and predicted\nvalues of the SF-36 scores describing general health and mental health. None of the\nother SF-36 or PS scores showed significant correlations. The correlation coefficient\nbetween the true and the predicted SF-36 score for mental health was 0.80 (p < 0.01)\nand between the true and the predicted SF-36 score for general health was 0.96\n(p < 0.01). The scatter-plots are shown in Fig. 5.\n\nIn an attempt to make the same predictions from another back-propagation\nneural network without the activity and pain information from the self-organizing\nmap, we found that correlations became nonsignificant (mental health r = 0.33 and\ngeneral health r = 0.40).\n\n\n\nP1: GDP\n\nJournal of Medical Systems [joms] pp472-joms-372297 June 4, 2002 14:9 Style file version June 5th, 2002\n\n344 Liszka-Hackzell and Martin\n\nFig. 5. Scatter-plots between the true and predicted values of the SF-36 scores describing mental health\n(left) and general health (right).\n\nDISCUSSION\n\nNeural networks are in wide use in many different areas of science and medicine.\nWithin medicine, neural networks have been applied to analysis of medical images,\nmedical signal processing, and clinical and laboratory data.(14) Especially problems\nconcerning pattern recognition and classification have been successfully analyzed\nusing these techniques. Some examples are character recognition, etiology of low\nback disorders, and interpretation of sonar signals from underwater objects.(15–17)\n\nNeural networks have been shown to be superior to both conventional statisti-\ncal methods and manual/specialist-based analysis in many studies. There are many\nbenefits in using neural networks compared to conventional statistical methods.(14)\n\nBy using neural networks, more complex tasks can be learned from examples\nthan by using conventional statistical techniques. Another benefit is that both qualita-\ntive and quantitative data can easily be included in the same model. Neural networks\nperform well in analysis of nonlinear multivariate data. Also, a fully trained neural\nnetwork can be used for further analysis of new data in or close to real-time.\n\nThe disadvantages related to the use of neural networks includes difficulties of\nexpressing their function/knowledge in a simple way. Validating the network results\nmay be more difficult than with conventional statistics.\n\nHedén studied a neural network’s capability to identify acute myocardial in-\nfarction in the 12-lead ECG, and compared it to conventional rule based analysis\nand analysis by an experienced cardiologist.(18) The neural network showed higher\nsensitivity and discriminant power than both the rule based interpretation program\nand the cardiologist.\n\nAnother study by Veselis et al. used neural networks to differentiate similar\nEEG spectra, and compared it to discriminant analysis, visual recognition by the\nexperimenters, and analysis of variance (ANOVA).(19) Discriminant analysis per-\nformed as well as neural networks. Both these methods gave significantly better\nresults than visual recognition by the examiners and ANOVA. Also, in this study, the\nauthors showed that it was not possible to identify some patterns with conventional\n\n\n\nP1: GDP\n\nJournal of Medical Systems [joms] pp472-joms-372297 June 4, 2002 14:9 Style file version June 5th, 2002\n\nPain and Neural Network Technique 345\n\nmethods, but that it was possible to do so using neural networks or discriminant\nanalysis.\n\nBounds used neural networks in the diagnosis of low back disorders.(17) The\nstudy of Bounds was based on a list of symptoms and physical findings obtained from\neach patient in the study at one point in time. The data were then classified as one of\nfour defined diagnoses. Bounds also compared the neural network with other pattern\nrecognition methods such as diagnosis by a group of experts, K-Nearest Neighbor\nand Closest Class Mean. The neural network approach outperformed the clinicians,\nand performed as well as or better than the other pattern recognition techniques.\n\nIn Fast-Fourier Transform (FFT), the analyzed signal is folded using a complex\nsine wave of constant amplitude and varying frequency. That way, the signal is de-\ncomposed into a frequency spectrum. With wavelets,(11) the analyzed signal is folded\nwith a “mother wavelet,” which may have different forms, but is limited in the time\ndomain. A special form of wavelets is the Morlet wavelet, which is a locally peri-\nodic wave-train that is related to windowed Fourier analysis. It is obtained by taking\na complex sine wave and localizing it with a Gaussian (bell-shaped) envelope. An\nadvantage of wavelet analysis is that its resolution varies with the frequency of the\nsignal. The largest difference between the Fourier transform and the Morlet wavelet\nis that there is a constant width window used in the Fourier transform, while the\nwindow width decreases with frequency in the Morlet wavelet.\n\nIn wavelet analysis as compared to Fourier analysis, the frequency in a dynamic\nfrequency spectrum is referred to as the time scale. Rather than a frequency spectrum,\na scalogram with a reversed Y-axis (due to the use of a time scale instead of a\nfrequency scale) is produced by wavelet analysis. The spectral density in the Fourier\nspectrum is comparable to the wavelet coefficient magnitude, the frequency step is\nreferred to as dilation and the time step with which the window is moving becomes\nthe translation.\n\nA valuable property of wavelet analysis is that in addition to conventional fil-\ntering in the frequency domain, it is possible to perform filtering in the domain of\nthe wavelet coefficient magnitude.(12) The simplest form of this filtering technique\nis threshold filtering, where the signal may be decomposed into two parts. One part\ncorresponds to wavelet coefficients above a certain magnitude (threshold) while the\nother part corresponds to wavelet coefficients below the threshold (strong and weak\ncomponent). This procedure is important when working with signals of different\ncharacter, for example, a signal with a stochastic and deterministic component.\n\nIn this study, the output from the self-organizing map indicated that the pain and\nactivity patterns in these patients have different properties. Some patients showed\na more stationary appearance while others showed a pattern that covered a larger\narea of the Kohonen layer. It appears that patients who experienced a small change\nin either their pain or activity levels were more stationary as indicated by the self-\norganizing map output. Different patients also mapped to different geographic areas\nof the Kohonen layer. It would be reasonable to assume that different parts of the\nKohonen layer reflect different properties of the corresponding pain and activity\nlevels. The output from the Kohonen layer was, together with the initial MPQ, SF-36,\nand progress score, used to make predictions about the patient’s 2- and 4 months\nstatus.\n\n\n\nP1: GDP\n\nJournal of Medical Systems [joms] pp472-joms-372297 June 4, 2002 14:9 Style file version June 5th, 2002\n\n346 Liszka-Hackzell and Martin\n\nWe were able to accurately predict the 4-month SF-36 scores describing general\nand mental health using a neural network model trained with activity and pain level\ndata collected during an initial 3-weeks period in combination with initial MPQ,\nSF-36, and Progress scores. Prediction of the general health score (r = 0.96) showed\na higher correlation coefficient than the mental health score (r = 0.80). The general\nhealth score reflects the patient’s perception of their overall health, while the men-\ntal health score describes the patient’s mood. It is not entirely clear why the general\nhealth score was easier to predict than the mental health score. We were unable\nto make predictions of the remaining 4-months SF-36 scores or the progress scores\nat 2 and 4 months. It appears that the activity and pain information processed in\nthe self-organizing map neural network is vital to the predictive performance of the\nback-propagation neural network, since a back-propagation neural network without\ninput from the self-organizing map is unable to provide acceptable predictions.\n\nOne must consider that we have only investigated a small group of patients and\nthat this should be considered a pilot study. At the same time, the results may indicate\nthat there is prognostic information in the input data. It may indirectly suggest that\nback pain affects a patient’s perception of their general or mental health. If one\nwould expect a low predicted general- or mental health estimation in a patient, that\npatient may benefit from a more aggressive management.\n\nThe difficulty to predict the 2- and 4 months progress scores may be explained\nby the fact that the progress score was designed to reflect change. However, one can\nquestion how well a patient can quantify a change over a longer period of time due\nto recall bias. We must conclude that our inability to accurately predict the progress\nscore should have been anticipated and may be impossible due to the characteristics\nof this variable.\n\nIn conclusion, our results show that neural network techniques can be applied\neffectively to categorizing patients with acute and chronic low back pain. It is our\nhope that future research will allow these categorizations to be tied to prognostic\nand therapeutic decisions in patients who present with episodes of back pain.\n\nACKNOWLEDGMENTS\n\nThis study was funded by a grant from Mayo Foundation. The authors thank\nDiane Maxson, RN, Greg Wilson, and Laurie Meade, RN, for their help in recruiting\npatients and collecting data.\n\nREFERENCES\n\n1. Chapman, C. R., and Syrjala, K. L., Bonica’s Management of Pain, 3rd edn., Lippincott Williams and\nWilkins, Baltimore, MD, 2001.\n\n2. Tollison, C. D., Handbook of Chronic Pain Management, Williams and Wilkins, Baltimore, MD,\n1989.\n\n3. Deyo, R. A., and Weinstein, J. N., Low back pain. N. Engl. J. Med. 344:363–370, 2001.\n4. Klimasauskas, K., Neural Computing: A Technology Handbook, NeuralWare Inc., 1993.\n5. Pao, Y. H., Adaptive Pattern Recognition and Neural Networks, Addison-Wesley, Reading, MA, 1989.\n6. Kohonen, T., Self-Organization and Associative Memory, Springer, New York, 1989.\n\n\n\nP1: GDP\n\nJournal of Medical Systems [joms] pp472-joms-372297 June 4, 2002 14:9 Style file version June 5th, 2002\n\nPain and Neural Network Technique 347\n\n7. Melzack, R., The McGill Pain Questionnaire: Major properties and scoring methods. Pain 1:277–299,\n1975.\n\n8. Ware, J. E., SF-36 Physical and Mental Health Summary Scales: A User’s Manual, Quality Metric Inc.,\n1997.\n\n9. Cole, R. J., Automatic sleep/wake identification from wrist activity. Sleep 15(5):461–469, 1992.\n10. Patterson, S. M., Automated physical activity monitoring: Validation and comparison with physio-\n\nlogical and self-report measures. Psychophysiology 30:296–305, 1993.\n11. Chui, C. K., An Introduction to Wavelets, Academic Press, New York, 1992.\n12. Liszka, L., Decomposition of time series. Invited Lecture at the 2nd International Workshop on Arti-\n\nficial Intelligence Applications in Solar-Terrestial Physics, Lund, Sweden, 1997.\n13. Weisstein, E. W., Concise Encyclopedia of Mathematics, CD-ROM, Chapman and Hall/CRCnet Base,\n\n1999.\n14. Forsstrom, J. J., Artificial neural networks for decision support in clinical medicine. Ann. Med. 27:509–\n\n517, 1995.\n15. Gorma, R. P., Analysis of hidden units in a layered network trained to classify sonar targets. Neural\n\nNetw. 1:75–79, 1988.\n16. Rajavelu, A., A neural network approach to character recognition. Neural Netw. 2:387–393, 1989.\n17. Bounds, D. G., A comparison of neural networks and other pattern recognition approaches to the\n\ndiagnosis of low back disorders. Neural Netw. 3:583–591, 1990.\n18. Hedén, B., Acute myocardial infarction detected in the 12-lead ECG by neural networks. Circulation\n\n96:1798–1802, 1997.\n19. Veselis, R. A., Veselis, R. A., Reinsel, R., and Wronski, M., Analytical methods to differentiate similar\n\nEEG spectra: Neural networks and discriminant analysis. J. Clin. Monit. 9:257–267, 1993.\n\n\n", "status": 200, "abstract": "Low back pain represents a signiﬁcant medical problem, both in its prevalence andits cost to society. Most episodes of acute low back pain resolve without signiﬁcantlong-term functional impact. However, a minority of patients experience extendedchronic pain and disability. In this paper, we have explored new techniques of patientassessment that may prospectively identify this minority of patients at risk of developingpoor outcomes. We studied 15 patients with acute low back pain and 25 patients withchronic low back pain over 4 month’s time. Patients monitored their pain and activitylevels continuously over the ﬁrst 3 weeks. Pain and functional status were assessedat baseline and at 3 weeks following enrollment. Follow-up assessment of functionalstatus and progress were performed at 2 and 4 months. The pain and activity levelswere categorized using a self-organizing-map neural network. A back-propagationneural network was trained with the categorization and outcome data. There was agood correlation between the true and predicted values for general health (r = 0.96,p < 0.01) and mental health (r = 0.80, p < 0.01). No signiﬁcant correlation was foundif activity and pain data were not entered into the analysis. Our results show that neuralnetwork techniques can be applied effectively to categorizing patients with acute andchroniclowbackpain.Itisourhopethatfutureresearchwillallowthesecategorizationsto be tied to prognostic and therapeutic decisions in patients who present with episodesof back pain."}