{"metadata": {"Author": "lop", "Content-Type": "application/pdf", "Creation-Date": "2006-01-17T07:35:47Z", "Last-Modified": "2006-01-17T07:38:36Z", "Last-Save-Date": "2006-01-17T07:38:36Z", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.pdf.PDFParser"], "X-TIKA:content_handler": "ToTextContentHandler", "X-TIKA:embedded_depth": "0", "X-TIKA:parse_time_millis": "29", "access_permission:assemble_document": "true", "access_permission:can_modify": "true", "access_permission:can_print": "true", "access_permission:can_print_degraded": "true", "access_permission:extract_content": "true", "access_permission:extract_for_accessibility": "true", "access_permission:fill_in_form": "true", "access_permission:modify_annotations": "true", "created": "2006-01-17T07:35:47Z", "creator": "lop", "date": "2006-01-17T07:38:36Z", "dc:creator": "lop", "dc:format": "application/pdf; version=1.3", "dc:title": "ONLINE-DO00020392.tex", "dcterms:created": "2006-01-17T07:35:47Z", "dcterms:modified": "2006-01-17T07:38:36Z", "meta:author": "lop", "meta:creation-date": "2006-01-17T07:35:47Z", "meta:save-date": "2006-01-17T07:38:36Z", "modified": "2006-01-17T07:38:36Z", "pdf:PDFVersion": "1.3", "pdf:charsPerPage": ["3225", "4716", "3178", "4807"], "pdf:docinfo:created": "2006-01-17T07:35:47Z", "pdf:docinfo:creator": "lop", "pdf:docinfo:creator_tool": "Textures®: LaserWriter 8 Z1-8.7.1", "pdf:docinfo:modified": "2006-01-17T07:38:36Z", "pdf:docinfo:producer": "Acrobat Distiller 7.0 for Macintosh", "pdf:docinfo:title": "ONLINE-DO00020392.tex", "pdf:encrypted": "false", "pdf:hasMarkedContent": "false", "pdf:hasXFA": "false", "pdf:hasXMP": "true", "pdf:unmappedUnicodeCharsPerPage": ["1", "0", "0", "0"], "producer": "Acrobat Distiller 7.0 for Macintosh", "resourceName": "b'47.pdf'", "title": "ONLINE-DO00020392.tex", "xmp:CreatorTool": "Textures®: LaserWriter 8 Z1-8.7.1", "xmpMM:DocumentID": "uuid:7388468a-1002-482b-8e49-b73799ab40d9", "xmpTPg:NPages": "4"}, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nONLINE-DO00020392.tex\n\n\nJournal of Clinical Monitoring and Computing (2005) 19: 411–414\n\nDOI: 10.1007/s10877-005-0392-8 C© Springer 2006\n\nANALYSIS OF NIGHTTIME ACTIVITY AND DAYTIME\nPAIN IN PATIENTS WITH CHRONIC BACK PAIN\nUSING A SELF-ORGANIZING MAP NEURAL\nNETWORK\nJohn J. Liszka-Hackzell, MD, PhD1 and David P. Martin,\nMD, PhD2\n\nFrom the 1University of Arizona, Department of Anesthesiology,\n1501 N. Campbell Ave., Tucson, AZ 85724, 2Mayo Clinic Col-\nlege of Medicine, Department of Anesthesiology, 200 1st Street SW,\nRochester, MN 55905.\n\nReceived April 6 2005. Accepted for publication June 22 2005.\n\nAddress correspondence to John J. Liszka-Hackzell, University of\nArizona, Department of Anesthesiology, 1501 N. Campbell Ave.,\nTucson, AZ 85724 USA.\nE-mail: hackzell@u.arizona.edu\n\nLiszka-Hackzell JJ, Martin DP. Analysis of nighttime activity and daytime\n\npain in patients with chronic back pain using a self-organizing map neural\n\nnetwork.\n\nJ Clin Monit Comput 2005; 19: 411–414\n\nABSTRACT. There may be a relationship between sleep and\npain in patients with chronic back pain. We collected day-\ntime pain and nighttime activity data from 18 patients diagnosed\nwith chronic back pain. The patients were followed for 6 days\nand 5 nights. Pain levels were collected every 90 min between\n0800 hours and 2200 hours using a computerized electronic di-\nary. Activity levels were collected using a wrist accelerometer\n(Actiwatch AW-64). The Actiwatch sampled activity counts ev-\nery 1 min. Patients were asked to wear the Actiwatch on their\nnon-dominant arm.\n\nThe pain level measurements were interpolated using cu-\nbic splines. A mean pain level was calculated for each period\n0800 hours to 2200 hours as well as for the 6-day period. The\ndifference between the mean pain levels for the 6-day period and\neach 0800 hours to 2200 hours period was calculated for each pa-\ntient. Nighttime activity data were analyzed using the Actiwatch\nSleep Analysis software.\n\nCorrelations were calculated between the Actiwatch Sleep\nAnalysis variables and the mean pain level differences for each\npatient and period. The correlation analysis was performed with\nSPSS 7.5. We were unable to show any significant relationships.\n\nA different approach to analyze the data was used. A Self-\nOrganizing Map (SOM) Neural Network was trained using the\noriginal nighttime activity level time series from 10 randomly se-\nlected patients. Recall was then performed on all the activity level\ndata. Correlations were calculated between the pain level vari-\nance for the 6-day period for each patient and the corresponding\ndifference in the SOM output coordinates. The correlation was\nfound to be r = 0.73, p < 0.01).\n\nWe conclude that daytime pain levels are not directly corre-\nlated with sleep in the following night and that sleep is not directly\ncorrelated with daytime pain levels on the following day in this\ngroup of patients. There appears to be a correlation between the\ndifference in nighttime activity levels and patterns and the day-\ntime pain variance. Patients who experience large fluctuations in\ndaytime pain levels also show a higher variability in their night-\ntime activity levels and patterns. Even though we were unable\nto show a direct relationship between daytime pain and sleep, it\nmay be reasonable to assume that better pain control resulting in\nless daytime pain fluctuations can provide more stable nighttime\nactivity levels and patterns in this limited group of patients. By\nusing a neural network model, we were able to extract informa-\ntion from the nighttime activity levels even though a traditional\nstatistical analysis was unsuccessful.\n\nKEY WORDS. activity, chronic back pain, correlation, self-organizing\nmap neural network.\n\nINTRODUCTION\n\nPatients with chronic back pain may complain of disturbed\nsleep [1–3]. It is often assumed that poor sleep in this group\n\n\n\n412 Journal of Clinical Monitoring and Computing Vol 19 No 6 2005\n\nof patients may contribute to increased daytime pain. There\nmay also be associations between sleep and mood, which\nmay further affect patient’s perception of pain. Many times,\npatients with chronic back pain are treated with antide-\npressants, often with sedative properties, in an attempt to\nprovide better nighttime rest and secondly for improved\ndaytime pain control [4].\n\nPain is a subjective experience which makes it difficult\nto measure and analyze. However, analysis of pain levels\ncollected at different times from the same patient may be\nmore easily performed. If a scale between 0 and 10 is used,\nthe scale may not always follow linear properties. Analy-\nsis of pain levels collected from different patients can be\nmore difficult, since the measurements are subjective. In\nthis study, we have correlated pain levels with activity lev-\nels collected from the same patient.\n\nSleep can be evaluated using polysomnography, however,\nit requires extensive preparations. It has to be performed\nin a laboratory environment and is expensive. More re-\ncently, activity monitors such as the Actigraph (Minimitter\nInc.) are available for studies of sleep quality [5]. There are\nsoftware packages which may be used to analyze the infor-\nmation from the activity monitor, and a number of sleep\nparameters may be derived [6–10]. Studies have shown that\nactivity monitor derived sleep parameters correlate with the\ninformation provided from polysomnography. We used the\nActigraph activity monitor and its software package to in-\nvestigate nighttime activity (sleep) in the patients enrolled\nin this study.\n\nThe neural network analysis used in this study was based\non a Self-Organizing Map Network (SOM) [11]. Neu-\nral networks have been used in a variety of applications\nand in many fields including medicine [12, 13]. The SOM\nnetwork provides a powerful tool for analyzing problems\nwhich involves categorization and pattern recognition [14,\n15]. The algorithm used in the SOM network allows the\norder in the data to be preserved in the output. Another ad-\nvantage with SOM networks is their insensitivity to noise,\nsince it will be evenly distributed throughout the entire\noutput layer.\n\nMETHOD\n\nPain is typically measured using a linear scale between 0 and\n10, where 0 indicates no pain and 10 indicates the worst\npossible pain. Often, patients are asked to record their pain\nlevels using a paper diary [16]. In this study, we have used\na semi-automatic pocket sized electronic pain diary. This\ndiary may be programmed to prompt the patients to en-\nter a current pain level at various time intervals. We pro-\ngrammed the diary to prompt the patients to enter a pain\n\nlevel between 0 and 10 every 90 min between 0800 hours\nand 2200 hours for 6 consecutive days. Patients were al-\nlowed to enter additional pain levels if they experienced\nfluctuations in their pain outside the scheduled measure-\nments. However, additional pain measurements only con-\ntributed an additional 10–15% compared to the scheduled\nmeasurements in any single patient. Since the pain levels\nwere only collected on average every 90 min and at uneven\nintervals, an interpolation using cubic splines [17, 18] was\nperformed. A total mean pain level was calculated from the\ninterpolated pain levels for each patient. Also, a daily mean\npain level was calculated for each patient and each day. The\ndifference between the total pain level and the daily pain\nlevel was calculated for each patient and each day. Pain level\nvariance was also calculated for each patient for the entire\nmeasurement period.\n\nNighttime activity was recorded using an Actigraph AW-\n64 (Minimitter Inc.) for the corresponding 5 nights. The\nActigraph is an automatic passive device for activity moni-\ntoring [19]. It is often placed on the non-dominant arm, as\nin this study, but other sites may be used. It is assumed that\nthe Actigraph reflects the patients overall activity. Previ-\nous studies have established good correlations between dif-\nferent monitoring sites as well as between Actigraph data\nand other measurements of activity [20]. The Actigraph\ncan be programmed to sample activity counts at different\ntime intervals. In this study the sampling rate was set to\n1 min.\n\nThe Actigraph has been used to characterize sleep qual-\nity through a number of different parameters which can\nbe derived using a sleep software package [6]. In the first\npart of this study, the Actigraph sleep software was used\nto derive a number of parameters which were then in-\nvestigated for correlations with daytime pain levels. The\nsleep software parameters used were: Actual Sleep Per-\ncentage, Sleep Efficiency, Wake Bouts, Number of Min-\nutes Immobile, Number of Immobile Phases and Move-\nment/Fragmentation Index. A bedtime of 2400 hours and\na get up time of 0600 hours was assumed.\n\nIn the second part of the study, the activity data was\nanalyzed using a neural network technique where a Self-\nOrganizing Map Network (SOM) was used [11]. The\nsoftware package used was the Nworks Professional 2\n(NeuralWare Inc.). The SOM consisted of 360 process-\ning elements in the input layer, 10 processing elements\n(10 × 1) in the Kohonen layer and 1 processing element in\nthe output layer. The network was trained with the activity\ndata from 10 randomly selected patients. Recall was then\nperformed on the entire data set, one patient at the time.\nThe output from the SOM provides a measurement of the\nappearance of the nighttime activity level data from each\npatient and each night. A difference between the maxi-\nmum and minimum SOM output data was calculated for\n\n\n\nLiszka-Hackzell and Martin: Analysis of Nighttime Activity and Daytime Pain in Patients 413\n\neach patient as a measure of fluctuations in that particular\npatient’s nighttime activity.\n\nIn the first part of the study, correlations were calculated\nbetween each patient’s difference in daily mean pain lev-\nels and the corresponding sleep software parameters for the\nprevious night as well as the following night using SPSS 7.5\n[21]. In the second part of the study, we calculated corre-\nlations between the pain variance and the SOM difference\nfor each patient.\n\nRESULTS\n\nThe average age of the patients was 52 ± 10.5 years and\nconsisted of 10 males and 8 females. Of the 19 patients who\nwere initially enrolled, 18 patients completed the study. We\nwere unable to show any significant correlations between\nthe Actiwatch sleep parameters and daytime mean pain\ndifferences, which would have indicated a temporal rela-\ntionship between sleep and daytime pain (day before and\nfollowing day). The analysis of correlations between the\nSOM difference and pain variance revealed a significant\nrelationship for the entire group of patients. A correlation\ncoefficient of r = 0.73 (p < 0.01) was found (Figure 1).\n\nThe SOM difference, being a measurement of the fluc-\ntuations in patient’s nighttime activity levels/patterns, pro-\nvides information about how different each patient’s night-\ntime activity was during the measurement period (Figure\n2). The length of each line (each patient), indicates how\ndifferent each nighttime activity levels and patterns were.\nFor example, patient number 11 showed a large difference\nbetween each nighttime activity levels and patterns, while\n\nFig. 1. Scatter plot of the variance in daytime pain levels and the difference in\nSOM output coordinates for all patients in the study (r = 0.73, p < 0.01).\n\nFig. 2. Plot of the output coordinates from the 1-dimensional SOM Network\n(Kohonen layer). The output is standardized to a value between −1 and 1.\nThere are 5 values (5 nights) from each patient.\n\npatient number 17 appeared to have similar nighttime ac-\ntivity levels and patterns during the measurement period.\n\nDISCUSSION\n\nA combination of the electronic symptom diary and\nthe activity monitor can be used to measure pain semi-\nautomatically and nighttime activity continuously. This re-\nduces problems of inaccuracy and likely improves com-\nplience. The electronic diary requires an active patient in-\nput, or else will automatically prompt the patients to do\nso. Also, previous measurements are not available to the\npatient, which will likely reduce the possibility of patient\nrecall bias. The activity monitor is a passive device which\nrequires no active patient input and actually provides an\nobjective measurement of the patients overall activity.\n\nPrevious studies [20] have indicated that the placement\nof the activity monitor is less important as long as it is\nplaced consistently at the same location during a study. It\nhas also been shown that the activity monitor correlates\nwell with other measurements of activity. The actiwatch\nhas been used to monitor sleep [6], and together with spe-\ncialized software, it may be used to derive a number of sleep\nparameters which has been shown to correlate well with\nother sleep monitoring methods.\n\nThe analysis of correlation between the sleep parame-\nters derived from the Actiwatch using the sleep analysis\nsoftware and the individual mean pain levels did not re-\nveal any significant relationships. We were unable to show\na temporal relationship between the sleep parameters and\nthe mean daytime pain levels the day before or after. Even\nthough the sleep analysis parameters have been shown to\ncorrelate with information derived from polysomnography,\nthey are calculated using fairly simple algorithms based on\n\n\n\n414 Journal of Clinical Monitoring and Computing Vol 19 No 6 2005\n\nthe number of activity counts within a defined period of\ntime. This approach does not consider the appearance and\npatterns of the data since it utilizes a strictly rule based\nsystem to interpret the activity information.\n\nBy using a neural network technique (SOM), the activity\nlevel data can be analyzed not only depending on its level,\nbut also depending on its appearance and patterns [14]. The\nSOM network is a helpful tool for providing categorization\nand pattern recognition. It is important that the order in\nthe data is preserved in the output. This means that output\nvalues that are close to each other implies that the input\ndata is similar while output values that are far apart indicates\na large difference in the input data. A SOM network is not\nsensitive to noise, since it tends to be evenly distributed\nthroughout the output layer.\n\nWe could show that there was a significant correlation\nbetween the difference in the SOM output data and the\ndaytime pain variance for each patient over the entire study\nperiod. The SOM difference may be considered a measure-\nment of how different the nighttime activity is from night\nto night in a single patient. A patient with a small SOM dif-\nference likely behaves similarly from night to night, while\na patient with a large SOM difference may have an uneven\nnighttime activity pattern. The daytime pain variance is an\nindicator of the magnitude of pain fluctuations during the\nstudy period. A relationship between these two parameters\nmay indicate that large fluctuations in nighttime activity is\nrelated to large fluctuations in daytime pain. This may indi-\nrectly suggest that better daytime pain control may provide\na more homogenous nighttime activity with less fluctua-\ntions from night to night in this category of patients.\n\nIn the first part of the study, conventional statistical anal-\nysis was used to explore correlations between daytime pain\nand nighttime activity. A neural network model was used\nto further explore the nighttime activity data in the second\npart of the study. The neural network model provided in-\nformation about the appearance of the nighttime activity\ndata, which could be correlated with daytime pain fluctu-\nations.\n\nThis study was funded by a grant from Mayo Foundation, Rochester,\nMinnesota.\n\nReferences\n\n1. Drewes AM, Svendsen L, Taagholt SJ, Bjerregard K, Nielsen\nKD, Hansen B. Sleep in Rheumatoid arthritis: A comparison\nwith healthy subjects and studies of sleep/wake interactions. Br\nJ Rheumatol 1998; 37: 71–81.\n\n2. Lobbezoo F, Thon MT, Remillard G, Montplaisir JY, Lavigne\nGJ. Relationship between sleep, neck muscle activity, and\n\npain in cervical dystonia. Can J Neuro Sci 1996; 23(4): 285–\n290.\n\n3. Pilowsky I, Crettenden I, Townley M. Sleep disturbance in pain\nclinic patients. Pain 1985; 23: 27–33.\n\n4. Wilson KG, Watson ST, Currie SR. Daily diary and ambulatory\nactivity monitoring of sleep in patients with insomnia associated\nwith chronic musculosceletal pain. Pain 1998; 75: 75–84.\n\n5. Cole RJ, Kripke DF, Gruen W, Mullaney DJ, Gillin JC. Auto-\nmatic sleep/wake identification from wrist activity. Sleep 1992;\n15(5): 461–469.\n\n6. Jean-Louis G, von Gizycki H, Zizi F, Fookson J, Spielman A,\nNunes J, Fullilove R, Taub H. Determination of sleep and wake-\nfulness with the actigraph data analysis software. Sleep 1996;\n19(9): 739–743.\n\n7. Jean-Louis G, von Gizycki H, Zizi F, Spielman A, Hauri A, Taub\nH. The actigraph data analysis software: I. A novel approach\nto scoring and interpreting sleep-wake activity. Perceptual and\nMotor Skills 1997; 85: 207–216.\n\n8. Jean-Louis G, von Gizycki H, Zizi F, Spielman A, Hauri A, Taub\nH. The actigraph data analysis software: II. A novel approach\nto scoring and interpreting sleep-wake activity. Perceptual and\nMotor Skills 1997; 85: 219–226.\n\n9. Jean-Louis G, Zizi F, von Gizycki H, Hauri P. Actigraph as-\nsesment of sleep in insomnia: Application of the actigraph\ndata analysis software (ADAS). Physiol Behav 1999; 65: 659–\n663.\n\n10. Jean-Louis G, Mendlowicz MV, Gillin JC, Rapaport MH,\nKelsoe JR, Zizi F, Landolt H-P, von Gizycki H. Sleep Esti-\nmation from wrist activity in patients with major depression.\nPhysiol Behav 2000; 70: 49–53.\n\n11. Klimasauskas K. Neural Computing, A Technology Handbook.\nNeuralWare Inc. 1993.\n\n12. Gabor AJ, Leach RR, Dowla FU. Automated seizure detection\nusing a self-organizing neural network. Electroencephalogr Cli\nNeurophysiol 1996; 99: 257–266.\n\n13. Kaartinen J, Hiltunen Y, Kovanen PT, Ala-Korpela M. Applica-\ntion of self-organizing maps for the detection and classification\nof human blood plasma lipoprotein lipid profiles on the basis\nof 1H NMR spectroscopy data. NMR Biomed 1988; 11: 168–\n176.\n\n14. Kohonen T. Self-Organizing and Associative Memory.\nSpringer-Verlag, 1989.\n\n15. Pao YH. Adaptive Pattern Recognition and Neural Networks.\nAddison-Wesley, 1989.\n\n16. Rosier EM, Iadarola MJ, Coghill RC. Reproducibility of pain\nmeasurement and pain perception. Pain 2002; 98: 205–216.\n\n17. Giakas G, Baltzopoulos V. A comparison of automatic filtering\ntechniques applied to biomechanical walking data. J Biomech\n1997; 30: 847–850.\n\n18. Golitschek MV, Schardt FW. Determination of transients and\ncompensation capacities of breath-by-breath analysis by cubic\nsplines. Med Eng Phy 1997; 19: 475–480.\n\n19. Shirota A, Tamaki M, Hayashi M, Hori T. Effects of daytime\nactivity on nocturnal sleep in elderly. Psy Cli Neurosci 2000;\n54: 309–310.\n\n20. Patterson SM, Krantz DS, Montgomery LC, Deuster PA,\nHedges SM, Nebel LE. Automated physical activity monitoring:\nValidation and comparison with physiological and self-report\nmeasures. Psychophysiology 1993; 30: 296–305.\n\n21. SPSS Version 7.5 Users Manual.\n\n\n", "status": 200, "abstract": "There may be a relationship between sleep andpain in patients with chronic back pain. We collected day-time pain and nighttime activity data from 18 patients diagnosedwith chronic back pain. The patients were followed for 6 daysand 5 nights. Pain levels were collected every 90 min between0800 hours and 2200 hours using a computerized electronic di-ary. Activity levels were collected using a wrist accelerometer(Actiwatch AW-64). The Actiwatch sampled activity counts ev-ery 1 min. Patients were asked to wear the Actiwatch on theirnon-dominant arm.The pain level measurements were interpolated using cu-bic splines. A mean pain level was calculated for each period0800 hours to 2200 hours as well as for the 6-day period. Thedifference between the mean pain levels for the 6-day period andeach 0800 hours to 2200 hours period was calculated for each pa-tient. Nighttime activity data were analyzed using the ActiwatchSleep Analysis software.Correlations were calculated between the Actiwatch SleepAnalysis variables and the mean pain level differences for eachpatient and period. The correlation analysis was performed withSPSS 7.5. We were unable to show any signiﬁcant relationships.A different approach to analyze the data was used. A Self-Organizing Map (SOM) Neural Network was trained using theoriginal nighttime activity level time series from 10 randomly se-lected patients. Recall was then performed on all the activity leveldata. Correlations were calculated between the pain level vari-ance for the 6-day period for each patient and the correspondingdifference in the SOM output coordinates. The correlation wasfound to be r = 0.73, p < 0.01).We conclude that daytime pain levels are not directly corre-lated with sleep in the following night and that sleep is not directlycorrelated with daytime pain levels on the following day in thisgroup of patients. There appears to be a correlation between thedifference in nighttime activity levels and patterns and the day-time pain variance. Patients who experience large ﬂuctuations indaytime pain levels also show a higher variability in their night-time activity levels and patterns. Even though we were unableto show a direct relationship between daytime pain and sleep, itmay be reasonable to assume that better pain control resulting inless daytime pain ﬂuctuations can provide more stable nighttimeactivity levels and patterns in this limited group of patients. Byusing a neural network model, we were able to extract informa-tion from the nighttime activity levels even though a traditionalstatistical analysis was unsuccessful."}