{"metadata": {"Author": ["Ozhan Ozkan", "Murat Yildiz", "Evren Arslan", "Sedat Yildiz", "Suleyman Bilgin", "Selami Akkus", "Hasan R. Koyuncuoglu", "Etem Koklukaya"], "Content-Type": "application/pdf", "Creation-Date": "2016-02-24T14:59:35Z", "CrossMarkDomains[1]": "springer.com", "CrossMarkDomains[2]": "springerlink.com", "CrossmarkDomainExclusive": "true", "CrossmarkMajorVersionDate": "2016-02-24", "Keywords": "Biomedical signal processing, Biomedical data analysis, Fibromyalgia syndrome (FMS), Sympathetic skin response (SSR), Autonomic nervous system (ANS), Artificial neural networks (ANN)", "Last-Modified": "2016-02-26T02:20:28Z", "Last-Save-Date": "2016-02-26T02:20:28Z", "X-Parsed-By": ["org.apache.tika.parser.DefaultParser", "org.apache.tika.parser.pdf.PDFParser"], "X-TIKA:content_handler": "ToTextContentHandler", "X-TIKA:embedded_depth": "0", "X-TIKA:parse_time_millis": "138", "access_permission:assemble_document": "true", "access_permission:can_modify": "true", "access_permission:can_print": "true", "access_permission:can_print_degraded": "true", "access_permission:extract_content": "true", "access_permission:extract_for_accessibility": "true", "access_permission:fill_in_form": "true", "access_permission:modify_annotations": "true", "cp:subject": "J Med Syst, doi:10.1007/s10916-015-0406-0", "created": "2016-02-24T14:59:35Z", "creator": ["Ozhan Ozkan", "Murat Yildiz", "Evren Arslan", "Sedat Yildiz", "Suleyman Bilgin", "Selami Akkus", "Hasan R. Koyuncuoglu", "Etem Koklukaya"], "date": "2016-02-26T02:20:28Z", "dc:creator": ["Ozhan Ozkan", "Murat Yildiz", "Evren Arslan", "Sedat Yildiz", "Suleyman Bilgin", "Selami Akkus", "Hasan R. Koyuncuoglu", "Etem Koklukaya"], "dc:description": "J Med Syst, doi:10.1007/s10916-015-0406-0", "dc:format": ["application/pdf; version=\"A-2b\"", "application/pdf; version=1.4"], "dc:language": "EN", "dc:subject": "Biomedical signal processing, Biomedical data analysis, Fibromyalgia syndrome (FMS), Sympathetic skin response (SSR), Autonomic nervous system (ANS), Artificial neural networks (ANN)", "dc:title": "A Study on the Effects of Sympathetic Skin Response Parameters in Diagnosis of Fibromyalgia Using Artificial Neural Networks", "dcterms:created": "2016-02-24T14:59:35Z", "dcterms:modified": "2016-02-26T02:20:28Z", "description": "J Med Syst, doi:10.1007/s10916-015-0406-0", "doi": "10.1007/s10916-015-0406-0", "language": "EN", "meta:author": ["Ozhan Ozkan", "Murat Yildiz", "Evren Arslan", "Sedat Yildiz", "Suleyman Bilgin", "Selami Akkus", "Hasan R. Koyuncuoglu", "Etem Koklukaya"], "meta:creation-date": "2016-02-24T14:59:35Z", "meta:keyword": "Biomedical signal processing, Biomedical data analysis, Fibromyalgia syndrome (FMS), Sympathetic skin response (SSR), Autonomic nervous system (ANS), Artificial neural networks (ANN)", "meta:save-date": "2016-02-26T02:20:28Z", "modified": "2016-02-26T02:20:28Z", "pdf:PDFVersion": "1.4", "pdf:charsPerPage": ["3348", "5125", "3947", "2687", "3460", "3435", "3295", "1667", "5885"], "pdf:docinfo:created": "2016-02-24T14:59:35Z", "pdf:docinfo:creator": "Ozhan Ozkan", "pdf:docinfo:creator_tool": "3B2 Total Publishing System 8.07e/W Unicode ", "pdf:docinfo:custom:CrossMarkDomains[1]": "springer.com", "pdf:docinfo:custom:CrossMarkDomains[2]": "springerlink.com", "pdf:docinfo:custom:CrossmarkDomainExclusive": "true", "pdf:docinfo:custom:CrossmarkMajorVersionDate": "2016-02-24", "pdf:docinfo:custom:doi": "10.1007/s10916-015-0406-0", "pdf:docinfo:keywords": "Biomedical signal processing, Biomedical data analysis, Fibromyalgia syndrome (FMS), Sympathetic skin response (SSR), Autonomic nervous system (ANS), Artificial neural networks (ANN)", "pdf:docinfo:modified": "2016-02-26T02:20:28Z", "pdf:docinfo:producer": "Acrobat Distiller 9.0.0 (Windows)", "pdf:docinfo:subject": "J Med Syst, doi:10.1007/s10916-015-0406-0", "pdf:docinfo:title": "A Study on the Effects of Sympathetic Skin Response Parameters in Diagnosis of Fibromyalgia Using Artificial Neural Networks", "pdf:encrypted": "false", "pdf:hasMarkedContent": "false", "pdf:hasXFA": "false", "pdf:hasXMP": "true", "pdf:unmappedUnicodeCharsPerPage": ["0", "0", "0", "0", "0", "0", "0", "0", "0"], "pdfa:PDFVersion": "A-2b", "pdfaid:conformance": "B", "pdfaid:part": "2", "producer": "Acrobat Distiller 9.0.0 (Windows)", "resourceName": "b'53.pdf'", "subject": "J Med Syst, doi:10.1007/s10916-015-0406-0", "title": "A Study on the Effects of Sympathetic Skin Response Parameters in Diagnosis of Fibromyalgia Using Artificial Neural Networks", "xmp:CreatorTool": "3B2 Total Publishing System 8.07e/W Unicode ", "xmpMM:DocumentID": "uuid:e55ffd16-4fef-4837-81e5-e6fab425a888", "xmpMM:History:Action": "converted", "xmpMM:History:InstanceID": "uuid:844b40f6-05c6-4354-937e-54adeb6b0fdf", "xmpMM:History:SoftwareAgent": "pdfToolbox", "xmpMM:History:When": "2016-02-26T10:20:28Z", "xmpTPg:NPages": "9"}, "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nA Study on the Effects of Sympathetic Skin Response Parameters in Diagnosis of Fibromyalgia Using Artificial Neural Networks\n\n\nSYSTEMS-LEVEL QUALITY IMPROVEMENT\n\nA Study on the Effects of Sympathetic Skin Response Parameters\nin Diagnosis of Fibromyalgia Using Artificial Neural Networks\n\nOzhan Ozkan1 & Murat Yildiz1 & Evren Arslan1 & Sedat Yildiz2 & Suleyman Bilgin3 &\nSelami Akkus4 & Hasan R. Koyuncuoglu5 & Etem Koklukaya6\n\nReceived: 22 April 2015 /Accepted: 16 November 2015 /Published online: 8 December 2015\n# Springer Science+Business Media New York 2015\n\nAbstract Fibromyalgia syndrome (FMS), usually observed\ncommonly in females over age 30, is a rheumatic disease\naccompanied by extensive chronic pain. In the diagnosis of\nthe disease non-objective psychological tests and physiologi-\ncal tests and laboratory test results are evaluated and clinical\nexperiences stand out. However, these tests are insufficient in\ndifferentiating FMS with similar diseases that demonstrate\nsymptoms of extensive pain. Thus, objective tests that would\nhelp the diagnosis are needed. This study analyzes the effect\nof sympathetic skin response (SSR) parameters on the auxil-\niary tests used in FMS diagnosis, the laboratory tests and\nphysiological tests. The study was conducted in Suleyman\nDemirel University, Faculty of Medicine, Physical Medicine\nand Rehabilitation Clinic in Turkey with 60 patients diag-\nnosed with FMS for the first time and a control group of 30\nhealthy individuals. In the study all participants underwent\n\nlaboratory tests (blood tests), certain physiological tests (pul-\nsation, skin temperature, respiration) and SSR measurements.\nThe test data and SSR parameters obtained were classified\nusing artificial neural network (ANN). Finally, in the ANN\nframework, where only laboratory and physiological test re-\nsults were used as input, a simulation result of 96.51 % was\nobtained, which demonstrated diagnostic accuracy. This data,\nwith the addition of SSR parameter values obtained increased\nto 97.67 %. This result including SSR parameters –meaning a\nhigher diagnostic accuracy – demonstrated that SSR could be\na new auxillary diagnostic method that could be used in the\ndiagnosis of FMS.\n\nKeywords Biomedical signal processing . Biomedical data\nanalysis . Fibromyalgia syndrome (FMS) . Sympathetic skin\nresponse(SSR) .Autonomicnervoussystem(ANS) .Artificial\nneural networks (ANN)\n\nIntroduction\n\nFibromyalgia syndrome (FMS) is a common rheumato-\nlogic syndrome which is manifested as chronic and dif-\nfuse musculoskeletal pain. When examined closely, an\nearly diagnosis is possible between the ages of 29–37,\nhowever due to the difficulties in diagnosis and the\nneglect of the disease by the patients the age of diagnosis\nrises to the range of 34–53 [1]. 70–90 % of all FMS patients\nare women [1]. Thus, it could be stated that FMS is prevalent\nin women over the age of 30.\n\nAs a result of studies conducted by the American College\nof Rheumatology (ACR) in 1990’s, it was observed that in\nFMS patients there was a history of extensive pain for more\nthan three months in at least 11 of the 18 sore points selected\nbased on the condition of pain in muscular tissues. Thus, the\n\nThis article is part of the Topical Collection on Systems-Level Quality\nImprovement.\n\n* Evren Arslan\nearslan@sakarya.edu.tr\n\n1 Department of Electrical and Electronics Engineering, Faculty of\nEngineering, Sakarya University, 54187 Sakarya, Turkey\n\n2 Physical Medicine and Rehabilitation Clinic, Egirdir Bone & Joint\nDisease Treatment and Rehabilitation Hospital, Isparta, Turkey\n\n3 Department of Electrical and Electronics Engineering, Faculty of\nEngineering, Akdeniz University, Antalya, Turkey\n\n4 Department of Physical Medicine and Rehabilitation, Faculty of\nMedicine, Yildirim Beyazit University, Ankara, Turkey\n\n5 Department of Neurology, Faculty of Medicine, Suleyman Demirel\nUniversity, Isparta, Turkey\n\n6 Department of Electrical and Electronics Engineering, Faculty of\nEngineering, Gazi University, Ankara, Turkey\n\nJ Med Syst (2016) 40: 54\nDOI 10.1007/s10916-015-0406-0\n\nhttp://orcid.org/0000-0003-2635-2605\nhttp://crossmark.crossref.org/dialog/?doi=10.1007/s10916-015-0406-0&domain=pdf\n\n\nmost important issue to be considered in FMS diagnosis\nis the existence of extensive pain in at least 11 of these\n18 points for more than three months [2]. Consequently,\nif the pain spots of the patients are the same as the points\ndetermined by ACR, further evaluations including psy-\nchological tests are conducted by the specialist physi-\ncians on the patient. On psychological tests, the severity\nequivalents of the pain spots were determined and if\nthese are at an acceptable level, the diagnostic process\nis taken further using laboratory tests and physiological\ntests (auxiliary tests). Auxiliary tests are the final tests in\nevaluation of FMS diagnosis. Although these exhaustive\ntests are sufficient in the diagnosis of FMS, they are far\nfrom being sufficient in differentiation of FMS from\nsimilar diseases with extensive pain. Thus, it is necessary to\ninvestigate additional diagnostic methods in FMS diagnosis\nand exclusion of similar diseases. In 2010, a new approach\nwas developed by ACR to measure pre-diagnostic criteria and\nseverity of symptoms, which considered widespread pain in-\ndex and categorical scales for cognitive symptoms,\nunrefreshed sleep, fatigue, and a number of somatic symp-\ntoms. The new approach ignored the tender point examina-\ntion, which was among the 1990 ACR criteria [2].\n\nSympathetic skin response (SSR), on the other hand, is\nan electrical potential recorded by a measurement device\nafter an unexpected audible or an external electrical stimulus\nwas applied on the electrical charge of an area of skin and\nreflects sudomotor neural activity stimulating sweat glands.\nPrevious studies were not able to determine whether SSR\ndata could be among the methods, which could be used, in\ndirect diagnosis of FMS, however it was considered that it\ncould be related to FMS since it responds to the dysfunc-\ntions in the autonomic nervous system (ANS) [3, 4]. A study\nthat scrutinized the effects of SSR on FMS, the support of\nSSR parameters on the psychological tests, which are the\nmajor tests used for the diagnosis of the disease, was inves-\ntigated. It was observed that the accuracy of the diagnosis as\na result of ANN analysis, where the psychological test re-\nsults were evaluated together with the SSR parameters, was\nhigher than the case where only the psychological test re-\nsults were considered for the diagnosis [5]. In a study by\nUlas et al. conducted to investigate SSR changes in FMS, it\nwas determined that the response latency parameter on SSR\nsignal recorded on the palm and soles of the patients was\nlonger than healthy individuals. The results of that study\ndemonstrated that the changes in the autonomic nervous\nsystem due to the disease could be graded by SSR measure-\nments and by using soft computing methods at the end of\nthe research, more significant information could be obtained\nfrom the signals [4]. Ozgocmen et al. studied the relation-\nship between SSR response latency parameter and the\nHamilton Anxiety Test (HAM-A) that is one of the psycho-\nlogical test utilized for FMS diagnosis, and stated that these\n\ntwo parameters could be correlated at the end of the study\n[6]. In another study, based on the information that FMS\ncauses dysfunctions in the autonomic nervous system,\nTervainen et al. investigated the relationship between certain\nparameters of SSR and autonomic nervous system [7, 8].\nEverhart and Harrison scrutinized the relationship between\nSSR measurements and their functions in the autonomic\nnervous system and their findings demonstrated that auto-\nnomic nervous system could be graded by SSR measure-\nments [9]. A study by Ahuja et al. considered that SSR\nsignal analysis could become more analytical with soft com-\nputing methods and they determined that a new test method\ncould be proposed to help with the diagnosis and treatment\nof psychological and psychiatric diseases that affect the au-\ntonomic nervous system [10]. In another study that exam-\nined the effects of SSR on FMS, laboratory tests, one of the\nauxiliary methods used in the diagnosis of the disease, were\nadministered to the patients and with the aid of a measure-\nment system placed in a special test environment, SSR pa-\nrameter values were obtained. It was observed by consider-\ning the simulation results obtained as a result of ANN anal-\nysis of these data that laboratory tests were supported by\nSSR and increased simulation accuracy [11]. Berger et al.\ninvestigated the relations between the SSR and autonomic\ndysfunction in spinal cord injury (SCI) and they concluded\nthat the SSR can be used together with the other validated\nautonomic tests in the evaluation of SCI [12]. In another\nstudy, Saba and Sultan examined the changes in the\nautonomic nervous system for the rheumatoid arthritis\n(RA) disease. SSR values of the patients and the con-\ntrols were measured to evaluate the changes in ANS for\nRA. They inferentially presented that the statically sig-\nnificant relation between the autonomic nervous system\nand the SSR [13]. In another study by Dag et al. studied on\nautonomic dysfunctions in patients with polycystic ovary syn-\ndrome. They concluded that the polycystic ovary syndrome\ncaused dysfunctions in the autonomic nervous system and this\neffect was showed easily by SSR and R-R interval tests [14].\n\nIn this study, based on the assumption that FMS affects\nautonomic nervous system and SSR in turn is affected by\nthe dysfunctions in the autonomic nervous system, the effects\nof SSR on the auxiliary tests applied in FMS diagnosis were\nexamined in detail. In this context, physiological tests and\nlaboratory tests were conducted on patients diagnosed\nwith FSM and healthy individuals (control group) se-\nlected by specialist physicians in Suleyman Demirel\nUniversity, Faculty of Medicine, Physical Medicine and\nRehabilitation Clinic, and SSR measurements were ob-\ntained from all participants. For the analyses, a multi-\nlayer feed forward neural network (MLFFNN) was cre-\nated and used to scrutinize the effects of the SSR parameters\ncalculated based on SSR measurements on the diagnosis of\nthe disease.\n\n54 Page 2 of 9 J Med Syst (2016) 40: 54\n\n\n\nMaterials and Methods\n\nData Acquisition and Parameter Computation\n\nThe patients, included in the study after the ethical committee\napproval, were selected from the patients that were diagnosed\nwith FMS for the first time and applied to Suleyman Demirel\nUniversity, Faculty of Medicine, Physical Medicine and\nRehabilitation Clinic. The diagnoses were based on the criteria\nstipulated by ACR in 1990. The control group of the study was\nformed by healthy and volunteer individuals who have applied\nto the outpatient clinics of the same hospital for routine check-\nups or were hospital employees, paired with the patient groups\nwith respect to age and gender. Those undergoing a treatment\nthat would affect SSR values, with FMS coexisting diseases,\ntaken alcohol, tobacco, tea or coffee during the last twenty-four\nhours before the measurement, consumed a meal with high\ncalories during the last six hours before the measurement, not\nwilling to obey measurement protocols were excluded from the\nstudy. The patients and healthy individuals were examined\nby specialist physicians for conformity to the established\ncriteria. The participants were informed about the mea-\nsurement process and they have signed written assent\nforms. Then, laboratory tests were performed and after\n15 min of rest, heart and respiration rates per minute were\ntaken. Before this process, the skin temperatures of the area\nthat SSR measurements will be taken from were determined\nand average skin temperatures were calculated.\n\nSSR records were taken in a silent and illuminated room\nwith a suitable temperature (22 °C – 24 °C), while the patient\nwas in a sitting position using a system set up at Physical\nMedicine and Rehabilitation Clinic (PowerLab 8/30 with\nLabChart Pro, Data Acquisition Systems, AD Instruments,\nInc. Colorado Springs, CO, USA). Ring electrodes placed at\nthe middle bone level on the left hand second and third fingers\nwere used as recording electrodes. Stimulations were given\nusing a stimulator placed at the median nerve block in the\nright forearm area. The stimulation current strength applied\nwas 0.01A. To prevent the decrease in the reaction of the skin\nagainst the stimulation due to the repetition of the stimulation,\nthe lag between two stimulations were adjusted to be\nmore than 30 s and 5 stimulations were applied in ran-\ndom intervals. When the measurement quality was de-\ntermined to be low, the number of stimulations was\nincreased and when no response to at least 5 stimulations\nwas observed the measurement was classified as Bno\nresponse^ and excluded from the study.\n\nThe parameters used in the studywere SSR response latency\ntime (SSRLT), SSR maximum amplitude (SSRMAX-A), the\ntime interval between the stimuli applied (SSRTT), laboratory\ntest results (blood tests) and physiological test (heart rate, skin\ntemperature, respiration measurements) results. SSR response\nlatency time is the time that passes between the initiation of the\n\nstimulus artifact and the beginning point of the change in sym-\npathetic skin response [15]. Maximum amplitude value is the\n\nTable 2 Minimum, maximum, mean and standard deviation values of\nCRP, RF, Sedim., WBC, HB, PLT values for all participants (a), patients\n(b) and controls (c) respectively)\n\nMin. Max. Mean STD.\n\na. All Ss. (86)\n\nCRP 2 20 3,967 2,609\n\nRF 8,060 29 10,177 3,273\n\nSedim. 1 65 15,860 11,204\n\nWBC 3800 11900 7152,326 1463,897\n\nHB 11,100 16,700 13,557 1,173\n\nPLT 142000 387000 259279,070 52924,286\n\nb. Patients (57)\n\nCRP 2,660 20 4,175 2,982\n\nRF 8,060 29 10,109 3,156\n\nSedim. 1 65 16,351 12,392\n\nWBC 3800 11900 7245,614 1544,121\n\nHB 11,100 16,700 13,586 1,210\n\nPLT 142000 387000 268315,789 57206,443\n\nc. Controls (29)\n\nCRP 2 10,400 3,558 1,618\n\nRF 9,220 28 10,312 3,545\n\nSedim. 5 41 14,897 8,516\n\nWBC 5000 10000 6968,966 1297,829\n\nHB 11,600 16,500 13,500 1,116\n\nPLT 153000 308000 241517,241 38273,098\n\nSs Subjects, Temp. Temperature, STD Standard deviation, RF\nRheumatoid factor, CRP C-reactive protein, WBC White blood cell, HB\nHemoglobin, PLT Platelet, Sedim. Sedimentation\n\nTable 1 Minimum, maximum, mean and standard deviation values of\nSSR parameters for all subjects (a), patients (b) and controls (c)\nrespectively\n\nMin. Max. Mean STD.\n\na. All Ss. (86)\n\nLT (sn) 0,365 17,246 2,478 3,148\n\nTT (sn) 28,250 70,610 46,888 9,259\n\nMax-A (μV) 0,005 9,140 2,760 2,282\n\nb. Patients (57)\n\nLT (sn) 0,417 17,246 2,902 3,547\n\nTT (sn) 28,250 67,644 47,036 8,562\n\nMax-A (μV) 0,005 9,140 2,680 2,267\n\nc. Controls (29)\n\nLT (sn) 0,365 3,942 1,328 0,926\n\nTT (sn) 28,288 70,610 46,488 10,918\n\nMax-A (μV) 0,258 8,810 2,950 2,312\n\nSs Subjects, LT Latency time, TT Total time, Max-A Maximum ampli-\ntude, STD Standard deviation, SSR Sympathetic skin response\n\nJ Med Syst (2016) 40: 54 Page 3 of 9 54\n\n\n\nlargest potential change obtained between two stimuli [16]; and\nthe time between the stimuli is the time that passes between a\nstimulus applied to measure the SSR and the successive stim-\nulus that follows. The numerical values of these parameters are\nobtained using calculations on Matlab (http://www.mathworks.\ncom/products/matlab/) mathematical programming software\nusing SSR graphics transferred into computing environment\nvia the interface on the measurement system. Minimum,\nmaximum, mean and standard deviation values for the SSR\nparameter values obtained from the patient and control groups\nare displayed in Table 1.\n\nOne of the auxiliary tests conducted in laboratory environ-\nment, blood tests are rheumatoid factor (RF), c-reactive pro-\ntein (CRP), white blood cell count (WBC), hemoglobin count\n(HB), platelet count (PLT) and sedimentation (sedim) mea-\nsurements conducted to differentiate the disease with other\ndiseases with similar symptoms [17]. These tests were imple-\nmented by specialist physicians and recorded. Other auxiliary\ntests are the physiological tests; namely the skin temperature,\nheart rate and respiratory rate. Skin temperature of the partic-\nipants were taken by specialist physicians at Suleyman\nDemirel University, Faculty of Medicine, Physical Medicine\nand Rehabilitation Clinic, using the skin temperature probe of\n\nthe Cadwell Sierra Wedge EMG/NCV brand, 2 channel EMG\ndevice. Per minute hear rates of the participants were deter-\nmined by the examination and SSR records of the participants.\nPer minute respiratory rate of the participants was determined\nby examination. Minimum, maximum, mean and standard\ndeviation values of blood tests obtained from the patient and\ncontrol groups are displayed in Table 2.\n\nFigure 1 and Fig. 2 demonstrates the graphs on these phys-\niological test results obtained from the patients with FMS and\nthe control group, Table 3 displays the minimum, maximum,\nmen and standard deviation valued for these. These two fig-\nures display the number of participants for control group and\npatient group as 30 and 60 respectively; however the number\nof participants that measurements could be taken was 29 for\nthe control group and 57 for the patient group. No responses\nwere obtained from 3 patients and 1 healthy individual for at\nleast 5 stimuli and hence they were excluded from the system.\nThus, the total number of participants who were excluded\nfrom the study was 86.\n\nTable 3 Minimum, maximum, mean and standard deviation values of\nskin temperature, pulsation and respiration values for all participants (a),\npatients (b) and controls (c) respectively\n\nMin. Max. Mean STD.\n\na. All Ss. (86)\n\nSkin Temp. 30 34 32,912 0,782\n\nPulsation 60 120 80,278 11,087\n\nRespiration 12 27 17,789 2,953\n\nb. Patients (57)\n\nSkin Temp. 30 34 33,012 0,642\n\nPulsation 60 120 80,767 11,585\n\nRespiration 13 27 18,033 2,869\n\nc. Controls (29)\n\nSkin Temp. 30 34 32,713 0,976\n\nPulsation 63 110 79,300 9,944\n\nRespiration 12 25 17,300 3,057\n\nSs Subjects, Temp. Temperature, STD Standard deviation\n\nFig. 2 Physiological test results\nfor patients (60 subjects)\n\nFig. 1 Physiological test results for controls (30 subjects)\n\n54 Page 4 of 9 J Med Syst (2016) 40: 54\n\nhttp://www.mathworks.com/products/matlab/\nhttp://www.mathworks.com/products/matlab/\n\n\nIn the study, where the classifications were conducted\nusing the MLFFNN method, detailed in the next section, 7\ndifferent input layers that use different combinations of phys-\niological tests, which were heart rate, skin temperature and\nrespiratory rate, laboratory tests (blood tests), and SSR param-\neters, which were response latency time, total time and max-\nimum amplitude values, were designed. These input layers\nwere the following:\n\n1. Laboratory test results and physiological test results\n2. Physiological test results and SSR parameters\n3. Laboratory test results, physiological test results and SSR\n\nparameters\n4. Physiological test results\n5. Laboratory test results\n6. SSR parameters\n7. Laboratory test results and SSR parameters\n\nThe last four cases, where only physiological test results,\nonly laboratory test results, only SSR parameters and SSR\nparameters and laboratory test results together were used,\n\nwere scrutinized in a previous study [11]. But we performed\nagain the all cases with k-fold cross validation (CV)\nmethod for an accurate comparison. So this study evaluates\nthese four cases and the three newly examined three\ncases together. Classification results are detailed in the\nnext section.\n\nMultilayer Feedforward Neural Network (MLFFNN)\n\nOne of the most common methods used to solve various prob-\nlems such as information classification and evaluation today is\nartificial neural networks. ANN are information processing sys-\ntems developed based on biological neural networks and the\nmain objective in an ANN approach is to learn about an event\nbased on the way human brain functions [18]. There are several\ndifferent frameworks developed for ANN. One of these frame-\nworks is the multilayer feedforward neural network. In this net-\nwork, information only moves forward secretly and towards the\noutput layer. Signals are always transported forward and con-\nnection weights could be changed during training [19].\nGenerally, feedforward neural networks are divided into two\ntypes; single-layer and multilayer neural networks. If the net-\nwork structure designed to analyze a specific problem consists\nof only input and output layers, this structure is a single-layer\nfeedforward network framework. In addition to the input and\noutput layers in a single-layer networks, if a network contains\none or more hidden layers, it is called a multilayer feedforward\nnetwork. A sample feedforward network structure is displayed\nin Fig. 3. The layers in the network are expressed as the input,\nhidden, and output layers respectively. In transmission of the\ndata in the input layer to the neurons in the hidden layer, the\nneurons in the input layer are utilized. The neurons in the hidden\nlayer utilize the output of the preceding layer as input [20]. In\nthe figure, the weights between the input layer and the hidden\nlayer are indicated as W1,ji, the weights between the hidden\nlayer and the output layer are indicated as W2,yj. i = 1,2,...\nn are input neurons, j = 1,2,...,m are hidden layer neurons and\ny = 1,2,...,k are output layer neurons [21, 22]. Since MLFNN is\ncommonly used in similar studies in literature, this network\nstructure was preferred in this study; the network was designed\nas multilayered since more reliable test results are observed\nwhen more than one hidden layers are utilized.\n\nNh=5Ni=9\n\nCRP\nRF\nHB\n\nSedim\nWBC\nPLT\n\nPulsation\nSkin Temp.\nRespiration\n\n0=FMS\n1=Healty\n\nHidden Layer Output LayerInput Layer\n\nLW 1,1 LW 2,1\n\nb 2b\n1 11\n\nNo=1\n\nCRP: C-reactive protein, RF: Rheumatoid factor, HB: Hemoglobin count, Sedim: Sedimentation, \n\nWBC: White blood cell count, PLT: Platelet count, Temp: Temperature\n\nFig. 4 ANN model, laboratory\nand physiological test scores are\ninputs. SSR: Sympathetic skin\nresponse, SSRLT: SSR latency\ntime, SSRTT: SSR total time,\nSSRMaxA: SSR maximum\namplitude, Temp: Temperature\n\nFig. 3 Multilayer feedforward neural network model. CRP: C-reactive\nprotein, RF: Rheumatoid factor, HB: Hemoglobin count, Sedim:\nSedimentation, WBC: White blood cell count, PLT: Platelet count,\nTemp: Temperature\n\nJ Med Syst (2016) 40: 54 Page 5 of 9 54\n\n\n\nSimulation Results and Discussion\n\nIn this study, classifications were conducted using multilayer\nfeedforward network models, which were mentioned briefly\nin the previous section and of which input and output are\ndisplayed in Figs. 4, 5 and 6. All analyses are performed in\nMATLAB (http://www.mathworks.com/products/matlab/)\nneural networks tool. In the study, initially physiological and\nlaboratory test results were analyzed with ANN. For this\npurpose a multilayer feedforward ANN structure with an\ninput layer composed of 9 neurons, a hidden layer of 5\nneurons and an output layer of 1 neuron was designed (Fig.\n4). Secondly, the effects of SSR data on physiological tests\nwere examined. For this purpose a multilayer feedforward\nANN structure with an input layer composed of 6 neurons, a\nhidden layer of 8 neurons and an output layer of 1 neuron was\nused (Fig. 5). Finally, the analyses were completed by adding\nlaboratory test results to the physiological test results and SSR\nparameters. The multilayer feedforward artificial neural net-\nwork structure designed in this step had an input layer with 12\nneurons, a hidden level with 9 neurons and an output layer\nwith 1 neuron (Fig. 6). In the output level, individuals with\ndisease were identified with a B0^ and healthy individ-\nuals were identified with a B1^. In the hidden layer of\n\nthe network designed, 30*48 neurons were utilized. In\nthe analysis of the test findings, the number of neurons\nthat yielded 100 % accurate training during the training pro-\ncess and with the highest simulation accuracy was used.\n\nWe used k-fold CV to reduce the bias related with random\nsampling of dataset. K-fold CV divvies dataset up among k\ndifferent subsets that have almost the same size. We examined\ndifferent k values and chose four for our dataset. The training\nand test set of ANNwere formed by the data collected from 86\nparticipants (57 FMS, 29 healthy controls). During the evalu-\nation of physiological test results with the laboratory test re-\nsults, the ANN trained with a 100 % accuracy. ANN classified\nthe patients and healthy individuals and recorded them as\npatients by assigning a B0^ and as healthy by assigning a\nB1^ in the output level. As a result, in the evaluation of phys-\niological test results with the laboratory test results, a simula-\ntion accuracy of 96.51 % was observed. When the physiolog-\nical tests were supported with the data from SSR parameters,\nsimulation accuracy was calculated as 95.35 % in total. In the\nfinal stage of the study, the physiological test results and the\nlaboratory test results were evaluated with the inclusion of\nSSR parameter findings and accuracy rates (sensitivity) of\n100 % for the patient group, (specificity) 93.10 % for the\ncontrol group, and 97.67 % for the patient and control groups\n\nNh=9Ni=12\n\nSSRLT\nSSRMaxA\nSSRTT\nCRP\nRF\nHB\n\nSedim\nWBC\nPLT\n\nPulsation\nSkin Temp.\nRespiration\n\n0=FMS\n1=Healty\n\nHidden Layer Output LayerInput Layer\n\nLW 1,1 LW 2,1\n\nb 2b\n1 11\n\nNo=1\n\nSSR: Sympathetic skin response, SSRLT: SSR latency time, SSRTT: SSR total time, SSRMaxA: \n\nSSR maximum amplitude, Temp: Temperature, CRP: C-reactive protein, RF: Rheumatoid factor, \n\nHB: Hemoglobin count, Sedim: Sedimentation, WBC: White blood cell count, PLT: Platelet \n\ncount, Temp: Temperature\n\nFig. 6 ANN model, SSR\nparameters, laboratory test scores,\nand physiological test scores\nare all inputs\n\nNh=8Ni=6\n\nSSRLT\nSSRMaxA\nSSRTT\n\nPulsation\nSkin Temp.\nRespiration\n\n0=FM\n1=He\n\nHidden Layer Output LayerInput Layer\n\nLW 1,1 LW 2,1\n\nb 2b\n1 11\n\nNo=1\n\nSSR: Sympathetic skin response, SSRLT: SSR latency time, SSRTT: SSR total time, SSRMax\n\nSSR maximum amplitude, Temp: Temperature \n\nFig. 5 ANN model, SSR parameters and physiological test scores are\ninputs. SSR: Sympathetic skin response, SSRLT: SSR latency time,\nSSRTT: SSR total time, SSRMaxA: SSR maximum amplitude, Temp:\n\nTemperature, CRP: C-reactive protein, RF: Rheumatoid factor, HB:\nHemoglobin count, Sedim: Sedimentation, WBC: White blood cell\ncount, PLT: Platelet count, Temp: Temperature\n\n54 Page 6 of 9 J Med Syst (2016) 40: 54\n\nhttp://www.mathworks.com/products/matlab/\n\n\nin total were concluded (overall accuracy). The simulation\naccuracy rates for these studies are displayed in Tables 4.\nWe also reanalyzed the cases (first four) with k-fold CVmeth-\nod in our previous study for an accurate comparison. Table 4\nalso demonstrates the simulation accuracies of these cases.\nSome other statistical parameters are available in Table 5.\nTable 6 displays discriminate analysis and t-test results con-\nducted using SPSS (Statistical Package for Social\nSciences) for all groups. Furthermore Table 6 displays\nthe simulation results of the previous related study dem-\nonstrating that the simulation accuracy increases when\nlaboratory tests used in FMS diagnosis are supported with\nSSR parameters [11]. Figure 7 displays the flow chart for the\nstudy and a summary of total simulation accuracies for all\ncases together.\n\nOur previous study demonstrated that SSR supported the\nlaboratory test results in the diagnosis of FMS via the simula-\ntion accuracy rates obtained using ANN [11]. This study an-\nalyzed the effects of SSR on auxiliary laboratory tests and the\nphysiological tests in the diagnosis of FMS using ANN. For\nexample, the simulation accuracy as a result of the classifica-\ntion of laboratory and physiological tests using ANN was\ncalculated as 96.51 %. When it is considered that the\n\nsimulation accuracy of the laboratory tests on their own was\n95.35 % and the simulation accuracy of the physiological tests\non their own was 95.35 %, it was determined that the evalu-\nation of physiological test findings together with laboratory\ntests increased the simulation accuracy. On the other hand,\nwhen physiological test results were supported by SSR find-\nings an accuracy of 95.35 % was obtained. The last step of the\nstudy, the simulation accuracy of 97.67 % obtained as a result\nof the classification of the laboratory test, physiological test\nand SSR data using ANN is an indicator of the support SSR\ndata provides for both laboratory and physiological tests in\nFMS diagnosis. Furthermore, the simulation accuracy of\n86.4 % (97.67 % with k-fold CV in recent analysis) that was\nfound in the previous study where the laboratory tests were\nsupported with SSR findings demonstrated that SSR parame-\nters supported the laboratory tests more than the physiological\ntests [11]. However, it was also observed that all auxiliary\nmethods had different contributions in the diagnosis of the\ndisease. For instance, when the physiological tests were eval-\nuated with the laboratory tests, the sensitivity for the patient\ngroup is same, but specificity has risen to 96.55 % in the\ndifferentiation of healthy individuals. When SSR param-\neters were added to these tests, the evaluation showed\n\nTable 5 Statistical parameters for overall subjects\n\nPhys. T. Lab. T. SSR Lab. T. &SSR Lab. T. &Phys. T. Phys. T. &SSR Lab. T. &SSR &Phys. T.\n\nOVERALL\n\nPLR 13,99 13,99 9,33 14,50 27,98 13,99 14,50\n\nNLR 0,04 0,04 0,04 0,00 0,04 0,04 0,00\n\nPPV 0,96 0,96 0,95 0,97 0,98 0,96 0,97\n\nNPV 0,93 0,93 0,93 1,00 0,93 0,93 1,00\n\nLab. T. Laboratory tests, Phys. T Physiological tests, SSR Sympathetic skin response, PLR Positive likelihood ratio, NLRNegative likelihood ratio, PPV\nPositive predictive value, NPV Positive predictive value\n\nTable 4 Training, test and overall statistics (%)\n\nPhys. T. Lab. T. SSR Lab. T. &SSR Lab. T. &Phys. T. Phys. T. &SSR Lab. T. &SSR &Phys. T.\n\nTRAINING\n\nSpecificity 100 100 100 100 100 100 100\n\nSensitivity 100 100 100 100 100 100 100\n\nAccuracy 100 100 100 100 100 100 100\n\nTEST\n\nSpecificity 71,43 71,43 57,14 71,43 85,71 71,43 71,43\n\nSensitivity 86,67 86,67 86,67 100 86,67 86,67 100\n\nAccuracy 81,82 81,82 77,27 90,91 86,36 81,82 90,91\n\nOVERALL\n\nSpecificity 93,10 93,10 89,66 93,10 96,55 93,10 93,10\n\nSensitivity 96,49 96,49 96,49 100 96,49 96,49 100\n\nAccuracy 95,35 95,35 94,19 97,67 96,51 95,35 97,67\n\nLab. T. Laboratory tests, Phys. T Physiological tests, SSR Sympathetic skin response\n\nJ Med Syst (2016) 40: 54 Page 7 of 9 54\n\n\n\nthat the sensitivity has risen to 100 %, while specificity\nfor the differentiation of healthy individuals has fallen\nto 93.1 %. Furthermore, according to the results of the\nt-test conducted using SPSS, since p value for SSRLT\n(SSR), PLT (Lab. Test) data were smaller than 0.05 and\nfor skin temperature (Phys. Test) was smaller than 0.1,\nit could be stated that these three parameters were the\nmost significant three parameters in differentiation of ill\nand healthy individuals. Thus, the discriminate analysis results\nfor only these three parameters are in support of this argument\n\n(Table 6). When the results of other discriminate analysis are\nconsidered, it is observed that total accuracy increased when\nlaboratory tests were supported by both SSR and physiologi-\ncal tests (Table 6).\n\nConclusion\n\nAs a result, it could be stated that evaluating more than one\ntest all together more sufficient in FMS diagnosis and SSR\n\nSubjects\n\nLaboratory \n\nTests\n\nSSR \n\nSignal\n\nPhysiological \n\nTests\n\nMaximum \n\nAmplitude\n\nLatency \n\nTime \n\nTotal \n\nTime\n\nSSR \n\nParameters\n\nPulsation, \n\nSkin temp., \n\nRespiration \nBlood Tests\n\nMatlab\nANN*ANN*\n\nANNANN*\n\nANN*\n\nANN\n\nANN\n\n95.35%68.2%\n\n95.35%\n86.4%\n\n94.19\n\n96.51%\n\n97.67%\n\n95.35%\n\n97.67%\n\nSSR: Sympathetic skin response, ANN: Artificial neural network\n\nFig. 7 Basic flowchart of the\nstudy and overall simulation\naccuracies (with previous\nsimulation). SSR: Sympathetic\nskin response, ANN: Artificial\nneural network\n\nTable 6 Discriminant analysis (a) and T test results (b)\n\na.\n\nPhys. T. Lab. T. SSR Lab. T. &SSR Lab. T. &Phys. T. SSRLT&PLT & Skin Temp.\n\nPatients (57) 94,7 93 38,6 91,2 84,2 89,5\n\nControls (29) 10,3 3,4 75,9 20,7 34,5 34,5\n\nAll Ss. (86) 66,3 62,8 51,2 67,4 67,4 70,9\n\nb.\nF Sig.\n\nCRP 2,617 0,11\n\nPLT 5,307 0,02\n\nSkin Temp. 3,068 0,08\n\nSSRLT 13,68 0\n\nSs Subjects, Lab. T. Laboratory tests, Phys. T Physiological tests, SSR Sympathetic skin response, SSRLT SSR latency time,CRPC-reactive protein,PLT\nPlatelet count, Temp. Temperature\n\n54 Page 8 of 9 J Med Syst (2016) 40: 54\n\n\n\nparameters are also used an auxiliary diagnosis method with\nlaboratory and physiological tests. There is a significant con-\ntribution of the support of these tests by physiological tests\nmeasurements on more accurate differentiation of healthy in-\ndividuals and by SSR on more accurate differentiation of the\nindividuals with disease. When the overall accuracy is consid-\nered and when the laboratory tests and physiological tests\nwere evaluated together, a simulation accuracy of 96.51 %\nwas observed, while the laboratory tests were evaluated with\nthe SSR parameters, the overall accuracy rose to 97.67 % and\nsensitivity rose to 100 %. This fact demonstrated the signifi-\ncance of SSR measurements in addition to laboratory tests,\ninstead of physiological tests in differentiation of the patients\nfrom healthy individuals. However, due to the success of the\nphysiological tests in differentiation of the healthy controls, it\nwas proposed that, instead of exclusion of these tests, SSR\nmeasurements should be included among the auxiliary diag-\nnosis methods and all three techniques should be benefited\nfrom. On the other hand the results of this study showed that\nthe SSR is an important parameter in assessment of FMS and\nFMS disease causes dysfunctions in the autonomic nervous\nsystem so that this supports the studies which examined the\neffect of the SSR on the autonomic nervous system. So this\nstudy also supports the relationship between the SSR and the\nFMS dysfunctions.\n\nAcknowledgments This research is funded by The Scientific and\nTechnological Research Council of Turkey (TUBITAK) and Sakarya\nUniversity (Project code: 2009-50-02-016) within the context of the pro-\nject code: 108E036, and titled BEvaluation of HRV, SSR and\nPsychological Tests using Wavelet Transform and Artificial Neural Nets\nfor the diagnosis of Fibromyalgia Syndrome and Determination of\nRelations^. Relevant reference number of ethic committee report is\nB.30.2.SDU.0.01.00.01.301.01/19-271.\n\nReferences\n\n1. Boissevain, M.D., and McCain, G.A., Toward an integrated under-\ns tanding of f ibromyalgia syndrome. I . Medical and\nPathophysiological Aspects. Pain. 45(3):227–238, 1991. doi:10.\n1016/0304-3959(91)90047-2.\n\n2. Wolfe, F., Clauw, D.J., Fitzcharles, M.A., Goldenberg, D.L., Katz,\nR.S., Mease, P., Russell, A.S., Russell, I.J., Winfield, J.B., and\nYunus, M.B., The American college of rheumatology preliminary\ndiagnostic criteria for fibromyalgia and measurement of symptom\nseverity. Arthritis Care Res (Hoboken). 62(5):600–610, 2010. doi:\n10.1002/acr.20140.\n\n3. Ozkan, O., Yildiz, M., Bilgin, S., and Koklukaya, E., Measuring the\nsympathetic skin response on body and using as diagnosis-\npurposed for lung cancer patients by artificial neural networks. J\nMed Syst. 34(3):407–412, 2010. doi:10.1007/s10916-009-9253-1.\n\n4. Ulas, U.H., Unlu, E., Hamamcioglu, K., Odabasi, Z., Cakci, A., and\nVural, O., Dysautonomia in fibromyalgia syndrome: sympathetic\nskin responses and RR interval analysis. Rheumatol Int. 26(5):383–\n387, 2006. doi:10.1007/s00296-005-0007-1.\n\n5. Yildiz, M., Ozkan, O., and Koklukaya, E., Investigating the effect\nof sympathetic skin response parameters on the psychological test\n\nscores in patients with fibromyalgia syndrome by using ANNs.\nSAU J. Sci. 17(1):27–32, 2013.\n\n6. Ozgocmen, S., Yoldas, T., Yigiter, R., Kaya, A., and Ardicoglu, O.,\nR-R interval variation and sympathetic skin response in fibromyalgia.\nArch Med Res. 37(5):630–634, 2006. doi:10.1016/j.arcmed.2005.11.\n008.\n\n7. Tarvainen, M.P., Koistinen, A.S., Valkonen-Korhonen, M.,\nPartanen, J., and Karjalainen, P.A., Analysis of galvanic skin re-\nsponses with principal components and clustering techniques.\nIEEE Trans Biomed Eng. 48(10):1071–1079, 2001.\n\n8. Tarvainen, M.P., Partanen, J., Karjalainen, P.A., Koistinen, A.S.,\nand Valkonen-Korhonen, M., Principal component analysis of gal-\nvanic skin responses. Engineering in Medicine and Biology\nSociety, 2000. Proceedings of the 22nd Annual International\nConference of the IEEE 4:3011–3014, 2000. doi:10.1109/IEMBS.\n2000.901513.\n\n9. Everhart, D.E., and Harrison, D.W., Heart rate and fluency perfor-\nmance among high- and low-anxious men following autonomic\nstress. Int J Neurosci. 112(10):1149–1171, 2002. doi:10.1080/\n00207450290026120.\n\n10. Ahuja ND, Agarwal AK, Mahajan NM, Mehta NH, Kapadia HN\n(2003) GSR and HRV: Its application in clinical diagnosis.\nComputer-Based Medical Systems, 2003. Proceedings. 16th IEEE\nSymposium 1:279–283. doi:10.1109/CBMS.2003.1212802\n\n11. Ozkan, O., Yildiz, M., and Koklukaya, E., The correlation of labo-\nratory tests and sympathetic skin response parameters by using\nartificial neural networks in fibromyalgia patients. J Med Syst.\n36(3):1841–1848, 2012. doi:10.1007/s10916-010-9643-4.\n\n12. Berger, M.J., Hubli, M., and Krassioukov, A.V., Sympathetic skin\nresponses and autonomic dysfunction in spinal cord injury. J\nNeurotrauma. 31(18):1531–1539, 2014. doi:10.1089/neu.2014.\n3373.\n\n13. Saba, E., and Sultan, H., Autonomic nervous system changes asso-\nciated with rheumatoid arthritis: clinical and electrophysiological\nstudy. The Egyptian Rheumatologist. 36(4):157–163, 2014. doi:\n10.1016/j.ejr.2014.03.002.\n\n14. Dag, Z.O., Alpua, M., Turkel, Y., and Isik, Y., Autonomic dysfunc-\ntion in patients with polycystic ovary syndrome. Taiwanese Journal\nof Obstetrics & Gynecology. 54(4):381–384, 2015. doi:10.1016/j.\ntjog.2015.03.002.\n\n15. Ozkan, O., Yildiz, M., and Koklukaya, E., Improving diagnostic\naccuracy by supporting the laboratory tests which used for diagno-\nsis of fibromyalgia syndrome with the sympathetic skin response\nparameters. SAU J. Sci. 15(1):1–7, 2011.\n\n16. Zhai, J., Barreto, A.B., Chin, C., and Li, C., Realization of stress\ndetection using psychophysiological signals for improvement of\nhuman-computer interactions^. Proceedings of the IEEE\nSoutheastcon. 1:415–420, 2005. doi:10.1109/SECON.2005.\n1423280.\n\n17. Evcik, D., Kizilay, B., and Gokcen, E., The effects of balneotherapy\non fibromyalgia patients. Rheumatol Int. 22(2):56–59, 2002. doi:\n10.1007/s00296-002-0189-8.\n\n18. Oztemel, E., Yapay sinir aglari. Papatya Publishing, Istanbul, 2012.\n19. Askin, D., Iskender, I., and Mamizadeh, A., Dry type transformer\n\nwinding thermal analysis using different neural network methods.\nJ. Fac. Eng. Arch. Gazi Univ. 26(4):905–913, 2011.\n\n20. Altun, A.A., and Allahverdi, N., A new approach to recognition of\nfingerprints enhanced by filtering techniques with artificial neural\nnetworks. J. Fac. Eng. Arch. Gazi Univ. 22(2):227–236, 2007.\n\n21. MATLAB® Documentation Neural Network Toolbox Help (2015)\nhttp://www.mathworks.com/help/nnet/index.html. Accessed 26\nFeb. 2015\n\n22. Oz C, Koker R, Cakar S (2002) Yapay Sinir Agları ile Karakter\nTabanlı Plaka Tanıma. Elektrik – Elektronik – Bilgisayar\nMühendisligi Sempozyumu (ELECO), Bursa\n\nJ Med Syst (2016) 40: 54 Page 9 of 9 54\n\nhttp://dx.doi.org/10.1016/0304-3959(91)90047-2\nhttp://dx.doi.org/10.1016/0304-3959(91)90047-2\nhttp://dx.doi.org/10.1002/acr.20140\nhttp://dx.doi.org/10.1007/s10916-009-9253-1\nhttp://dx.doi.org/10.1007/s00296-005-0007-1\nhttp://dx.doi.org/10.1016/j.arcmed.2005.11.008\nhttp://dx.doi.org/10.1016/j.arcmed.2005.11.008\nhttp://dx.doi.org/10.1109/IEMBS.2000.901513\nhttp://dx.doi.org/10.1109/IEMBS.2000.901513\nhttp://dx.doi.org/10.1080/00207450290026120\nhttp://dx.doi.org/10.1080/00207450290026120\nhttp://dx.doi.org/10.1109/CBMS.2003.1212802\nhttp://dx.doi.org/10.1007/s10916-010-9643-4\nhttp://dx.doi.org/10.1089/neu.2014.3373\nhttp://dx.doi.org/10.1089/neu.2014.3373\nhttp://dx.doi.org/10.1016/j.ejr.2014.03.002\nhttp://dx.doi.org/10.1016/j.tjog.2015.03.002\nhttp://dx.doi.org/10.1016/j.tjog.2015.03.002\nhttp://dx.doi.org/10.1109/SECON.2005.1423280\nhttp://dx.doi.org/10.1109/SECON.2005.1423280\nhttp://dx.doi.org/10.1007/s00296-002-0189-8\nhttp://www.mathworks.com/help/nnet/index.html\n\n\tA Study on the Effects of Sympathetic Skin Response Parameters in Diagnosis of Fibromyalgia Using Artificial Neural Networks\n\tAbstract\n\tIntroduction\n\tMaterials and Methods\n\tData Acquisition and Parameter Computation\n\tMultilayer Feedforward Neural Network (MLFFNN)\n\n\tSimulation Results and Discussion\n\tConclusion\n\tReferences\n\n\n\n\n", "status": 200, "abstract": "Fibromyalgia syndrome (FMS), usually observedcommonly in females over age 30, is a rheumatic diseaseaccompanied by extensive chronic pain. In the diagnosis ofthe disease non-objective psychological tests and physiologi-cal tests and laboratory test results are evaluated and clinicalexperiences stand out. However, these tests are insufficient indifferentiating FMS with similar diseases that demonstratesymptoms of extensive pain. Thus, objective tests that wouldhelp the diagnosis are needed. This study analyzes the effectof sympathetic skin response (SSR) parameters on the auxil-iary tests used in FMS diagnosis, the laboratory tests andphysiological tests. The study was conducted in SuleymanDemirel University, Faculty of Medicine, Physical Medicineand Rehabilitation Clinic in Turkey with 60 patients diag-nosed with FMS for the first time and a control group of 30healthy individuals. In the study all participants underwent"}